{
  "id": "9d714b5362b4929883c4005ef413841da5cadc14",
  "title": "New prevention tools and investment in services essential in the fight against AIDS",
  "summary": "On World AIDS Day, the World Health Organization (WHO) calls on governments and partners to rapidly expand access to new WHO-approved tools including lenacapavir (LEN) to drive down infections and counter disruption to essential health services caused by cuts to foreign aid. Despite dramatic funding setbacks, the global HIV response has gained a remarkable…",
  "canonicalUrl": "https://www.who.int/news/item/01-12-2025-new-prevention-tools-and-investment-in-services-essential-in-the-fight-against-aids",
  "source": {
    "id": "who_news",
    "name": "World Health Organization - News (EN)",
    "url": "https://www.who.int/news",
    "feedUrl": "https://www.who.int/rss-feeds/news-english.xml",
    "country": "UN",
    "language": "en"
  },
  "publishedAt": "2025-11-30T17:04:40.000Z",
  "fetchedAt": "2025-12-24T00:05:45.493Z",
  "category": "health",
  "tags": [],
  "image": null,
  "language": "en",
  "storagePath": "data/articles/health/2025/11/30/9d714b5362b4929883c4005ef413841da5cadc14.json",
  "contentText": "On World AIDS Day, the World Health Organization (WHO) calls on governments and partners to rapidly expand access to new WHO-approved tools including lenacapavir (LEN) to drive down infections and counter disruption to essential health services caused by cuts to foreign aid.\n\nDespite dramatic funding setbacks, the global HIV response has gained a remarkable momentum in 2025 with the introduction and WHO approval of twice-yearly injectable lenacapavir for HIV prevention. LEN, a highly effective, long-acting alternative to oral pills and other options, is a transformative intervention for people who face challenges with regular adherence and stigma in accessing health care. WHO released in July this year new guidelines recommending the use of lenacapavir as an additional pre-exposure prophylaxis (PrEP) option for HIV prevention.\n\nSharp and sudden reductions in international funding this year led to disruptions in HIV prevention, treatment and testing services, with essential community-led programmes, including pre-exposure prophylaxis (PrEP) and harm reduction initiatives for people who inject drugs, being scaled back or shut down entirely in some countries.\n\n&ldquo;We face significant challenges, with cuts to international funding, and prevention stalling,\" said Dr Tedros Adhanom Ghebreyesus, WHO Director-General. &ldquo;At the same time, we have significant opportunities, with exciting new tools with the potential to change the trajectory of the HIV epidemic. Expanding access to those tools for people at risk of HIV everywhere must be priority number one for all governments and partners.&rdquo;\n\nMarking World AIDS Day under the theme &ldquo;Overcoming disruption, transforming the AIDS response&rdquo; , WHO is urging a dual track approach &ndash; solidarity and investment in innovations to protect and empower communities most at risk.\n\nAfter decades of progress, the HIV response stands at a crossroads. In 2024:\n\n- HIV prevention efforts stagnated, with 1.3&nbsp;million new infections, disproportionately impacting key and vulnerable populations;\n\n- UNAIDS data reveal that almost half (49%) of new HIV infections occurred among key populations &ndash; including sex workers, men who have sex with men, transgender women, and people who inject drugs &ndash; and their sexual partners;\n\n- while sex workers and transgender women face a 17-fold higher risk of acquiring HIV, men who have sex with men face an 18-fold higher risk, and people who inject drugs &ndash; a 34-fold higher risk;\n\n- underlying drivers include stigma, discrimination, and legal, social and structural barriers these groups face to access HIV care; and\n\n- globally, an estimated 40.8 million people were living with HIV, and 630 000 people died from HIV-related causes.\n\nWhile the full scale of the impact of foreign aid cuts is still being assessed, access to PrEP is believed to have declined dramatically. The AIDS Vaccine Advocacy Coalition estimates that, as of October 2025, 2.5 million people who used PrEP in 2024 lost access to their medications in 2025 due solely to donor funding cuts. Such disruptions could have far-reaching consequences for the global HIV response, jeopardizing efforts to end AIDS by 2030.\n\nMomentum for innovation\n\n&ldquo;We are entering a new era of powerful innovations in HIV prevention and treatment,&rdquo; said Dr Tereza Kasaeva, Director of WHO&rsquo;s Department for HIV, TB, Hepatitis and STIs. &ldquo;By pairing these advances with decisive action, supporting communities, and removing structural barriers, we can ensure that key and vulnerable populations have full access to life-saving services.&rdquo;\n\nWHO prequalified LEN for HIV prevention on 6 October 2025, followed by national regulatory approvals that will increase access in South Africa (on 27 October), Zimbabwe (27 November) and Zambia (4 November). WHO&rsquo;s Collaborative Registration Procedure (CRP) supported these approvals. WHO is also working closely with partners such as CIFF, the Gates Foundation, the Global Fund to Fight AIDS, Tuberculosis and Malaria and Unitaid to enable affordable access to LEN in countries. Ensuring that long-acting HIV medicines for prevention and treatment reach priority populations must be a global priority.\n\nIntegrating HIV services into primary health care\n\nWHO emphasizes that ending the AIDS epidemic depends on a fully integrated, evidence-based and rights-driven approach under the umbrella of primary health care. WHO will continue working with partners and leaders to put those most affected at the centre of the HIV response. Despite funding setbacks, the resilience and leadership of communities offer a clear path forward. By strengthening health systems, increasing domestic investment, and protecting human rights, countries can safeguard gains and ensure no one is left behind.\n\n&nbsp;",
  "contentSource": "content"
}
