{
  "id": "6c52c9e96ea9c8e9b23d4f752c943433ceaf1f50",
  "title": "Anker’s beefy Laptop Power Bank has returned to its Black Friday low",
  "summary": "As you might expect, things have been relatively quiet on the deals front since Black Friday, particularly when it comes to discounts on charging accessories. Thankfully, Anker’s aptly titled Laptop Power Bank is once again on sale at Amazon and Walmart for $87.99 ($47 off), which matches the record-low price we last saw at the end of November. Anker Laptop…",
  "canonicalUrl": "https://www.theverge.com/gadgets/849637/anker-laptop-power-bank-xbox-series-x-deal-sale",
  "source": {
    "id": "theverge",
    "name": "The Verge",
    "url": "https://www.theverge.com/",
    "feedUrl": "https://www.theverge.com/rss/index.xml",
    "country": "US",
    "language": "en"
  },
  "publishedAt": "2025-12-24T18:00:00.000Z",
  "fetchedAt": "2025-12-25T01:31:24.966Z",
  "category": "tech",
  "tags": [],
  "image": "https://platform.theverge.com/wp-content/uploads/sites/2/2025/12/Anker-Laptop-Power-Bank-Deal-Image.png?quality=90&#038;strip=all&#038;crop=0,0,100,100",
  "language": "en",
  "storagePath": "data/articles/tech/2025/12/24/6c52c9e96ea9c8e9b23d4f752c943433ceaf1f50.json",
  "contentText": "As you might expect, things have been relatively quiet on the deals front since Black Friday, particularly when it comes to discounts on charging accessories. Thankfully, Anker’s aptly titled Laptop Power Bank is once again on sale at Amazon and Walmart for $87.99 ($47 off), which matches the record-low price we last saw at the end of November.\n\nAnker Laptop Power Bank\n\nWhere to Buy:\n\n- $119.99 $87.99 at Amazon\n\n- $119.99 $89.99 at Best Buy\n\n- $119.99 $87.99 at Walmart\n\nUnless you’ve been living under a proverbial rock for the past several years, you’re probably aware that Anker makes an ungodly amount of charging accessories . The portable A1695 “InstaCord” has quickly become a favorite among Verge staffers , however, owing to the fact that it comes with a retractable USB-C cable and a second that doubles as a handle, both of which are bidirectional and allow for passthrough charging. The 25,000mAh / 90Wh power bank&nbsp;also sports a USB-A port and an additional USB-C port,&nbsp;allowing you to charge your phone, a MacBook Pro, and up to two other devices simultaneously.\n\nIn terms of output distribution, Anker’s 600-gram Laptop Power Bank can deliver up to 165W when two devices are plugged in, or up to 130W when charging three or four gadgets. It’s carry-on compliant, too, meaning you shouldn’t have any trouble getting it through TSA while traveling, which isn’t the case if your charger is above the agency’s 100 watt-hours threshold for carry-on devices. It even features a built-in LCD display, allowing you to quickly view the remaining charge, overall power output, battery temperature, and other info at a glance.\n\nMore ways to save today\n\n- The Bose SoundLink Home has fallen to around $179 ($50 off) at Amazon , Best Buy , and Target , which is about $15 more than its all-time low. It’s a bit more limited than other speakers you might get at this price — there’s no water or dust resistance, for example, and the battery tops out at 9 hours — but it still offers great sound for its size, supports USB-C audio in, and features a handsome, mid-modern look that few speakers can match. Read our review .\n\n- If you own an older TV that lacks built-in support for streaming apps, Roku’s Streaming Stick 4K is on sale at Amazon , Best Buy , and Target for $24.99 ($25 off), a mere $1 shy of its best price to date. The small HDMI stick supports 4K resolution and all your major 4K HDR formats, not to mention Roku’s TV interface, which remains the gold standard in terms of simplicity. It also draws power directly from your TV, allowing you to skip the cable.\n\n- Microsoft jacked up the price of the Xbox Series X in mid-September; however, Amazon , Best Buy , and Walmart are now selling the company’s latest gaming console for $599.99 ($50 off). It’s certainly not the cheapest we’ve seen it go for — hell, it once dropped to $340 at Best Buy — but it’s likely the best price we’re going to see until the ongoing tariff situation in the US is resolved and prices begin to come back down. Read our review .",
  "contentSource": "content"
}
