{
  "id": "e74b6a3816fd8d28b8db8f162e387540ac56d2eb",
  "title": "Being Santa Claus is a year-round calling",
  "summary": "\"You're Santa Claus 24 hours a day, seven days a week, 52 weeks a year.\" Acting out may shatter \"the magic.\"",
  "canonicalUrl": "https://arstechnica.com/science/2025/12/being-santa-claus-is-a-year-round-calling",
  "source": {
    "id": "arstechnica",
    "name": "Ars Technica",
    "url": "https://arstechnica.com/",
    "feedUrl": "https://feeds.arstechnica.com/arstechnica/index",
    "country": "US",
    "language": "en"
  },
  "publishedAt": "2025-12-24T16:23:35.000Z",
  "fetchedAt": "2025-12-25T01:31:24.917Z",
  "category": "tech",
  "tags": [
    "Science",
    "psychology",
    "santa claus"
  ],
  "image": "https://cdn.arstechnica.net/wp-content/uploads/2024/12/santa_claus_secret_header-1152x648.jpg",
  "language": "en",
  "storagePath": "data/articles/tech/2025/12/24/e74b6a3816fd8d28b8db8f162e387540ac56d2eb.json",
  "contentText": "Tis the season when professional Santas are in peak demand, but many who choose this line of work often view it as a higher calling and maintain some aspects of the identity all year round—even those who don't fit the stereotypical popular image of Santa, according to a paper published in the Academy of Management Journal.\n\nCo-author Christina Hymer of the University of Tennessee got the idea for the study during the COVID pandemic, when she spent a lot of time watching Christmas movies with her toddler. One favorite was 2003's Elf , starring Will Farrell as a full-sized human raised among elves who goes to New York City to find his biological father. The film prompted her to wonder about why someone would want to be Santa Claus and what their experiences in that role would be.\n\nHymer and her co-authors partnered with the leader of a \"Santa school\" to analyze archival surveys of 849 professional Santas, and conducted a new survey of another 382 Santas. They also did over 50 personal interviews with professional Santas. (One subject showed up in full costume for his zoom interview, with a North Pole background, and signed off with a merry \"ho! ho! ho!\")\n\nRead full article\n\nComments",
  "contentSource": "content:encoded"
}
