{
  "id": "00166b9884c3c4ab85c77c53580230ab7c63c2b7",
  "title": "Odyssey trailer brings the myth to vivid life",
  "summary": "\"After years of war, no one could stand between my men and home. Not even me.\"",
  "canonicalUrl": "https://arstechnica.com/culture/2025/12/odyssey-trailer-brings-the-myth-to-vivid-life",
  "source": {
    "id": "arstechnica",
    "name": "Ars Technica",
    "url": "https://arstechnica.com/",
    "feedUrl": "https://feeds.arstechnica.com/arstechnica/index",
    "country": "US",
    "language": "en"
  },
  "publishedAt": "2025-12-22T17:43:42.000Z",
  "fetchedAt": "2025-12-24T00:05:19.483Z",
  "category": "tech",
  "tags": [
    "Culture",
    "Christopher Nolan",
    "entertainment",
    "film trailers",
    "The Odyssey",
    "Trailers",
    "Universal Pictures"
  ],
  "image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/odyssey2-1152x648-1766423641.jpg",
  "language": "en",
  "storagePath": "data/articles/tech/2025/12/22/00166b9884c3c4ab85c77c53580230ab7c63c2b7.json",
  "contentText": "Director Christopher Nolan won two well-deserved Oscars for 2023's Oppenheimer , and Hollywood was soon buzzing about what his next project might be. A vampire period piece, perhaps? Or maybe a reboot of 1983's Blue Thunder or British 1960s spy series The Prisoner ? Instead, Nolan chose to adapt one of the greatest epic sagas in history: Homer's Odyssey . At long last, Universal has released the first official trailer for Nolan's The Odyssey , starring Matt Damon as the wandering Ithacan king. Frankly, it looks appropriately epic.\n\nMost of us read some version of The Odyssey in high school, so we're familiar with the story: Odysseus, legendary Greek king of Ithaca, begins the long journey home after 10 years of fighting in the Trojan War. (We actually catch a glimpse of the famous Trojan horse in the trailer.) But the journey does not go smoothly, as Odysseus and his men encounter the cyclops Polyphemus, the Sirens, and an enchantress named Circe, among other obstacles. Meanwhile, his long-suffering wife Penelope is warding off hundreds of suitors eager to usurp Odysseus' position.\n\nIt's difficult to overestimate the tremendous influence Homer's epic has had on global culture. Nolan himself recalled seeing the Odyssey performed as a school play when he was just 5 or 6 years old. \"I remember the Sirens and him being strapped to the mast and things like that,\" he recently told Empire. \"I think it's in all of us, really. And when you start to break down the text and adapt it, you find that all of these other films—and all the films I've worked on—you know, they're all from the Odyssey . It's foundational.\"\n\nRead full article\n\nComments",
  "contentSource": "content:encoded"
}
