{
  "id": "08a6a9c7809ca33db0245c48b2b52bc29d2d24a0",
  "title": "Safety panel says NASA should have taken Starliner incident more seriously",
  "summary": "\"This particular anomaly deserves to be right up front and center for quite some time.\"",
  "canonicalUrl": "https://arstechnica.com/space/2025/12/safety-panel-says-nasa-should-have-taken-starliner-incident-more-seriously",
  "source": {
    "id": "arstechnica",
    "name": "Ars Technica",
    "url": "https://arstechnica.com/",
    "feedUrl": "https://feeds.arstechnica.com/arstechnica/index",
    "country": "US",
    "language": "en"
  },
  "publishedAt": "2025-12-22T21:11:11.000Z",
  "fetchedAt": "2025-12-24T00:05:19.483Z",
  "category": "tech",
  "tags": [
    "Space",
    "aerospace safety advisory panel",
    "Boeing",
    "commercial crew",
    "human spaceflight",
    "international space station",
    "NASA",
    "starliner",
    "starliner crew flight test"
  ],
  "image": "https://cdn.arstechnica.net/wp-content/uploads/2025/02/GettyImages-1234021697-1152x648.jpg",
  "language": "en",
  "storagePath": "data/articles/tech/2025/12/22/08a6a9c7809ca33db0245c48b2b52bc29d2d24a0.json",
  "contentText": "For the better part of two months last year, most of us had no idea how serious the problems were with Boeing's Starliner spacecraft docked at the International Space Station. A safety advisory panel found this uncertainty also filtered through NASA's workforce.\n\nOn its first Crew Test Flight, Boeing's Starliner delivered NASA astronauts Butch Wilmore and Suni Williams to the space station in June 2024. They were the first people to fly to space on a Starliner spacecraft after more than a decade of development and setbacks. The astronauts expected to stay at the ISS for one or two weeks, but ended up remaining in orbit for nine months after NASA officials determined it was too risky to return them to Earth in the Boeing-built crew capsule. Wilmore and Williams flew back to Earth last March on a SpaceX Dragon spacecraft.\n\nThe Starliner capsule was beset by problems with its maneuvering thrusters and pernicious helium leaks on its 27-hour trip from the launch pad to the ISS. For a short time, Starliner commander Wilmore lost his ability to control the movements of his spacecraft as it moved in for docking at the station in June 2024. Engineers determined that some of the thrusters were overheating and eventually recovered most of their function, allowing Starliner to dock with the ISS.\n\nRead full article\n\nComments",
  "contentSource": "content:encoded"
}
