{
  "id": "c56bf6d8627a6425b064429b98543f5cff5b39ff",
  "title": "In a surprise announcement, Tory Bruno is out as CEO of United Launch Alliance",
  "summary": "\"It has been a great privilege to lead ULA through its transformation and to bring Vulcan into service.\"",
  "canonicalUrl": "https://arstechnica.com/space/2025/12/in-a-surprise-announcement-tory-bruno-is-out-as-ceo-of-united-launch-alliance",
  "source": {
    "id": "arstechnica",
    "name": "Ars Technica",
    "url": "https://arstechnica.com/",
    "feedUrl": "https://feeds.arstechnica.com/arstechnica/index",
    "country": "US",
    "language": "en"
  },
  "publishedAt": "2025-12-22T23:51:44.000Z",
  "fetchedAt": "2025-12-24T00:05:19.483Z",
  "category": "tech",
  "tags": [
    "Science",
    "Space",
    "atlas v",
    "Boeing",
    "launch",
    "Lockheed Martin",
    "tory bruno",
    "united launch alliance",
    "vulcan"
  ],
  "image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/NHQ202405060021large-1152x648.jpg",
  "language": "en",
  "storagePath": "data/articles/tech/2025/12/22/c56bf6d8627a6425b064429b98543f5cff5b39ff.json",
  "contentText": "Tory Bruno, a veteran engineer and aerospace industry executive, has resigned from the top job at United Launch Alliance after more than a decade competing against the growing dominance of SpaceX, the company announced Monday.\n\nThe news of Bruno's sudden resignation was unexpected. His tenure was marked by a decline in ULA's market share as rival SpaceX competed for and won ever-larger US government launch contracts. More recently, Bruno oversaw the successful debut of ULA's Vulcan rocket , followed by struggles to ramp up the new rocket's launch cadence.\n\nBruno had a 30-year career as an engineer and general manager for Lockheed Martin's ballistic missile programs before taking over as president and CEO of United Launch Alliance in August 2014. He arrived as SpaceX started making inroads with its partially reusable Falcon 9 rocket, and ULA's leading position in the US launch market looked to be in doubt.\n\nRead full article\n\nComments",
  "contentSource": "content:encoded"
}
