{
  "id": "f0d382231b6e51e43e4d24a43d4abd7abd95efe3",
  "title": "NASA rewraps Boeing Starliner Astrovan II for Artemis II ride to launch pad",
  "summary": "Moon-bound astronauts rehearse their launch-day activities with a repurposed ride.",
  "canonicalUrl": "https://arstechnica.com/space/2025/12/nasa-rewraps-boeing-starliner-astrovan-ii-for-artemis-ii-ride-to-launch-pad",
  "source": {
    "id": "arstechnica",
    "name": "Ars Technica",
    "url": "https://arstechnica.com/",
    "feedUrl": "https://feeds.arstechnica.com/arstechnica/index",
    "country": "US",
    "language": "en"
  },
  "publishedAt": "2025-12-22T16:20:31.000Z",
  "fetchedAt": "2025-12-24T00:05:19.483Z",
  "category": "tech",
  "tags": [
    "Space",
    "Airstream",
    "artemis II",
    "artemis program",
    "Astrovan II",
    "Boeing",
    "Canoo",
    "CDDT",
    "countdown demonstration test",
    "crew transport vehicle",
    "CTV",
    "Kennedy Space Center",
    "NASA",
    "Space exploration",
    "space history",
    "starliner"
  ],
  "image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/news-122025a-lg-1152x648.jpg",
  "language": "en",
  "storagePath": "data/articles/tech/2025/12/22/f0d382231b6e51e43e4d24a43d4abd7abd95efe3.json",
  "contentText": "Artemis II, meet Astrovan II.\n\nNASA's first astronauts who will fly by the moon in more than 50 years participated in a practice launch countdown on Saturday, December 20, including taking their first trip on a transport vehicle steeped in almost the entire span of US space history—from Apollo through to the ongoing commercial crew program.\n\nArtemis II astronauts (from right to left) Reid Wiseman, Victor Glover, Christina Koch, and Jeremy Hansen pose for photographs before boarding the Astrovan II crew transport vehicle for a ride to their rocket during a rehearsal of their launch-day activities at NASA's Kennedy Space Center in Florida on Saturday, Dec. 20, 2025.\nCredit:\nNASA/Aubrey Gemignani\n\nArtemis II commander Reid Wiseman, pilot Victor Glover, and mission specialist Christina Koch (all with NASA) and mission specialist Jeremy Hansen, an astronaut with the Canadian Space Agency, began the rehearsal at the Kennedy Space Center in Florida, proceeding as they will when they are ready to fly next year (the Artemis II launch is slated for no earlier than the first week of February and no later than April 2026).\n\nRead full article\n\nComments",
  "contentSource": "content:encoded"
}
