{
  "id": "a6181a7eab6cd549d62c1def5ac9678166581de3",
  "title": "WHO validates Brazil for eliminating mother-to-child transmission of HIV",
  "summary": "The World Health Organization (WHO) has validated Brazil for the elimination of mother-to-child transmission (EMTCT) of HIV, making it the most populous country in the Americas to achieve this historic milestone. This accomplishment reflects Brazil’s long-standing commitment to universal and free access to health services through its Unified Health System (…",
  "canonicalUrl": "https://www.who.int/news/item/18-12-2025-who-validates-brazil-for-eliminating-mother-to-child-transmission-of-hiv",
  "source": {
    "id": "who_news",
    "name": "World Health Organization - News (EN)",
    "url": "https://www.who.int/news",
    "feedUrl": "https://www.who.int/rss-feeds/news-english.xml",
    "country": "UN",
    "language": "en"
  },
  "publishedAt": "2025-12-18T15:43:16.000Z",
  "fetchedAt": "2025-12-24T00:05:45.493Z",
  "category": "health",
  "tags": [],
  "image": null,
  "language": "en",
  "storagePath": "data/articles/health/2025/12/18/a6181a7eab6cd549d62c1def5ac9678166581de3.json",
  "contentText": "The World Health Organization (WHO) has validated Brazil for the elimination of mother-to-child transmission (EMTCT) of HIV, making it the most populous country in the Americas to achieve this historic milestone. This accomplishment reflects Brazil&rsquo;s long-standing commitment to universal and free access to health services through its Unified Health System (SUS), anchored in a strong primary health-care system and respect for human rights.\n\n&ldquo;Eliminating mother-to-child transmission of HIV is a major public health achievement for any country, especially for a country as large and complex as Brazil,&rdquo; said Dr Tedros Adhanom Ghebreyesus, WHO Director-General. &ldquo;Brazil has shown that with sustained political commitment and equitable access to quality health services, every country can ensure that every child is born free of HIV and every mother receives the care she deserves.&rdquo;\n\nThe milestone was marked during a ceremony in Bras&iacute;lia, attended by President Luiz In&aacute;cio Lula da Silva, Brazil&rsquo;s Minister of Health Alexandre Padilha, and the Director of the Pan American Health Organization (PAHO) Dr Jarbas Barbosa, along with representatives from UNAIDS.\n\nMeeting validation criteria\n\nBrazil met all the criteria for EMTCT validation, including reducing vertical transmission of HIV to below 2% and achieving over 95% coverage for prenatal care, routine HIV testing, and timely treatment for pregnant women living with HIV. In addition to meeting the targets of the validation, Brazil demonstrated the delivery of quality services for mothers and their infants, robust data and laboratory systems, and a strong commitment to human rights, gender equality and community engagement.\n\nThe country implemented a progressive, subnational approach by first certifying states and municipalities with over 100 000 inhabitants, adapting the PAHO/WHO validation methodology to its national context while maintaining coherence across the country.\n\nThe evaluation, supported by PAHO, was conducted by independent experts who reviewed data, documentation, and health facility operations. Findings were then assessed by WHO&rsquo;s Global Validation Advisory Committee, which formally recommended Brazil&rsquo;s validation for elimination.\n\n&ldquo;This achievement shows that eliminating vertical transmission of HIV is possible when pregnant women know their HIV status, receive timely treatment, and have access to maternal health services and safe delivery,&rdquo; said Dr Jarbas Barbosa, Director of PAHO. &ldquo;It is also the result of the tireless dedication of thousands of health professionals, community health workers, and civil society organizations. Every day, they sustain the continuity of care, identify obstacles, and work to overcome them, ensuring that even the most vulnerable populations can access essential health services.\"\n\nPart of a broader initiative\n\nOver the past decade (2015-2024), more than 50 000 pediatric HIV infections have been averted in the Region of the Americas as a result of the implementation of the initiative to eliminate mother-to-child transmission of HIV.\n\nBrazil&rsquo;s success is part of the broader EMTCT Plus Initiative, which seeks to eliminate mother-to-child transmission of HIV, syphilis, hepatitis B, and congenital Chagas, in collaboration with UNICEF and UNAIDS. It is embedded within PAHO&rsquo;s Elimination Initiative , a regional effort to eliminate more than 30 communicable diseases and related conditions in the Americas by 2030.\n\n\"I am delighted that Brazil has just been certified by WHO/PAHO for eliminating vertical transmission &ndash; the first country of more than 100 million people to do so,&rdquo; said Winnie Byanyima, UNAIDS Executive Director. &ldquo;And they did it by doing what we know works &ndash;prioritizing universal health care, tackling the social determinants that drive the epidemic, protecting human rights, and even &ndash; when necessary &ndash; breaking monopolies to secure access to medicines.\"\n\nGlobal context\n\nBrazil is one of 19 countries and territories worldwide that have been validated by WHO for EMTCT. Twelve of these are in the Region of the Americas. In 2015, Cuba became the first country in the world to be validated for EMTCT of HIV and the elimination of congenital syphilis. Other countries in the Region include Anguilla, Antigua and Barbuda, Bermuda, Cayman Islands, Montserrat, and Saint Kitts and Nevis in 2017; Dominica in 2020; Belize in 2023; and Jamaica and Saint Vincent and the Grenadines in 2024.\n\nOutside the Americas, countries validated for EMTCT of HIV include Armenia, Belarus, Malaysia, Maldives, Oman, Sri Lanka, and Thailand.\n\n&nbsp;",
  "contentSource": "content"
}
