{
  "id": "510283cebb9ddf780a601128d440b1a9ed39e552",
  "title": "Most countries make progress towards universal health coverage, but major challenges remain, WHO–World Bank report finds",
  "summary": "Since 2000, most countries – across all income levels and regions – have made concurrent progress in expanding health service coverage and reducing the financial hardship associated with health costs, according to a new joint report from the World Health Organization (WHO) and the World Bank Group. These two indicators are the foundation of universal health…",
  "canonicalUrl": "https://www.who.int/news/item/06-12-2025-most-countries-make-progress-towards-universal-health-coverage-but-major-challenges-remain-who-world-bank-report-finds",
  "source": {
    "id": "who_news",
    "name": "World Health Organization - News (EN)",
    "url": "https://www.who.int/news",
    "feedUrl": "https://www.who.int/rss-feeds/news-english.xml",
    "country": "UN",
    "language": "en"
  },
  "publishedAt": "2025-12-06T01:45:23.000Z",
  "fetchedAt": "2025-12-24T00:05:45.493Z",
  "category": "health",
  "tags": [],
  "image": null,
  "language": "en",
  "storagePath": "data/articles/health/2025/12/06/510283cebb9ddf780a601128d440b1a9ed39e552.json",
  "contentText": "Since 2000, most countries &ndash; across all income levels and regions &ndash; have made concurrent progress in expanding health service coverage and reducing the financial hardship associated with health costs, according to a new joint report from the World Health Organization (WHO) and the World Bank Group. These two indicators are the foundation of universal health coverage (UHC) &ndash; the global commitment that everyone, everywhere can access the care they need without financial hardship by 2030.\n\nThe UHC Global Monitoring Report 2025 shows that health service coverage, measured by the Service Coverage Index (SCI), rose from 54 to 71 points between 2000 and 2023. Meanwhile, the share of people experiencing financial hardship due to large and impoverishing out-of-pocket (OOP) health payments declined from 34% to 26% between 2000 and 2022.\n\nHowever, the report cautions that the poorest populations continue to bear the greatest burden of unaffordable health costs, with 1.6&nbsp;billion people further pushed into poverty. Overall, an estimated 4.6&nbsp;billion people worldwide still lack access to essential health services and 2.1&nbsp;billion people experience financial hardship to access health care, including the 1.6&nbsp;billion people living in poverty or pushed deeper into it due to health expenses.\n\n\"Universal health coverage is the ultimate expression of the right to health, but this report shows that for billions of people who cannot access or afford the health services they need, that right remains out of reach,&rdquo; said Dr Tedros Adhanom Ghebreyesus, WHO Director-General. &ldquo;In the context of severe cuts to international aid, now is the time for countries to invest in their health systems, to protect the health of their people and economies. WHO is supporting them to do that.&rdquo;\n\nFinancial hardship in health is defined as household spending more than 40% of its discretionary budget on OOP health expenses. Cost of medicines is a major driver of financial hardship: in three-quarters of countries with available data, medicines account for at least 55% of people&rsquo;s OOP health expenses. The burden is even greater among people living in poverty who allocate a median of 60% of their OOP health expenses on medicines diverting their scarce resources from other essential needs.\n\nWhile the burden of OOP health costs falls mostly on poorer people, it also affects better-off segments of the population that allocate a large share of their budgets to health expenses, particularly in middle-income countries where this group of people is growing.\n\nWithout faster progress, full-service coverage without financial hardship will remain out of reach for many: the global SCI is projected to reach only 74 out of 100 by 2030, with nearly 1 in 4 people worldwide still facing financial hardship at the end of the Sustainable Development Goals (SDG) era.\n\nEncouraging progress in low-income countries with largest gaps\n\nDespite positive direction, the global progress rate has slowed since 2015 with only one-third of countries improving in both increasing health coverage and reducing financial hardship. All WHO regions have improved service coverage, but only half &ndash; Africa, South-East Asia, the Western Pacific &ndash; also reduced financial hardship. Low-income countries achieved the fastest gains in both areas but are still facing the largest gaps.\n\nThe global increase in health service coverage has been driven largely by advances in infectious disease programmes. Coverage for noncommunicable diseases (NCDs) has shown steady improvement, while gains in reproductive, maternal, newborn, and child health have been modest.\n\nThe report notes that improved sanitation has supported service coverage gains. At the same time, inclusive economic growth, rising incomes, and stronger social protection mechanisms have driven poverty reduction, especially in low-income countries, contributing to declines in financial hardship. However, health costs have increasingly become a source of financial hardship among the poor.\n\nInequalities are getting starker\n\nDespite progress, persistent gaps and inequalities are on the rise. In 2022, 3 out of 4 people among the poorest segment of the populations faced financial hardship from health costs, compared with fewer than 1 in 25 among the richest.\n\nWomen, people living in poverty, or in rural areas, or with less education, reported greater difficulty accessing essential health services. The gap between women in the richest and poorest quintiles narrowed slightly, from about 38 to 33 percentage points over the past decade. Even in high-performing regions such as Europe, vulnerable groups &ndash; including the poorest and people with disabilities &ndash; continue to report higher unmet health needs.\n\nThese findings likely underestimate the true extent of health inequalities, as the most vulnerable groups &ndash; such as displaced populations and people living in informal settlements &ndash; are often missing in data sources used to monitor progress toward UHC.\n\nActions leading to 2030\n\nAchieving the UHC goal by 2030 is central to realizing the human right to health. With five years remaining on the SDG agenda, urgent action is now needed to drive progress. The report underscores the critical role of political commitment in every country and community, and calls for action in six core areas:\n\n- ensure essential health care is free at the point of care for people living in poverty and vulnerable situations;\n\n- expand public investments in health systems;\n\n- address high out-of-pocket spending on medicines;\n\n- accelerate access to essential NCD services, especially as the disease burden rises;\n\n- strengthen primary health care to promote equity and efficiency; and\n\n- adopt multisectoral approaches, recognizing that determinants of health and UHC drivers extend beyond the health sector.\n\n&nbsp;\n\nEditor&rsquo;s note\n\nThis edition of the UHC Global Monitoring Report 2025 reflects the first round of UHC tracking to incorporate revised SDG indicators for health service coverage (SDG 3.8.1) and financial hardship (SDG 3.8.2), introduced in 2025. Using the revised indicators, and reproduction of the full time series, the report has presented global and regional trends in service coverage from 2000 to 2023, based on time series data for 195 countries or territories, and global and regional trends in financial hardship from 2000 to 2022, based on primary country time series for 168 countries. More about&nbsp; monitoring universal health coverage .\n\nThe Report is presented at the UHC High-Level Forum, jointly hosted by the Government of Japan, the World Bank Group, and WHO, in Tokyo, Japan. The Forum will also mark the official launch of the UHC Knowledge Hub in Tokyo, established by WHO and the World Bank Group with the support of the Government of Japan. The Hub offers capacity strengthening programmes for Ministries of Health and Finance to support health financing reforms. More about the Universal Health Coverage (UHC) High-level Forum 2025 .\n\nWHO, the World Bank Group, UHC2030 and the Joint Learning Network for Universal Health Coverage will organize a technical webinar &ldquo;Tracking Universal Health Coverage: 2025 Global Monitoring Report&rdquo; on 8 December 2025, at 8:00&ndash;9:30am EST | 14:00&ndash;15:30 CET. You can join the webinar through this link . (Passcode: .W1MJT=@r3)\n\n&nbsp;",
  "contentSource": "content"
}
