{
  "id": "d01c3f3b6659abe57273fe096b800dd8e85adc0f",
  "title": "Lifetime toll: 840 million women faced partner or sexual violence",
  "summary": "Violence against women remains one of the world’s most persistent and under-addressed human rights crises, with very little progress in two decades, according to a landmark report released today by the World Health Organization (WHO) and UN partners. Nearly 1 in 3 women – estimated 840 million globally – have experienced partner or sexual violence during th…",
  "canonicalUrl": "https://www.who.int/news/item/19-11-2025-lifetime-toll--840-million-women-faced-partner-or-sexual-violence",
  "source": {
    "id": "who_news",
    "name": "World Health Organization - News (EN)",
    "url": "https://www.who.int/news",
    "feedUrl": "https://www.who.int/rss-feeds/news-english.xml",
    "country": "UN",
    "language": "en"
  },
  "publishedAt": "2025-11-19T11:34:26.000Z",
  "fetchedAt": "2025-12-24T00:05:45.493Z",
  "category": "health",
  "tags": [],
  "image": null,
  "language": "en",
  "storagePath": "data/articles/health/2025/11/19/d01c3f3b6659abe57273fe096b800dd8e85adc0f.json",
  "contentText": "Violence against women remains one of the world&rsquo;s most persistent and under-addressed human rights crises, with very little progress in two decades, according to a landmark report released today by the World Health Organization (WHO) and UN partners.\n\nNearly 1 in 3 women &ndash; estimated 840 million globally &ndash; have experienced partner or sexual violence during their lifetime, a figure that has barely changed since 2000. In the last 12 months alone, 316 million women &ndash; 11% of those aged 15 or older &ndash; were subjected to physical or sexual violence by an intimate partner. Progress on reducing intimate partner violence has been painfully slow with only 0.2% annual decline over the past two decades.\n\nFor the first time, the report includes national and regional estimates of sexual violence by someone other than a partner. It finds 263 million women have experienced non-partner sexual violence since age 15, a figure experts caution is significantly under-reported due to stigma and fear.\n\n\"Violence against women is one of humanity&rsquo;s oldest and most pervasive injustices, yet still one of the least acted upon,\" said Dr Tedros Adhanom Ghebreyesus, WHO Director-General. \"No society can call itself fair, safe or healthy while half its population lives in fear. Ending this violence is not only a matter of policy; it is a matter of dignity, equality and human rights. Behind every statistic is a woman or girl whose life has been forever altered. &nbsp;Empowering women and girls is not optional, it's a prerequisite for peace, development and health. A safer world for women is a better world for everyone.\"\n\nEfforts face funding cuts amidst mounting needs\n\nThe new report, released ahead of the International day for the elimination of violence against women and girls observed on 25 November, represents the most comprehensive study on the prevalence of these two forms of violence against women. It updates 2018 estimates released in 2021. It analyses data between 2000 and 2023 from 168 countries, revealing a stark picture of a deeply neglected crisis and critically underfunded response.\n\nDespite mounting evidence on effective strategies to prevent violence against women, the report warns that funding for such initiatives is collapsing &ndash; just as when humanitarian emergencies, technological shifts, and rising socio-economic inequality are further increasing risks for millions of women and girls. For instance, in 2022, only 0.2% of the global development aid was allocated to programmes focused on prevention of violence against women, and funding has further fallen in 2025.\n\nWidespread and lifelong risks\n\nWomen subjected to violence face unintended pregnancies, a higher risk of acquiring sexually transmitted infections and experiencing depression. Sexual and reproductive health services are an important entry point for survivors to receive the high-quality care they need.\n\nThe report underscores the reality that violence against women begins early and risks persist throughout life. For example, in the past 12 months alone, 12.5 million adolescent girls 15-19 years of age or 16% have experienced physical and/or sexual violence from an intimate partner.\n\nWhile violence occurs in every country, women in least-developed, conflict-affected, and climate-vulnerable settings are disproportionately affected. For example, Oceania (excluding Australia and New Zealand) reports 38% prevalence of intimate partner violence in the past year &ndash; more than 3 times the global average of 11%.\n\nA call for action &ndash; and accountability\n\nMore countries than ever are now collecting data to inform policies, yet significant gaps remain &ndash; particularly on non-partner sexual violence, marginalized groups such as indigenous women, migrants, and women with disabilities, as well as data from fragile and humanitarian settings.&nbsp;\n\nProgress has been achieved in countries where there is political commitment to do so. For example, Cambodia is implementing a national project that will update legislation on domestic violence, improve service delivery, quality and access, refurbish shelters and leverage digital solutions in schools and communities to promote prevention especially with adolescents.\n\nEcuador, Liberia, Trinidad and Tobago and Uganda have developed costed national action plans. Legislative and advocacy actions in these countries have contributed to some domestic financing for this issue, signalling increased political commitment at a time of decreasing aid budgets.&nbsp;\n\nTo accelerate global progress and deliver meaningful change for the lives of affected women and girls, the report calls for decisive government action and funding to:\n\n- scale up evidence-based prevention programmes\n\n- strengthen survivor-centred health, legal and social services\n\n- invest in data systems to track progress and reach the most at-risk groups\n\n- enforce laws and policies empowering women and girls.\n\nThe report is accompanied by the launch of the second edition of the RESPECT Women: preventing violence against women framework , offering updated guidance for violence prevention, including for humanitarian contexts.\n\nThere can be no more silence or inaction. We need leaders to commit and act towards ending violence against women and girls now.\n\nQuotes from partners\n\n\"Ending violence against women and girls requires courage, commitment, and collective action. Advancing gender equality&nbsp;is how we build a more equal, safer world for everyone, where every woman and every girl can live a life free from violence.&rdquo; Dr&nbsp;Sima&nbsp;Bahous, Executive Director, UN Women\n\n\"Violence against women inflicts deep and lasting harm that affects their lives, health and dignity. For many, violence is compounded by discrimination based on poverty, disability and other factors, exposing them to even higher risk. The devastating cycle of abuse often ripples through families and communities and across generations. The data paint a grim picture of the toll of inaction. This must change now. We must act urgently together to end this violence and ensure that every woman and girl, in all her diversity, can exercise her rights, realize her potential and contribute fully to more just, equal and prosperous societies.&rdquo; Diene Keita, Executive Director, UNFPA\n\n&ldquo;The data shows that many women first experience violence from a partner when they are adolescents. And many children grow up watching their mothers being pushed, hit or humiliated, with violence a part of daily life. The key is to break this pattern of violence against women and girls.&rdquo; UNICEF Executive Director Catherine Russell\n\n&nbsp;\n\nNotes to the editors\n\nAbout the report\n\nThe report, Global, regional and national prevalence estimates for intimate partner violence against women and non-partner sexual violence against women, 2023 was developed by WHO and the UNDP-UNFPA-UNICEF-WHO-World Bank Special Programme of Research, Development and Research Training in Human Reproduction (HRP) on behalf of, and with the United Nations Inter-Agency Working Group on Violence Against Women Estimation and Data. The Working Group includes representatives from WHO, UN Women, UNICEF, UNFPA, the United Nations Office on Drugs and Crime (UNODC) and the United Nations Statistics Division (UNSD).\n\nModelling is used to enhance comparability of estimates across countries and regions to the extent allowed by existing data. All surveys likely underestimate the actual prevalence of violence against women as there will always be women who do not disclose these experiences, especially where this violence is highly stigmatized. Sexual violence is particularly underreported in many settings. Poorly designed or implemented surveys in some places further exacerbate this underestimation.\n\nAbout regional and country estimates\n\nThe report and database present regional data in the following categories: Sustainable Development Goal (SDG) regions,…",
  "contentSource": "content"
}
