{
  "id": "f4cd81cc209e9fd251a9b9821cf517318010b253",
  "title": "More countries report rising levels of drug-resistant gonorrhoea, warns WHO",
  "summary": "The World Health Organization (WHO) warns that gonorrhoea, a sexually transmitted infection, is becoming increasingly resistant to antibiotics, according to new data from its Enhanced Gonococcal Antimicrobial Surveillance Programme (EGASP), which monitors the spread of drug-resistant gonorrhoea. The report highlights the need to strengthen surveillance, imp…",
  "canonicalUrl": "https://www.who.int/news/item/19-11-2025-more-countries-report-rising-levels-of-drug-resistant-gonorrhoea--warns-who",
  "source": {
    "id": "who_news",
    "name": "World Health Organization - News (EN)",
    "url": "https://www.who.int/news",
    "feedUrl": "https://www.who.int/rss-feeds/news-english.xml",
    "country": "UN",
    "language": "en"
  },
  "publishedAt": "2025-11-19T10:01:44.000Z",
  "fetchedAt": "2025-12-24T00:05:45.493Z",
  "category": "health",
  "tags": [],
  "image": null,
  "language": "en",
  "storagePath": "data/articles/health/2025/11/19/f4cd81cc209e9fd251a9b9821cf517318010b253.json",
  "contentText": "The World Health Organization (WHO) warns that gonorrhoea, a sexually transmitted infection, is becoming increasingly resistant to antibiotics, according to new data from its Enhanced Gonococcal Antimicrobial Surveillance Programme (EGASP) , which monitors the spread of drug-resistant gonorrhoea.&nbsp;\n\nThe report highlights the need to strengthen surveillance, improve diagnostic capacity and ensure equitable access to new treatments for sexually transmitted infections (STIs). The release of the new data coincides with World Antimicrobial Resistance (AMR) Awareness Week , reinforcing the importance of global action against drug-resistant infections. EGASP, launched by WHO in 2015, collects laboratory and clinical data from sentinel sites around the world to track AMR and inform treatment guidelines.\n\n&ldquo;This global effort is essential to tracking, preventing, and responding to drug-resistant gonorrhoea and to protecting public health worldwide,&rdquo; said Dr Tereza Kasaeva, Director of the WHO Department for HIV, TB, Hepatitis & STIs. &ldquo;WHO calls on all countries to address the rising levels of sexually transmitted infections (STIs) and integrate gonorrhoea surveillance into national STI programmes.&rdquo;&nbsp;\n\nBetween 2022 and 2024, resistance to ceftriaxone and cefixime, the primary antibiotics used to treat gonorrhoea, rose sharply from 0.8% to 5% and from 1.7% to 11% respectively, with resistant strains detected in more countries. Resistance to azithromycin remained stable at 4%, while resistance to ciprofloxacin reached 95%. Cambodia and Viet Nam reported the highest resistance rates.\n\nIn 2024, 12 EGASP countries in five WHO regions provided data, an increase from just four countries in 2022. This is a positive development reflecting growing commitment to track and contain drug-resistant infections in countries and regions. The countries- Brazil, Cambodia, India, Indonesia, Malawi, the Philippines, Qatar, South Africa, Sweden, Thailand, Uganda and Viet&nbsp;Nam reported 3615 cases of gonorrhoea.\n\nOver half of all cases of symptomatic gonorrhoea in men (52%) were reported from countries in the WHO Western Pacific Region, including the Philippines (28%), Viet Nam (12%), Cambodia (9%) and Indonesia (3%). Countries of the WHO African Region accounted for 28% of cases, followed by countries in the South-East Asia Region (13%, Thailand), the Eastern Mediterranean Region (4%, Qatar) and the Region of the Americas (2%, Brazil).\n\nThe median patient age was 27 years (range: 12&ndash;94). Among cases, 20% were men who have sex with men, and 42% reported multiple sexual partners within the past 30 days. Eight percent reported recent antibiotic use, and 19% had travelled recently. &nbsp;\n\nStrengthening and expanding global surveillance\n\nIn 2024, WHO advanced genomic surveillance, with nearly 3000 samples sequenced from eight countries. Landmark studies on new treatments such as zoliflodacin and gepotidacin, as well as studies on tetracycline resistance, were conducted by WHO&rsquo;s Collaborating Centre on AMR in STI in Sweden, in coordination with WHO. These are helping guide future gonorrhoea control and doxycycline-based prevention (DoxyPEP) strategies.&nbsp;\n\nEGASP continued to expand its reach in 2024, with Brazil, C&ocirc;te d&rsquo;Ivoire and Qatar joining the programme, and India beginning implementation and data reporting starting in 2025 under its National AIDS and Sexually Transmitted Diseases Control Programme.\n\nDespite notable progress, EGASP faces challenges, including limited funding, incomplete reporting, and gaps in data from women and extragenital sites. WHO calls for urgent investment, particularly in national surveillance systems, to sustain and expand global gonococcal AMR surveillance.\n\n&nbsp;",
  "contentSource": "content"
}
