{
  "id": "2bd58761f90ea202ca440a41ba68e6145811da34",
  "title": "NBA On Christmas: How to Watch Every Basketball Game Online for Free",
  "summary": "The NBA holiday games tip off at 12 p.m. ET with the Cleveland Cavaliers vs. New York Knicks.",
  "canonicalUrl": "https://www.billboard.com/culture/product-recommendations/how-to-watch-nba-christmas-games-2025-online-1236145171",
  "source": {
    "id": "billboard",
    "name": "Billboard",
    "url": "https://www.billboard.com/",
    "feedUrl": "https://www.billboard.com/feed/",
    "country": "US",
    "language": "en"
  },
  "publishedAt": "2025-12-25T13:00:00.000Z",
  "fetchedAt": "2025-12-25T16:24:41.478Z",
  "category": "entertainment",
  "tags": [
    "Culture",
    "Product Recommendations",
    "christmas",
    "nba",
    "NOADS",
    "sports",
    "streaming"
  ],
  "image": null,
  "language": "en",
  "storagePath": "data/articles/entertainment/2025/12/25/2bd58761f90ea202ca440a41ba68e6145811da34.json",
  "contentText": "All products and services featured are independently chosen by editors. However, Billboard may receive a commission on orders placed through its retail links, and the retailer may receive certain auditable data for accounting purposes.\n\nFor Sports fans, Christmas has become a wonderful time of the year. Not only do we get NFL games now on the holiday, but we also get the most exicting basketball games of the 2025-26 NBA season . Every year, Dec. 25 has become a tentpole mid-season event for the league turning the merry holiday into a playoff-like atmosphere.\n\nThis Christmas, the game lineup is stacked with marquee matchups with the league&#8217;s best superstars playing against divisional rivals and top-seed playoff contenders. From Klay Thompson heading back to the Bay to face Steph Curry and his old Golden State Warriors team, to LeBron James going head-to-head with Kevin Durant, to the New York Knicks going to battle with the Cleveland Cavaliers to see who are the top dogs of the Eastern Conference, there&#8217;s so many great storylines you don&#8217;t want to miss out on.\n\nWhether you&#8217;re home, visiting family or making snow angels outside, we&#8217;ve compiled every way you can tune into the 2025 NBA Christmas Day games online and for free.\n\nGame 1: Cleveland Cavaliers vs. New York Knicks (12 p.m.)\n\nThe Christmas Day lineup starts off with a bang featuring one of the most anticipated matchups between the recently NBA Cup-winning New York Knicks and their biggest Eastern Conference threat, the Cleveland Cavaliers. With a surging Knicks squad playing host to a young and hungry Cavs team trying to live up to expectations, this game is a must-see after opening Christmas gifts.\n\nThe Knicks vs. Cavs game kicks off at 12 p.m. ET on ESPN/ABC. Watch for free with DirecTV and FuboTV .\n\nWatch knicks vs. cavs on directv\n\nGame 2: San Antonio Spurs vs. Oklahoma City Thunder (2:30 p.m.)\n\nAnother exciting, marquee matchup takes place at 2:30 p.m ET between western conference heavyweights, the San Antonio Spurs and the Oklahoma City Thunder. After ending OKC&#8217;s dominating win streak and heading to the NBA Cup Finals, the Spurs have the momentum heading into Christmas. However, the defending NBA Champs, led by Shai Gilgeous-Alexander, have proven to be the top dogs of the league this year. Whoever wins will set the tempo going into the second half of the season.\n\nThe Knicks vs. Cavs game kicks off at 2:30 p.m. ET on ESPN/ABC. Watch for free with DirecTV and FuboTV .\n\nWatch Spurs vs. Thunder on directv\n\nGame 3: Dallas Mavericks vs. Golden State Warriors (5 p.m.)\n\nKlay Thompson is heading home to take on Steph Curry and his former Warriors squad for the third game of the day. Joining Kay is rookie Cooper Flag and Anthony Davis, but taking down Golden State with Curry, Draymond Green and Jimmy Butler is no easy task.\n\nThe Mavs vs. Warriors game takes place at 5 p.m. ET on ESPN/ABC. Watch for free with DirecTV and FuboTV .\n\nWatch Mavs vs. Warriors on directv\n\nGame 4: Houston Rockets vs. Los Angeles Lakers (8 p.m.)\n\nLeBron and Durant may be the OGs in the league now, but both are still the most exciting acts on the court. Add in Luka Doncic for the Lakers and Amen Thompson alongside Alperen Şengünm for the Rockets, these two icons facing-off is a must-see during Christmas.\n\nThe Houston Rockets vs. Los Angeles Lakers game starts at 8 p.m. on ESPN/ABC. Watch for free with DirecTV and FuboTV .\n\nWatch Rockets vs. Lakers on directv\n\nGame 5: Minnesota Timberwolves vs. Denver Nuggets (10:30 p.m.)\n\nFor the final game of the night, the NBA will give fans a rematch of a tremendous playoff series from two years ago between the Minnesota Timberwolves and Denver Nuggets. Tipping off in Colorado, MVP front runner, Nikola Jokic, will aim to get his revenge on Anthony Edwards.\n\nThe Timberwolves vs. Nuggets starts at 8 p.m. on ESPN/ABC. Watch for free with DirecTV and FuboTV .\n\nWatch Timberwolves vs. Nuggets on directv\n\nHow to Watch the 2025 NBA Christmas Day Games Without Cable\n\nThe 2025 NBA Christmas Day Games will air across ABC and ESPN while streaming on DirecTV , FuboTV , Hulu + Live TV and Sling TV. Don&#8217;t have cable? Here&#8217;s everything you need to know on how to stream NBA games online for free.\n\nDirecTV\n\nYou can watch ESPN and ABC online for free on DirecTV , which is offering a 5-day free trial for new users who sign up for one of the four packages. DirecTV lets you watch live television online and its channel packages include a live feed of ESPN and ABC.\n\nBesides access to hundreds of live TV channels, you&#8217;ll also receive unlimited DVR storage, local channels and the ability to stream on as many devices as you want.\n\nget directv free trial here\n\nFubo TV\n\nFuboTV is another affordable live TV streamer as it comes with a five-day free trial for new users who sign up. The streaming service has three different plans, including a new skinny bundle called &#8220;Sports + News&#8221; that starts at only $45.99 for the first month ($55.99 per month afterwards). In addition, Fubo has $30 off their Pro and Elite plans for the first month right now, which includes more than 300 channels, as well as 1,000 hours of free DVR and the option to stream on 10 devices at once.\n\nget fubo free trial here\n\nSling TV\n\nSling TV is offering new half off off their first month with any of its three packages. You can choose from: the Orange , Blue or Orange + Blue . However, ABC is only offered on the Blue package, but you can watch simulcasted games on ESPN3 (which is only offered on Sling&#8217;s Orange package). Rather than choose between the two, you can combine the two with the Orange + Blue package, which will give you access to more than 50 channels, DVR storage and the ability to stream on up to three devices.\n\nget sling tv here\n\nHulu + Live TV\n\nA subscription to Hulu + Live TV gets you more than 95 live TV channels, such as ABC, to watch live sports, TV series and specials whenever you want. You also get access to the entire Hulu on-demand library (including select ABC content available to watch the day after it airs).\n\nRight now, the streamer is offering three months of service for $64.99 per month. Once the promotion is over, a regular subscription starts for $82.99 per month.\n\nFor even more content options, Hulu + Live TV includes a subscription both Disney+ and ESPN Unlimited , which will give you access to more sports coverage and ESPN exclusive content.\n\nget hulu + live tv",
  "contentSource": "content:encoded"
}
