{
  "id": "8733d2f151af691cedffebc965c6ee98c70f2c03",
  "title": "Star-Crossed Hockey Lovers: Here’s How to Watch ‘Heated Rivalry’ Season Finale for Free",
  "summary": "The final episode of season 1 is set to drop Dec. 26.",
  "canonicalUrl": "https://www.billboard.com/culture/product-recommendations/heated-rivalry-season-finale-how-to-watch-free-1236144573",
  "source": {
    "id": "billboard",
    "name": "Billboard",
    "url": "https://www.billboard.com/",
    "feedUrl": "https://www.billboard.com/feed/",
    "country": "US",
    "language": "en"
  },
  "publishedAt": "2025-12-25T15:00:00.000Z",
  "fetchedAt": "2025-12-25T16:24:41.478Z",
  "category": "entertainment",
  "tags": [
    "Culture",
    "Product Recommendations",
    "hbo max",
    "hockey",
    "NOADS",
    "streaming"
  ],
  "image": "https://www.billboard.com/wp-content/uploads/2025/12/Heated-Rivalry-press-25-billboard-1800.jpg?w=237&amp;h=147&amp;crop=1",
  "language": "en",
  "storagePath": "data/articles/entertainment/2025/12/25/8733d2f151af691cedffebc965c6ee98c70f2c03.json",
  "contentText": "All products and services featured are independently chosen by editors. However, Billboard may receive a commission on orders placed through its retail links, and the retailer may receive certain auditable data for accounting purposes.\n\nHeated Rivalry has been all anyone&rsquo;s been talking about, and for good reason.\n\nThe show, which is a queer hockey-meets-romance, follows two top male players and fierce rivals working through the trials and tribulations of maintaining a public image, while secretly seeing each other off the ice. One, an Ottawa-born go-getter, Shane Hollander and bad-boy Russian Ilya Rozanov . The pair&rsquo;s relationship is complicated, but it gets you hooked from the first episode on.\n\nRelated\n\nHow &lsquo;Heated Rivalry&rsquo; Episode 4&rsquo;s&nbsp;Viral&nbsp;&lsquo;All the Things She Said&rsquo; Needle Drop Came Together: &lsquo;Instead of Tripping Out at the Club,&nbsp;You&rsquo;re Lusting&nbsp;Out&rsquo;&nbsp;\n\n&lsquo;Heated Rivalry&rsquo; Synchs Lead to Big Gains for Feist, Wolf Parade, Wet Leg & More Indie&nbsp;Favorites\n\nNBA On Christmas: How to Watch Every Basketball Game Online for Free\n\nIt&rsquo;s a game of cat and mouse, a &ldquo;will they or won&rsquo;t they&rdquo; situation that we at ShopBillboard can&rsquo;t get enough of. The sixth and final episode of the first season is set to air via HBO Max on Dec. 26 at midnight ET and 9pm PT, a great Christmas gift from the streaming service. Not to fret, though, this isn&rsquo;t the end of the star-crossed hockey romance. The show has already been renewed for a second season. If you didn&rsquo;t know, the show was created by Jacob Tierney and adapted from a book of the same name by author Rachel Reid, a book which you can shop below.\n\nThe show hasn&rsquo;t just been a hit with TV-watchers and hockey fans. Among music fans, the show&rsquo;s soundtrack has done some big things. The show&rsquo;s first three episodes featured tracks from Feist, Wet Leg and Wolf Parade, have all received Heated Rivalry -assisted bumps in streaming &mdash; and the numbers are just getting bigger and bigger. In episode four, a chaotic and tension-filled moment at a Canadian nightclub set to t.A.T.u.&rsquo;s All the Things She Said , gave the song a major bump in streaming, creating a viral moment for the show and the track.\n\nIf you&rsquo;re as eager as we are to catch the final episode of the season, we&rsquo;ll be showing you how to do so, for free, down below. Gird your loins and grab your popcorn, this episode is surely going to be a stellar one.\n\nHow to Watch the Season Finale of Heated Rivalry for Free\n\nWatch The 'Heated Rivalry' Season finale for free via DIRECTV\n\nHBO Max does not offer a free trial directly, but we&rsquo;ve found a hack that will save you time and money.&nbsp; DIRECTV &nbsp;offers a five-day free trial and includes HBO Max access in certain plans, which means you can get a free trial to DirecTV with acess to HBO Max, to watch Heated Rivalry , for free for a limited time.\n\nDIRECTV &nbsp;offers complimentary access to HBO Max in its MyEntertainment and Premier packages. The Entertainment package offers 50+ channels, like A&E, Discovery, FX, Hallmark, plus Disney+, Hulu, and HBO Max ad-supported bundles with unlimited cloud DVR. After your free trial, you&rsquo;ll be paying $29.99 for your first month and then $35 a month . Then you&rsquo;ve got the Premier package which features a whopping 185 channels including ESPN, Hulu, Disney+, STARZ, and Paramount+, as well as HBO Max. Premier will run you $169.99 a month, but you get $45 off your first month and $20 off months 2-24.\n\nHulu, Disney+ and HBO MAx Bundle\n\nAnother way to watch the show&rsquo;s season finale is by subscribing to the Disney+, Hulu and HBO Max bundle, a three streaming service deal that will give you the best band for your buck. Unfortunately, triple threat service does not offer a free trial, however the pricing is relatively cheap. With ads, you&rsquo;re looking to pay $19.99 a month . Without ads, you&rsquo;re looking at $32.99 a month . The subscription gives you access to all of the content you could dream of, that includes Heated Rivalry .\n\nGet hbo max via prime video\n\nThe final way to watch Heated Rivalry is to add&nbsp; HBO Max to your Amazon Prime for $18.49 a month for a standard plan or $10.99 a month for HBO Max&rsquo;s Basic plan with ads. To add, simply&nbsp;go to the Prime Video app or website, find the &ldquo;Channels&rdquo; or &ldquo;Subscriptions&rdquo; section, search for Max, and subscribe through your Amazon account.\n\nWhile you&rsquo;re waiting for the season finale, why not hold yourself over by shopping the books the queer hockey romance show was based on? The series has become a best-seller on Amazon, and it&rsquo;s easy to see why with the show&rsquo;s immense popularity.&nbsp;The book&rsquo;s sequel, &ldquo;The Long Game,&rdquo; is also available on Amazon.\n\n\"Heated Rivalry\" by Rachel Reid&nbsp;\n\n$17.70 $18.99 7% off\n\nBuy Now On Amazon\n\nA queer romance novel by Rachel Reid .\n\n\"The Long Game\" by Rachel Reid&nbsp;\n\n$8.99\n\nBuy Now On Amazon\n\nThe sequel to &ldquo;Heated Rivalry&rdquo; by Rachel Reid.\n\nRachel Reid&nbsp;\n\nWatch the Heated Rivalry Trailer via HBO Max Here",
  "contentSource": "content:encoded"
}
