{
  "id": "bd1d70e3dff403bc5d737bf530274581d5f82dd1",
  "title": "Is Ariana Grande’s ‘Christmas & Chill’ EP Secretly One of Her Most Important Releases?",
  "summary": "On this week's Great Moments in Pop Star History episode of the Greatest Pop Star podcast, we discuss a low-key moment in Grande's career that ended up foreshadowing a lot of her future.",
  "canonicalUrl": "https://www.billboard.com/music/pop/ariana-grande-christmas-chill-greatest-pop-stars-podcast-1236145521",
  "source": {
    "id": "billboard",
    "name": "Billboard",
    "url": "https://www.billboard.com/",
    "feedUrl": "https://www.billboard.com/feed/",
    "country": "US",
    "language": "en"
  },
  "publishedAt": "2025-12-25T15:20:07.000Z",
  "fetchedAt": "2025-12-25T16:24:41.478Z",
  "category": "entertainment",
  "tags": [
    "Music",
    "Pop",
    "Greatest Pop Stars Podcast",
    "podcasts"
  ],
  "image": "https://www.billboard.com/wp-content/uploads/2025/12/image_6e1d4d.png?w=300",
  "language": "en",
  "storagePath": "data/articles/entertainment/2025/12/25/bd1d70e3dff403bc5d737bf530274581d5f82dd1.json",
  "contentText": "In late 2015, Ariana Grande &#8216;s seemingly frictionless ascendance to all-consuming pop superstardom had finally hit a tiny bit of turbulence. &#8220;Donutgate&#8221; and other small-scale controversies had put her in the media&#8217;s crossfire for the first time, while &#8220;Focus&#8221; — the planned lead single off her upcoming third album, then to be titled Moonlight — had disappointed commercially and left fans a little cold. It was nothing she couldn&#8217;t and wouldn&#8217;t bounce back from, but in the meantime, she dropped a surprise release to celebrate the holiday season, and give both her sound and her career a little bit of a reset: the six-song EP Christmas & Chill .\n\nOn this week’s Great Moments in Pop Star History episode of the Greatest Pop Stars podcast , host Andrew Unterberger is joined by Billboard staff writer and longtime Arianator Kyle Denis to look back at 10 years of Christmas & Chill . We remember the Ariana Grande holiday releases that preceded it — including a song that&#8217;s already well on its way to being an all-time seasonal standard — and then dive into why Chill has come to hold a particularly special place in the hearts of fans and of Grande herself, as well as how it ended up predicting a lot of the places she would go in her later secular releases.\n\nWhile doing so, we address all the most pressing questions around Grande&#8217;s Christmas & Chill —&nbsp;how did an EP with no self-consciously big songs on it end up playing such a big part in her career? What are our favorite songs on the EP? How did she get away with a ukulele song in 2015? Do we care about the difference between the &#8220;Naughty&#8221; and nice versions of &#8220;Santa Tell Me&#8221;? Why has Grande never made much of an effort to actively revisit or repromote any of her holiday releases? And perhaps most importantly: Is there a world in which Grande eventually ends up being Mariah Carey&#8217;s successor as the Queen of Christmas?\n\nCheck it out above&nbsp;— along with a YouTube playlist of some of Ariana&#8217;s most relevant holiday music moments, all of which are discussed in the podcast — and subscribe to the&nbsp; Greatest Pop Stars podcast &nbsp;on&nbsp; Apple Music &nbsp;or&nbsp; Spotify &nbsp;(or wherever you get your&nbsp; podcasts ) for weekly discussions every Thursday about all things related to pop stardom!\n\nAlso check out Kyle&#8217;s 2025 Year in R&B review , as well as his recent Druski cover story .\n\nAnd as we say in every one of these GPS podcast posts — if you have the time and money to spare, please consider donating to any of these causes in the fight for trans rights:\n\nTransgender Law Center\n\nTrans Lifeline\n\nDestination Tomorrow\n\nGender-Affirming Care Fundraising on GoFundMe",
  "contentSource": "content:encoded"
}
