{
  "id": "43dd986f4eba382d9ff0c0c2ce94148ad996c1d6",
  "title": "Egypt becomes the seventh country in the Eastern Mediterranean Region to eliminate trachoma as a public health problem",
  "summary": "The World Health Organization (WHO) today announced that Egypt has successfully eliminated trachoma as a public health problem, marking a historic public health milestone for the country and WHO’s Eastern Mediterranean Region (WHO EMR). It is the seventh country in WHO EMR to achieve this milestone. The validation of Egypt’s achievement brings the total num…",
  "canonicalUrl": "https://www.who.int/news/item/12-11-2025-egypt-becomes-the-seventh-country-in-the-eastern-mediterranean-region-to-eliminate-trachoma-as-a-public-health-problem",
  "source": {
    "id": "who_news",
    "name": "World Health Organization - News (EN)",
    "url": "https://www.who.int/news",
    "feedUrl": "https://www.who.int/rss-feeds/news-english.xml",
    "country": "UN",
    "language": "en"
  },
  "publishedAt": "2025-11-12T09:43:51.000Z",
  "fetchedAt": "2025-12-24T00:05:45.493Z",
  "category": "health",
  "tags": [],
  "image": null,
  "language": "en",
  "storagePath": "data/articles/health/2025/11/12/43dd986f4eba382d9ff0c0c2ce94148ad996c1d6.json",
  "contentText": "The World Health Organization (WHO) today announced that Egypt has successfully eliminated trachoma as a public health problem, marking a historic public health milestone for the country and WHO&rsquo;s Eastern Mediterranean Region (WHO EMR). It is the seventh country in WHO EMR to achieve this milestone. The validation of Egypt&rsquo;s achievement brings the total number of countries that have eliminated trachoma as a public health problem worldwide to 27.\n\n&ldquo;I congratulate Egypt for reaching this milestone and liberating its people from trachoma,&rdquo; said Dr Tedros Adhanom Ghebreyesus, WHO Director-General.&nbsp; &ldquo;This demonstrates the effectiveness of sustained national leadership, strong surveillance and community engagement in ending a disease that has afflicted humanity since antiquity.&rdquo;\n\nFollowing Egypt&rsquo;s success, Trachoma remains a public health problem in 30 countries and is responsible for the blindness or visual impairment of about 1.9 million people. Blindness from trachoma is difficult to reverse. Based on April 2025 data, 103 million people live in trachoma endemic areas and are at risk of trachoma blindness.\n\nA century-long journey against trachoma\n\nTrachoma has been documented in Egypt for over 3,000 years. Public health efforts to address its burden began in the early 20th century, when pioneering ophthalmologist Arthur Ferguson MacCallan established Egypt&rsquo;s first mobile and permanent eye hospitals and laid the groundwork for organized trachoma control globally. Yet by the 1980s, it still blinded many adults and affected over half of all children in some Nile Delta communities.\n\nSince 2002, the Ministry of Health and Population of Egypt, in partnership with WHO and other national and international stakeholders, has pursued trachoma elimination through the WHO-endorsed SAFE strategy, which represents Surgery for trichiasis, Antibiotics to clear the causative organism, Facial cleanliness and Environmental improvement.&nbsp;\n\nBetween 2015 and 2025, extensive mapping and surveillance across all 27 of Egypt&rsquo;s governorates showed steady reductions in the proportion of children aged 1&ndash;9 years affected by active (inflammatory) trachoma, and no significant burden of the blinding complications of trachoma in adults. Both indicators are now below WHO elimination prevalence thresholds nationwide. In 2024, Egypt integrated trachoma surveillance into its national electronic disease reporting system, which should facilitate rapid response to any future cases.\n\n&ldquo;Egypt&rsquo;s elimination of trachoma as a public health problem underscores the nation&rsquo;s sustained commitment to equitable healthcare delivery and the transformative impact of initiatives such as Haya Karima, which have expanded access to safe water, sanitation, and primary care services in rural communities,&rdquo; said Professor Dr. Khaled Abdel Ghaffar, Deputy Prime Minister and Minister of Health and Population. &ldquo;This achievement is a collective triumph for Egypt&rsquo;s health workers, communities, and partners who collaborated to eradicate this ancient disease.&rdquo;\n\nTrachoma is the second neglected tropical disease (NTD) eliminated in Egypt, as in 2018 the country was validated by WHO for eliminating lymphatic filariasis as a public health problem. In total, 58 countries have eliminated at least one NTD globally, nine of which are in WHO Eastern Mediterranean Region.\n\n&ldquo;This milestone adds to Egypt&rsquo;s strong track record in eliminating communicable diseases, including polio, measles, rubella and most recently malaria. It demonstrates what can be achieved when political commitment, strong partnerships and years of sustained public health efforts, led by the Ministry of Health and Population, come together towards a shared vision,&rdquo; said Dr Nima Abid, WHO Representative to Egypt. \"Egypt&rsquo;s achievement serves as an inspiring example for other countries in the Region and beyond.\"\n\nSuccessful collaboration and partnerships &nbsp;\n\nEliminating trachoma in Egypt was the result of strong national leadership, coordinated action and broad collaboration across sectors. WHO worked closely with the Ministry of Health and Population to provide technical guidance, monitoring and validation support throughout the elimination process. The achievement was made possible through the technical and financial contributions of many partners including the Haya Karima Foundation, the Eastern Mediterranean Region Trachoma Alliance, the Nourseen Charity Foundation, the International Trachoma Initiative, the Global Trachoma Mapping Project, Sightsavers, CBM, the Kilimanjaro Centre for Community Ophthalmology, the Magrabi Foundation and the Tropical Data global initiative.\n\n&ldquo;Congratulations to Egypt on this historic achievement in eliminating trachoma as a public health problem,&rdquo; said Dr Hanan Balkhy, WHO Regional Director for the Eastern Mediterranean. &ldquo;Together, we have proven that with collaboration and persistence, elimination is achievable. This success reflects years of dedication and the tireless efforts of communities, health workers, and partners who stood firm in the conviction that everyone deserves to live free from preventable disease. Today, Egypt exemplifies what determination can accomplish.&rdquo;&nbsp;\n\nNote to the editor\n\nAbout trachoma and neglected tropical diseases\n\nTrachoma, caused by the bacterium Chlamydia trachomatis , is spread through contact with infected eye discharges via hands, clothes, hard surfaces and flies. Repeated infections can lead to scarring of the inner eyelid, turning eyelashes inward to scratch the cornea: a painful condition, known as trachomatous trichiasis, that can result in blindness.\n\nGlobally, the disease remains endemic in many vulnerable communities where access to clean water and sanitation is limited. In 1998, WHO launched the WHO Alliance for the Global Elimination of Trachoma by 2020 (GET2020), supported by a network of governments, nongovernmental organizations and academic institutions. WHO continues to support endemic countries to accelerate progress towards the global goal of eliminating trachoma as a public health problem worldwide.\n\n&nbsp;",
  "contentSource": "content"
}
