{
  "id": "1a74df9f4b7ea73d1821a50f446943cc5fe0526b",
  "title": "StubHub Apologizes After Mistakenly Listing Lamb of God as Christian Concert",
  "summary": "The metal band’s frontman joked about the mistake on his social media.",
  "canonicalUrl": "https://www.billboard.com/music/rock/stubhub-apology-lamb-of-god-christian-concert-1236145538",
  "source": {
    "id": "billboard",
    "name": "Billboard",
    "url": "https://www.billboard.com/",
    "feedUrl": "https://www.billboard.com/feed/",
    "country": "US",
    "language": "en"
  },
  "publishedAt": "2025-12-24T18:58:17.000Z",
  "fetchedAt": "2025-12-25T01:31:27.211Z",
  "category": "entertainment",
  "tags": [
    "Music",
    "Rock",
    "Concerts",
    "genre rock",
    "Music News",
    "stubhub",
    "Touring"
  ],
  "image": "https://i.imgur.com/2HpFicp.png",
  "language": "en",
  "storagePath": "data/articles/entertainment/2025/12/24/1a74df9f4b7ea73d1821a50f446943cc5fe0526b.json",
  "contentText": "Heavy metal fans in South Carolina were disappointed to discover that the Lamb of God concert they expected was actually a performance about the birth of Jesus Christ.\n\nTicket reseller StubHub apologized on Monday (Dec. 22) after accidentally listing the Virginia-based rock band instead of Christian musician Andrew Peterson’s Behold the Lamb of God, a concert featuring music about the stories of Christ, held at the Spartanburg Memorial Auditorium on Dec. 20.\n\nIn the days leading up to Peterson’s show, the StubHub listing featured a photo of Lamb of God frontman Randy Blythe and listed the concert as a top-trending event at the Spartanburg Memorial Auditorium, according to CBS affiliate WSPA in Spartanburg. Lamb of God isn’t scheduled to perform until March 2026, and the band currently has no announced dates in South Carolina.\n\nAfter realizing the error, StubHub apologized for the confusion and offered refunds for anyone who purchased tickets to the show.\n\n&#8220;We acknowledge the listing for the December 20 event at Spartanburg Memorial Auditorium was misleading and apologize for the confusion this caused,&#8221; a StubHub spokesperson said. &#8220;Ahead of the show we updated the event page and reached out to customers to clarify the event details. Anyone who purchased tickets under the impression this was a different performance is encouraged to contact us — we’ll honor a full refund under our FanProtect Guarantee.”\n\nLamb of God’s Blythe took notice of the mistake and joked about it on his Instagram Story , reposting news reports about the mix-up. “Oopsie,” the rocker wrote over one story, while commenting “Merry Christmas Spartanburg” on another.",
  "contentSource": "content:encoded"
}
