{
  "id": "27663b01750e6871b93e77c1276663fe07bc4dc5",
  "title": "Nicki Minaj Deactivates Instagram After Appearing With Erika Kirk at Turning Point USA’s AmericaFest",
  "summary": "The rap star sat down with Charlie Kirk’s widow in Phoenix on Dec. 21.",
  "canonicalUrl": "https://www.billboard.com/music/music-news/nicki-minaj-deactivates-instagram-erika-kirk-americafest-1236145534",
  "source": {
    "id": "billboard",
    "name": "Billboard",
    "url": "https://www.billboard.com/",
    "feedUrl": "https://www.billboard.com/feed/",
    "country": "US",
    "language": "en"
  },
  "publishedAt": "2025-12-24T17:50:30.000Z",
  "fetchedAt": "2025-12-25T01:31:27.211Z",
  "category": "entertainment",
  "tags": [
    "Music",
    "Music News",
    "genre rap",
    "politics"
  ],
  "image": "https://www.billboard.com/wp-content/uploads/2025/12/Erika-Kirk-and-Nicki-Minaj-dec-2025-billboard-1800.jpg?w=237&#038;h=147&#038;crop=1",
  "language": "en",
  "storagePath": "data/articles/entertainment/2025/12/24/27663b01750e6871b93e77c1276663fe07bc4dc5.json",
  "contentText": "Nicki Minaj is stepping back from social media following her recent guest appearance at Turning Point USA’s AmericaFest.\n\nAs of Wednesday (Dec. 24), the 43-year-old rap superstar had deactivated her Instagram account amid backlash after sitting down with Erika Kirk , the wife of right-wing political commentator Charlie Kirk, for an interview in Phoenix on Dec. 21. Visitors to the account now see the message, “Sorry, this page isn&#8217;t available.”\n\nRelated\n\nNicki Minaj Isn&#8217;t a &#8216;Good Role Model&#8217; for Young Black Women, Charlie Kirk Said in Resurfaced 2024&nbsp;Clip\n\nAmber Rose Defends Nicki Minaj for AmericaFest Appearance & Supporting President Trump: &#8216;I Don&#8217;t Know Why People Twist Our&nbsp;Words&#8217;\n\nJD Vance Praises Nicki Minaj After She Accidentally Calls Him an &#8216;Assassin&#8217; at Turning Point USA&nbsp;Event\n\nBillboard has reached out to Minaj’s representatives for comment.\n\nFans were quick to note that Minaj has occasionally deleted her Instagram account, including in October .\n\nDuring the interview, Minaj praised both President Donald Trump and Vice President JD Vance, calling them “amazing role models” before awkwardly referring to Vance as an “assassin.”\n\n&#8220;Dear young men, you have amazing role models like our handsome, dashing president and you have amazing role models like the assassin JD Vance, our vice president,” she said, quickly realizing the mistake. (Charlie Kirk was shot and killed on Sept. 10 in what Utah Gov. Spencer Cox described as a “political assassination.”)\n\nErika immediately reassured Minaj after the slip-up. &#8220;Trust me, there’s nothing new under the sun that I have not heard. So you’re fine,” she said. “I love you.”\n\nAfter the interview, Amber Rose defended Minaj against claims that her support for Trump could alienate the LGBTQ+ community.\n\n“She didn’t say anything wrong,” Rose told TMZ. “She didn’t say anything about the LGBTQ+ community at all. Why do people think anyone over there is homophobic? I’m not homophobic, my assistant has been with me for 11 years; he’s Black and gay. I have a bunch of trans friend — so does Nicki.”\n\nVance also credited Minaj for a point she made during the conversation with Erika, noting that uplifting one community doesn’t mean putting down another.\n\n“Nicki Minaj said something at Amfest that was really profound. I’m paraphrasing, but she said, ‘just because I want little black girls to think they’re beautiful doesn’t mean I need to put down little girls with blonde hair and blue eyes,” the VP wrote on X.\n\nIn addition to her appearance at AmericaFest, Minaj has become more politically outspoken in recent months. She voiced opposition to the alleged persecution of Christians in Nigeria, which led to her speaking at a United Nations event in November.",
  "contentSource": "content:encoded"
}
