{
  "id": "707460229f91b4da24c8b00b41ca0afe25856c7b",
  "title": "Natalia Lafourcade Announces Birth of Her First Child: ‘Little Popcorn, My Precious Boy’",
  "summary": "Just in time for Christmas, the Mexican singer-songwriter becomes a mother at age 41.",
  "canonicalUrl": "https://www.billboard.com/music/latin/natalia-lafourcade-announces-birth-of-first-child-1236145526",
  "source": {
    "id": "billboard",
    "name": "Billboard",
    "url": "https://www.billboard.com/",
    "feedUrl": "https://www.billboard.com/feed/",
    "country": "US",
    "language": "en"
  },
  "publishedAt": "2025-12-24T17:01:00.000Z",
  "fetchedAt": "2025-12-25T01:31:27.211Z",
  "category": "entertainment",
  "tags": [
    "Latin",
    "Music",
    "baby news",
    "birth",
    "genre latin",
    "Music News"
  ],
  "image": "https://i.imgur.com/2HpFicp.png",
  "language": "en",
  "storagePath": "data/articles/entertainment/2025/12/24/707460229f91b4da24c8b00b41ca0afe25856c7b.json",
  "contentText": "Natalia Lafourcade is in for a joyful holiday season. The Mexican singer-songwriter announced that she has become a mother at the age of 41, just in time for Christmas. The multi-award-winning artist reappeared on social media on Tuesday night (Dec. 23) to share the news of her firstborn&#8217;s arrival with a series of snapshots and an emotional message welcoming him.\n\n&#8220;Times of waiting and finally dying to be reborn as a mother. Thank you, life, for giving me so much!&#8221; Lafourcade wrote . &#8220;Finally, the ray of light that entered the deepest part of my being to bring life and the most beautiful garden of flowers. Little Popcorn, my precious boy. At 41, in his 41.3 week. ¡Viva la vida! And happy holidays.&#8221;\n\nDetails like the date of the birth or the name of the baby weren&#8217;t provided.\n\nIn the series of photos accompanying her message, there&#8217;s one where she appears bare-chested while breastfeeding her newborn, alongside her partner and the baby&#8217;s father, Mexican-Venezuelan filmmaker Juan Pablo López-Fonseca, with whom she shares both a professional and personal relationship.\n\n“Here I am with my mom right after she gave birth, the first thing I did when I came into this world was breastfeed. My first day on this earth. My parents love taking pictures of me,” reads a handwritten caption on the sweet photo. The rest of the carousel captures moments leading up to her son&#8217;s arrival, with images of the Virgin of Guadalupe, flowers, paintings, and the final days of her pregnancy.\n\nAfter a few months off the stage, the Grammy and Latin Grammy-winner will resume her international Cancionera Tour 2026 on May 15 in Bogota, Colombia, before continuing through Peru, Chile, Uruguay, Argentina, and Ecuador. The trek will also take her to several cities in the U.S. and Canada starting in April.\n\nThe tour takes its name from her latest LP, CANCIONERA , which won three Latin Grammy Awards in November. The set will now compete at the 2026 Grammys in the best Latin pop album category.",
  "contentSource": "content:encoded"
}
