{
  "id": "ad80bc33097feab84fc55a9e8f2d2e97c0df4579",
  "title": "Diddy Seeks Immediate Release From Prison in Appeals Argument",
  "summary": "His attorneys argue that the federal judge imposed an unusually harsh sentence.",
  "canonicalUrl": "https://www.billboard.com/business/legal/diddy-seeks-immediate-release-prison-appeals-1236145545",
  "source": {
    "id": "billboard",
    "name": "Billboard",
    "url": "https://www.billboard.com/",
    "feedUrl": "https://www.billboard.com/feed/",
    "country": "US",
    "language": "en"
  },
  "publishedAt": "2025-12-24T19:22:46.000Z",
  "fetchedAt": "2025-12-25T01:31:27.211Z",
  "category": "entertainment",
  "tags": [
    "Business",
    "Legal News",
    "genre rap",
    "Legal",
    "Music News",
    "nsfs"
  ],
  "image": "https://www.billboard.com/wp-content/uploads/2024/10/janice-combs-diddy-2023-billboard-espanol-1548.jpg?w=237&#038;h=147&#038;crop=1",
  "language": "en",
  "storagePath": "data/articles/entertainment/2025/12/24/ad80bc33097feab84fc55a9e8f2d2e97c0df4579.json",
  "contentText": "Lawyers for hip-hop mogul Sean “Diddy” Combs urged a federal appeals court in New York late Tuesday (Dec. 23) to order his immediate release from prison and reverse his conviction on prostitution-related charges or direct his trial judge to lighten his four-year sentence.\n\nRelated\n\nSean Combs&#8217; Mother Slams Netflix Docuseries for &#8216;False&#8217; Abuse&nbsp;Claims\n\nThe 10 Biggest Music Law Stories of 2025: AI, Diddy, Drake, Mariah Carey &&nbsp;More\n\nAfter Watching &#8216;Sean Combs: The Reckoning,&#8217; Joe Budden Says Diddy &#8216;Didn&#8217;t Get Enough Time&#8217; in&nbsp;Prison\n\nThe lawyers said in a filing with the 2nd U.S. Circuit Court of Appeals in Manhattan that Combs was treated harshly at sentencing by a federal judge who let evidence surrounding charges he was acquitted of unjustly influence the punishment.\n\nCombs, 56, incarcerated at a federal prison in New Jersey and scheduled for release in May 2028, was acquitted of racketeering conspiracy and sex trafficking at a trial that ended in July. Combs was convicted under the Mann Act, which bans transporting people across state lines for any sexual crime.\n\nLawyers for Combs said Judge Arun Subramanian acted like a “thirteenth juror” in October when he sentenced Combs to four years and two months in prison. They said he erred by letting evidence surrounding the acquitted charges influence the sentence he imposed.\n\nThey noted that Combs was convicted of two lesser counts, prostitution offenses that didn’t require force, fraud, or coercion. They asked the appeals court, which has not yet heard oral arguments, to acquit Combs, order his immediate release from prison or direct Subramanian to reduce his sentence.\n\n“Defendants typically get sentenced to less than 15 months for these offenses — even when coercion, which the jury didn’t find here, is involved,” the lawyers wrote.\n\n“The judge defied the jury’s verdict and found Combs ‘coerced,’ ‘exploited,’ and ‘forced’ his girlfriends to have sex and led a criminal conspiracy. These judicial findings trumped the verdict and led to the highest sentence ever imposed for any remotely similar defendant,” the lawyers wrote.\n\nAt sentencing, Subramanian said that when calculating the prison term, he considered Combs’ treatment of two former girlfriends who testified that the Bad Boy Records founder beat them and coerced them into having sex with male sex workers while he watched and filmed the encounters, sometimes masturbating.\n\nAt the trial, former girlfriend Casandra “Cassie” Ventura testified that Combs ordered her to have “disgusting” sex with strangers hundreds of times during their decade-long relationship that ended in 2018. Jurors saw video of him dragging and beating her in a Los Angeles hotel hallway after one such multiday “freak-off.”\n\nThe second former girlfriend, who testified under the pseudonym “ Jane,” said she was pressured into sex with male workers during what Combs called “hotel nights,” drug-fueled sexual encounters from 2021 to 2024 that also could last days.\n\nAt sentencing, Subramanian said he “rejects the defense’s attempt to characterize what happened here as merely intimate, consensual experiences, or just a sex, drugs, and rock ‘n’ roll story.”\n\nHe added: “You abused the power and control that you had over the lives of women you professed to love dearly. You abused them physically, emotionally, and psychologically. And you used that abuse to get your way, especially when it came to freak-offs and hotel nights.”",
  "contentSource": "content:encoded"
}
