{
  "id": "d68eaddbfd5b0638b0ff11ad175eb71c04c02211",
  "title": "10 Celeb-Loved Last-Minute Gifts That Will Deliver Instantly",
  "summary": "It's not too late to make a great impression.",
  "canonicalUrl": "https://www.billboard.com/culture/product-recommendations/last-minute-gifts-for-the-holidays-1235188539",
  "source": {
    "id": "billboard",
    "name": "Billboard",
    "url": "https://www.billboard.com/",
    "feedUrl": "https://www.billboard.com/feed/",
    "country": "US",
    "language": "en"
  },
  "publishedAt": "2025-12-24T20:57:00.000Z",
  "fetchedAt": "2025-12-25T01:31:27.211Z",
  "category": "entertainment",
  "tags": [
    "Culture",
    "Product Recommendations",
    "christmas",
    "Holiday Gift Guide",
    "NOADS"
  ],
  "image": "https://www.billboard.com/wp-content/uploads/2024/04/cameo-logo.jpg?w=500&#038;h=500&#038;crop=1",
  "language": "en",
  "storagePath": "data/articles/entertainment/2025/12/24/d68eaddbfd5b0638b0ff11ad175eb71c04c02211.json",
  "contentText": "All products and services featured are independently chosen by editors. However, Billboard may receive a commission on orders placed through its retail links, and the retailer may receive certain auditable data for accounting purposes.\n\nChristmas is hours away and if you’re among the millions of last-minute shoppers who are planning to buy gifts this week , we have good news and bad news.\n\nLet&#8217;s start with the bad news first: if you&#8217;re still hoping to send a physical gift to your recipient (say, like a trendy tech gadget or beauty product), you&#8217;ll basically out of luck. Most shipping deadlines have passed to ensure delivery before Dec. 25 and many stores are closed on Christmas Eve and Christmas Day. If you&#8217;re willing to pick up (and deliver) your present in person, you can try placing an online order from sites like Walmart and Target , and then heading to the store to grab your items. Many Walmart and Target stores are open late on Christmas Eve.\n\nFIND LAST-MINUTE GIFTS AT TARGET\n\nNow for some good news: there are a number of easy last-minute gifts that you can order online, and get delivered (almost) instantly, whether over email or delivered within hours to your door. From celebrity videos to musical events, here are 10 easy last-minute gift ideas for the holidays.\n\nBook a Celebrity Cameo\n\nFIND A CELEB HERE\n\nCameo lets you book a celebrity video, holiday greeting or shout-out from athletes, singers, entertainers and social media stars alike. Prices start at just $10 and many of the stars on Cameo are offering delivery within 24 hours. You can even book a special shout-out from Santa Claus himself, with your video guaranteed to be delivered by Christmas Day. What we like: once you choose a favorite celebrity, you can specify exactly who you want the video to be for and give the celeb prompts on what to say. Cameo has everyone from big actors to K-pop stars alike . This is a personalized gift your recipient won&#8217;t soon forget.\n\nMilk Bar Desserts\n\n$100 $115 13% off\n\nGET GIFT CARD\n\nEveryone loves Milk Bar, the New York dessert spot that&#8217;s been shouted out by everyone from Taylor Swift to Mariah Carey. That&#8217;s for good reason too: the celeb-loved bakery is famous for its Confetti Cookies, Corn Flakes Cookies, Birthday Cake Truffles and more, and almost everything can now be delivered to your door &#8212; even if you don&#8217;t live in NYC. Right now, you can order a $100 gift card for Milk Bar online and get an extra $15 tacked on for free. Order here and get the gift card delivered via email instantly. Your recipient can then use the gift card to choose the sweet treats they want.\n\nBook of the Month Club\n\n$59.99+\n\nSEND GIFT NOW\n\nWhether they&#8217;re into young adult novels or newsy non-fiction, the Book of the Month Club sends your recipient a new book each month to keep them reading. Choose from three, six or 12-book options, which your recipient can redeem online for a new hardcover book or audiobook. Club members get a ton of other bonus perks too. Case in point: all gift memberships right now come with a trendy Book of the Month Club &#8220;dad hat.&#8221; Select a membership option to gift here and you&#8217;ll receive a printable card that you can deliver to your recipient, or have them receive an email where they can redeem their gift online.\n\nMeUndies Membership\n\n$11.80+\n\nSEND GIFT NOW\n\nBoxers, bras and socks are things that everybody needs but few people buy for themselves, which is why we like giving MeUndies memberships as an easy last-minute gift. Monthly memberships let you get a delivery of new underwear each month, and your recipient gets to pick their preferred category (I.e. boxer briefs or panties), sizes, colors and even fun prints. Pricing starts from just $11/month. Not sure if they need a year&#8217;s worth of undies? You can also pick up a MeUndies gift card for 10% off right now for a limited time.\n\nPersonalized Pet Portraits\n\n$35+\n\nBuy Now AT UNCOMMON GOODS\n\nWe love the website Uncommon Goods for thousands of unique gift ideas, ranging from personalized products and custom gifts, to monthly subscription boxes. But the site also offers a host of fun experiences, like a pet portrait class, which sets you up with an art teacher and all the tools you need (brushes, paints) to create a watercolor painting of your four-legged friend. The experience includes a 120-minute live virtual class for 1-2 people. This is one of the most popular gift ideas on the Uncommon Goods website right now but you can browse all the options here .\n\nMasterClass Subscription\n\nGET DEAL HERE $5 $5\n\nYour college days may be behind you but that doesn&#8217;t mean the learning needs to stop. MasterClass is an online site that lets you take virtual video lessons from hundreds of celebrities, like Mariah Carey, Christina Aguilera, Questlove, Timbaland, composer Hans Zimmer and more. It&#8217;s not just music either &#8212; you can learn acting from Jodie Foster, tennis from Serena Williams and even management from momager Kris Jenner herself. MasterClass is currently 50% off for the holidays, bringing the monthly price of a subscription down to just $5 . Sign someone up as a last-minute gift and your recipient will get a welcome email alerting them of your purchase.\n\nBreo Box Delivery\n\n$149+\n\nBuy Now AT BREO BOX\n\nFor something truly unexpected, get them a Breo Box , which is a quarterly subscription box stocked with the latest tech releases and buzzy gadgets. Past boxes and featured everything from Bluetooth speakers and wireless chargers, to small kitchen appliances and even a drone. Pricing starts from just $149/box with each box guaranteed to have 4-8 full-size items. A bonus: you can save $35 off right now with promo code JOLLY35 . Or choose to get a $100 &#8220;Mystery Bundle&#8221; that&#8217;s worth over $300 in value, free with your first box. To redeem that offer, use the promo code  XMASGIFT at checkout.\n\nJIGGY Puzzle Membership\n\n$34\n\nBuy Now AT JIGGY\n\nIf you know someone who loves puzzles (or have someone who already has everything), consider getting them a JIGGY Puzzle Club membership. Each month, they&#8217;ll receive a new 500-piece puzzle with a reusable drawstring bag and original artwork print. What we like: all of the puzzle designs are exclusive to JIGGY and they are all designed by female artists. A portion of your monthly subscription fee will also go back directly to the artists themselves.\n\nUpgrade Their Streaming Service\n\n$49.99 $89.99 44% off\n\nGET DEAL HERE\n\nIf you&#8217;re shopping for someone who loves streaming live sports or watching TV, consider upgrading their viewing experience with a streaming package from DirecTV . DirecTV lets you watch more than 90 cable channels over the internet, without needing a box or antenna. Their &#8220;Entertainment&#8221; package is currently $40 off and includes free access to ESPN Unlimited plus unlimited DVR recording. This is an especially-great gift idea for parents or grandparents who love TV but no longer need a bulky or annoying cable box.\n\nBook Them a Fever Experience\n\n$20+\n\nGET GIFT CARD HERE\n\nFever is known for putting on unique musical activations across the country, like its popular Beyonce candlelight concerts and BTS tribute events . Aside from music, Fever also offers experiences ranging from art installations to immersive spectacles, special talks, restaurant and city tours, theater shows and more. Not sure where to start? Get your recipient a Fever gift card, which will let them choose an experience in their city. Gift cards range in prices and can be delivered instantly, making for a memorable last-minute gift.",
  "contentSource": "content:encoded"
}
