{
  "id": "ebc860c3501ef006ab2eaa3562c2168d77e60470",
  "title": "Sabrina Carpenter Gifts ‘Man’s Best Friend’ Bonus Track Edition & Lyric Video on Christmas Eve",
  "summary": "\"Thank you for such a beautiful year,\" the pop star wrote.",
  "canonicalUrl": "https://www.billboard.com/music/pop/sabrina-carpenter-mans-best-friend-bonus-track-edition-1236145547",
  "source": {
    "id": "billboard",
    "name": "Billboard",
    "url": "https://www.billboard.com/",
    "feedUrl": "https://www.billboard.com/feed/",
    "country": "US",
    "language": "en"
  },
  "publishedAt": "2025-12-24T20:39:19.000Z",
  "fetchedAt": "2025-12-25T01:31:27.211Z",
  "category": "entertainment",
  "tags": [
    "Music",
    "Pop",
    "genre pop",
    "Music News"
  ],
  "image": "https://www.billboard.com/wp-content/uploads/2025/06/sabrina-carpenter-manchild-music-video-still-2025-billboard-1548.jpg?w=237&#038;h=147&#038;crop=1",
  "language": "en",
  "storagePath": "data/articles/entertainment/2025/12/24/ebc860c3501ef006ab2eaa3562c2168d77e60470.json",
  "contentText": "Sabrina Carpenter is treating fans to a surprise gift on Christmas Eve.\n\nOn Wednesday (Dec. 24), the 26-year-old pop star released Man’s Best Friend (Bonus Track Version) on streaming services, featuring the previously shared track “Such a Funny Way.”\n\nRelated\n\nSabrina Carpenter Reveals the Secret Clue About &#8216;Man&#8217;s Best Friend&#8217; She Hid in the &#8216;Manchild&#8217; Video\n\nSabrina Carpenter Makes &#8216;Pet Sounds&#8217; During a Day Drinking Session With Seth Meyers:&nbsp;Watch\n\nWhite House Quietly Deletes ICE Video After Sabrina Carpenter&nbsp;Backlash\n\n&#8220;To thank you for such a beautiful year …and to supply whoever needs a cathartic christmas crashout song… Man’s best friend bonus track edition with one of my favorites ‘Such a Funny Way’ is now officially available on streaming,&#8221; Carpenter wrote on Instagram . &#8220;I love you guys so much. Thank you for caring for these songs the way i do and for such a special 2025!! I feel lucky to know there’s still so much good to come x.&#8221;\n\nAlong with the bonus track edition, Carpenter also released a lyric video for “Such a Funny Way” on YouTube .\n\nCarpenter originally dropped her seventh studio album, Man’s Best Friend , on Aug. 29. The album debuted at No. 1 on the Billboard 200 in September, giving the pop star her second chart-topping release following 2024’s Short n’ Sweet .\n\n“Such a Funny Way” was previously available for digital download with the Man’s Best Friend album for $7.99. Prior to that, it was exclusive to the vinyl deluxe edition of the album. Around the time, the Grammy winner shared the inspiration behind “Such a Funny Way” during an interview on Apple Music 1 with Zane Lowe.\n\n“I interpret humor, obviously, in a light way, but it’s also used to cover something and it’s used to definitely cope with things and not always in the best way,” she said. “I’ve had trouble in relationships before because people have been like, ‘Be serious.’&#8221;\n\nThe singer continued, “So much of the time it feels maybe less mean or hurtful or spiteful to be able to just laugh about it, and that’s a good thing sometimes and sometimes it’s a bad thing. So yeah, that one isn’t on the original version of the album, but it ends the album with the lyrics, ‘So funny that I have to laugh just so I don’t cry.&#8217;”\n\nCheck out Carpenter’s Christmas Eve Instagram post here , and watch the “Such a Funny Way” lyric video here .",
  "contentSource": "content:encoded"
}
