{
  "id": "0d3246660b81b142b0c96f97d37abcf940070a72",
  "title": "NASA Astronaut Nick Hague Retires",
  "summary": "NASA astronaut Brig. Gen. Nick Hague has retired from the agency, concluding a distinguished career that included two spaceflight missions, 374 days in space, and multiple spacewalks in support of the International Space Station. Hague continues service in the U.S. Space Force. Hague launched aboard the Soyuz MS-12 spacecraft in March 2019 from the Baikonur…",
  "canonicalUrl": "https://www.nasa.gov/news-release/nasa-astronaut-nick-hague-retires",
  "source": {
    "id": "nasa_release",
    "name": "NASA - News Releases",
    "url": "https://www.nasa.gov/",
    "feedUrl": "https://www.nasa.gov/news-release/feed/",
    "country": "US",
    "language": "en"
  },
  "publishedAt": "2025-12-23T14:50:46.000Z",
  "fetchedAt": "2025-12-24T00:05:42.850Z",
  "category": "science",
  "tags": [
    "Johnson Space Center",
    "Astronauts"
  ],
  "image": null,
  "language": "en",
  "storagePath": "data/articles/science/2025/12/23/0d3246660b81b142b0c96f97d37abcf940070a72.json",
  "contentText": "NASA Astronaut Nick Hague\n\nNASA astronaut Brig. Gen. Nick Hague has retired from the agency, concluding a distinguished career that included two spaceflight missions, 374 days in space, and multiple spacewalks in support of the International Space Station. Hague continues service in the U.S. Space Force.\n\nHague launched aboard the Soyuz MS-12 spacecraft in March 2019 from the Baikonur Cosmodrome in Kazakhstan for his first long-duration mission, serving as a flight engineer during Expeditions 59/60. During this 203-day mission, he conducted three spacewalks to upgrade the station’s power systems and support ongoing maintenance of the orbiting laboratory. Hague also contributed to a wide range of scientific investigations, spanning biology, human physiology, materials science, and technology demonstrations.\n\nHague originally was assigned to fly in 2018 as part of the Soyuz MS-10 crew. The mission experienced a launch anomaly shortly after liftoff, and Hague and his crewmate executed a high-G ballistic abort. The two landed safely and Hague returned to flight status within months, ultimately completing his 2019 mission.\n\nHe flew again during NASA’s SpaceX Crew-9 mission, launching in September 2024 alongside Roscosmos cosmonaut Aleksandr Gorbunov. It was the first human spaceflight mission launched from Space Launch Complex 40 at Cape Canaveral Space Force Station in Florida, and it also marked the first time a Space Force Guardian launched to space. Hague then joined the Expedition 72 crew, spending 171 days aboard the station before returning in March 2025 along with NASA astronauts Butch Wilmore and Suni Williams. During the mission, he conducted another spacewalk, bringing his career total to 25 hours and 56 minutes across four spacewalks.\n\n“Nick’s determination and dedication to human space exploration are truly phenomenal,” said Vanessa Wyche, director of NASA’s Johnson Space Center in Houston. “His leadership and commitment to mission excellence have supported progress aboard the International Space Station and prepared us for future missions as we continue to explore farther into the solar system.”\n\nBeyond his flight experience, Hague served in several technical and leadership roles within NASA. He supported the development of future spacecraft operations, contributed to astronaut training, and played a key role in human spaceflight safety initiatives, drawing on his firsthand experience during the MS-10 launch abort.\n\n“Nick brought calm, clarity, and a spirit of teamwork to every situation,” said Scott Tingle, chief of the Astronaut Office at NASA Johnson. “From his work in orbit to his support of crew operations here on Earth, he exemplified what it means to be an astronaut. His impact will continue to shape the missions and the astronauts who follow.”\n\nA native of Hoxie, Kansas, Hague is a brigadier general in the U.S. Space Force where he is responsible for the development and implementation of policy for all U. S. Space Force global operations, sustainment, training and readiness. He earned a bachelor’s degree in astronautical engineering from the U.S. Air Force Academy in Colorado and a master’s degree in astronautical engineering from the Massachusetts Institute of Technology. Before joining NASA in 2013, he served in developmental and test engineer roles supporting advanced Air Force technologies and operations at home and abroad.\n\n“It has been an honor to serve as a NASA astronaut,” said Hague. “Working alongside incredible teams, on the ground and in space, has been the privilege of a lifetime. The International Space Station represents the very best of what humanity can accomplish when we work together. I am grateful to have contributed to that mission, and I look forward to watching NASA, our partners, and the next generation of explorers push even farther as we return to the Moon and journey on to Mars.”\n\nTo learn more about NASA’s astronauts and their contributions to space exploration, visit:\n\nhttps://www.nasa.gov/astronauts\n\n-end-\n\nShaneequa Vereen\nJohnson Space Center, Houston\n281-483-5111\nshaneequa.y.vereen@nasa.gov",
  "contentSource": "content:encoded"
}
