{
  "id": "511027376cdf5b4a9a580e3c69775b701d19161c",
  "title": "Artemis II Crew Launch Day Rehearsal",
  "summary": "From left to right, CSA (Canadian Space Agency) astronaut Jeremy Hansen and NASA astronauts Christina Koch, Victor Glover, and Reid Wiseman stand outside before boarding their Orion spacecraft inside the Vehicle Assembly Building at NASA’s Kennedy Space Center in Florida as part of the Artemis II countdown demonstration test, Saturday, Dec. 20, 2025. Becaus…",
  "canonicalUrl": "https://www.nasa.gov/image-article/artemis-ii-crew-launch-day-rehearsal",
  "source": {
    "id": "nasa_release",
    "name": "NASA - News Releases",
    "url": "https://www.nasa.gov/",
    "feedUrl": "https://www.nasa.gov/news-release/feed/",
    "country": "US",
    "language": "en"
  },
  "publishedAt": "2025-12-23T16:18:41.000Z",
  "fetchedAt": "2025-12-24T00:05:42.850Z",
  "category": "science",
  "tags": [
    "Artemis 2",
    "Christina H. Koch",
    "G. Reid Wiseman",
    "Victor J. Glover"
  ],
  "image": null,
  "language": "en",
  "storagePath": "data/articles/science/2025/12/23/511027376cdf5b4a9a580e3c69775b701d19161c.json",
  "contentText": "NASA/Aubrey Gemignani\n\nFrom left to right, CSA (Canadian Space Agency) astronaut Jeremy Hansen and NASA astronauts Christina Koch, Victor Glover, and Reid Wiseman stand outside before boarding their Orion spacecraft inside the Vehicle Assembly Building at NASA’s Kennedy Space Center in Florida as part of the Artemis II countdown demonstration test , Saturday, Dec. 20, 2025. Because the SLS (Space Launch System) rocket upon which they will launch is not yet at the launch pad, the crew boarded Orion inside NASA Kennedy’s Vehicle Assembly Building, where engineers are conducting final preparations on the spacecraft, rocket, and ground systems. During the rehearsal, teams went through all the steps that will be taken on launch day, winding the clock down to just a few seconds before liftoff.\n\nThrough the Artemis campaign, NASA will send astronauts to explore the Moon for scientific discovery, economic benefits, and to build the foundation for the first crewed missions to Mars, for the benefit of all.\n\nSee more photos from the countdown demonstration test.\n\nImage credit: NASA/Aubrey Gemignani",
  "contentSource": "content:encoded"
}
