{
  "id": "6daf3c85061ce5fb431c5455f7a9bfc19c73c61e",
  "title": "I Am Artemis: Grace Lauderdale",
  "summary": "Listen to this audio excerpt from Grace Lauderdale, exploration project manager for the Training Systems Office at NASA Johnson: In preparation for their mission around the Moon inside NASA’s Orion spacecraft, the Artemis II crew will spend countless hours training inside the Orion Mission Simulator. The simulator replicates what the crew will experience in…",
  "canonicalUrl": "https://www.nasa.gov/missions/artemis/i-am-artemis/i-am-artemis-grace-lauderdale",
  "source": {
    "id": "nasa_release",
    "name": "NASA - News Releases",
    "url": "https://www.nasa.gov/",
    "feedUrl": "https://www.nasa.gov/news-release/feed/",
    "country": "US",
    "language": "en"
  },
  "publishedAt": "2025-12-23T14:00:00.000Z",
  "fetchedAt": "2025-12-24T00:05:42.850Z",
  "category": "science",
  "tags": [
    "I Am Artemis",
    "Artemis",
    "Orion Multi-Purpose Crew Vehicle",
    "Orion Program"
  ],
  "image": null,
  "language": "en",
  "storagePath": "data/articles/science/2025/12/23/6daf3c85061ce5fb431c5455f7a9bfc19c73c61e.json",
  "contentText": "3 Min Read\n\nI Am Artemis: Grace Lauderdale\n\nGrace Lauderdale, exploration project manager for the Training Systems Office at NASA&#039;s Johnson Space Center in Houston, sits inside the Orion Mission Simulator used for training the Artemis II crew and flight control team.\n\nCredits:\nNASA/Rad Sinyak\n\nListen to this audio excerpt from Grace Lauderdale, exploration project manager&nbsp;for the&nbsp;Training Systems Office at NASA Johnson :\n\n0:00 / 0:00\n\nYour browser does not support the audio element.\n\nIn preparation for their mission around the Moon inside NASA’s Orion spacecraft, the Artemis II crew will spend countless hours training inside the Orion Mission Simulator. The simulator replicates what the crew will experience inside the spacecraft and allows the astronauts and flight controllers to rehearse every phase of the mission.\n\nAs the exploration project manager for the Training Systems Office at Johnson, Grace Lauderdale leads the team that develops and operates the Orion Mission Simulator at NASA’s Johnson Space Center in Houston, playing a key role in making sure astronauts and flight control teams are ready for the first crewed mission of the Artemis campaign.\n\n\"This simulator trains the flight control team and the crew all the way from launch to splashdown. Every button, every display, every view out the window is as lifelike as possible.”\n\nGrace Lauderdale\n\nExploration Project Manager for the Training Systems Office at NASA Johnson\n\nThe simulator is more than a mock-up. It connects directly to Johnson’s Mission Control Center, sending real-time data, audio, and video — just like the spacecraft will during flight. That means the flight control team trains in parallel, seeing and hearing exactly what they would throughout the mission.\n\n“One of our major goals is to make the data they see on their displays look like the real vehicle,” Lauderdale said. “We also simulate the near space and deep space networks, including all the communication delays. It’s all about realism.”\n\nThat realism is powered by a complex software system developed in collaboration with partners like Lockheed Martin. Lauderdale’s team works behind the scenes to ensure the simulator runs smoothly — writing code, troubleshooting issues, and even creating custom malfunctions to challenge the crew during training.\n\nGrace Lauderdale, exploration project manager for the Training Systems Office at NASA&#8217;s Johnson Space Center in Houston, sits inside the Orion Mission Simulator used for training the Artemis II crew and flight control team.\n\nCredits: NASA/Rad Sinyak\n\nTo prepare astronauts for the unexpected, instructors work with Lauderdale’s team to simulate problems that could occur during the mission, some of which require creative solutions.\n\n“There are times when the instructors will ask for malfunctions or capabilities that the sim doesn’t automatically do,” she said. “Part of our role is to come up with ways to make that happen.”\n\nHer team plans, develops, and executes training scenarios in the Orion Mission Simulator across multiple Artemis missions, often simultaneously. “Currently, we’re planning for future crewed missions, developing Artemis III, and executing Artemis II,” she said.\n\nThe work is demanding, but deeply personal, according to Lauderdale.\n\n“I’ve known I wanted to work at NASA since the seventh grade. Every class I took, the degree I earned — it was all to get here.”\n\nGrace Lauderdale\n\nExploration Project Manager for the Training Systems Office at NASA Johnson\n\nThat passion shows in her leadership. Her team often works nights, weekends, and holidays to ensure the simulator is ready. During a recent 30-hour simulation, they spent days preparing, fixing memory issues, and ensuring the system wouldn’t crash. It didn’t.\n\n“I’m very proud of my team,” she said. “They’ve put in countless hours of work to make sure this simulator reacts exactly as it would in the real mission.”\n\nFor Lauderdale, helping send astronauts around the Moon isn’t just a job—it’s a dream realized.\n\n“Being part of getting us back to the Moon is very personal to me,” she said. “And I’m proud to be part of the team that will help get our astronauts there.”\n\nReid Wiseman and Victor Glover train for the Artemis II mission inside the Orion Mission Simulator at NASA&#8217;s Johnson Space Center in Houston.\n\nNASA/Bill Stafford\n\nAbout the Author\n\nErika Peters\n\nShare\n\n-\n\n-\n\n-\n\n-\n\nDetails\n\nLast Updated\n\nDec 22, 2025\n\nRelated Terms\n\n- I Am Artemis\n\n- Artemis\n\n- Orion Multi-Purpose Crew Vehicle\n\n- Orion Program\n\nExplore More\n\n3 min read\n\nGet In, We’re Going Moonbound: Meet NASA’s Artemis Closeout Crew\n\nArticle\n\n2 days ago\n\n4 min read\n\nArtemis II Flight Crew, Teams Conduct Demonstration Ahead of Launch\n\nArticle\n\n2 days ago\n\n6 min read\n\nNASA Kennedy Top 20 Stories of 2025\n\nArticle\n\n3 days ago\n\nKeep Exploring\n\nDiscover More Topics From NASA\n\nMissions\n\nHumans in Space\n\nClimate Change\n\nSolar System",
  "contentSource": "content:encoded"
}
