{
  "id": "700e90945139582b1260a0e2721686ec2daa7d00",
  "title": "OPERA: Addressing Societal Needs with Satellite Data",
  "summary": "Introduction The Observational Products for End-Users from Remote Sensing Analysis (OPERA) project represents a strategic initiative designed to address critical satellite data needs identified by federal agencies. Established in 2021 by the NASA/Jet Propulsion Laboratory (JPL), OPERA responds to priorities identified by the Satellite Needs Working Group (S…",
  "canonicalUrl": "https://science.nasa.gov/science-research/earth-science/opera-addressing-societal-needs-with-satellite-data",
  "source": {
    "id": "nasa_release",
    "name": "NASA - News Releases",
    "url": "https://www.nasa.gov/",
    "feedUrl": "https://www.nasa.gov/news-release/feed/",
    "country": "US",
    "language": "en"
  },
  "publishedAt": "2025-12-23T18:55:41.000Z",
  "fetchedAt": "2025-12-24T00:05:42.850Z",
  "category": "science",
  "tags": [
    "Earth Science"
  ],
  "image": null,
  "language": "en",
  "storagePath": "data/articles/science/2025/12/23/700e90945139582b1260a0e2721686ec2daa7d00.json",
  "contentText": "Explore This Section\n\n- Earth\n\n- Earth Observer\n\n- Editor’s Corner\n\n- Feature Articles\n\n- Meeting Summaries\n\n- News\n\n- Science in the News\n\n- Calendars\n\n- In Memoriam\n\n- Announcements\n\n- More\n\n- Archives\n\n- Conference Schedules\n\n- Style Guide\n\n5 min read\n\nOPERA: Addressing Societal Needs with Satellite Data\n\nIntroduction\n\nThe Observational Products for End-Users from Remote Sensing Analysis (OPERA) project represents a strategic initiative designed to address critical satellite data needs identified by federal agencies. Established in 2021 by the NASA/Jet Propulsion Laboratory (JPL), OPERA responds to priorities identified by the Satellite Needs Working Group (SNWG), an interagency body convened by the White House Office of Management and Budget (OMB) and Office of Science and Technology Policy (OSTP). SNWG surveys federal agencies every two years to determine their top satellite data needs. This article summarizes OPERA, including its mandate, and then presents a case study demonstrating how the United States Department of Agriculture (USDA) Agricultural Research Service (ARS) is using OPERA to monitor agricultural health in the Midwestern United States.\n\nOPERA Mandate and Approach\n\nThe core mandate for the OPERA project lies in its commitment to delivering data products in formats that are immediately usable and analysis-ready. Rather than providing raw satellite data that requires extensive processing expertise, OPERA transforms complex satellite observations into standardized, accessible products that federal agencies can quickly integrate into their existing workflows to support national security, environmental monitoring, disaster response, and infrastructure management. This approach eliminates the technical barriers that often prevent agencies from effectively using satellite data, allowing them to focus on their mission-critical applications rather than data processing challenges.\n\nTo achieve this goal at the scale required by federal agencies, OPERA has developed a sophisticated cloud-based production system capable of generating data products efficiently and consistently to meet the dynamic needs of federal users. As of 2025, OPERA has successfully released dynamic surface water extent, surface disturbance, and surface displacement data through various NASA Distributed Active Archive Centers (DAACs). The vertical land motion product will be OPERA’s next offering beginning in 2028 – see Figure 1 .\n\nFigure 1. As of 2025, OPERA has successfully released dynamic surface water extent, surface disturbance, and surface displacement data products that are available through various NASA Distributed Active Archive Centers. The vertical land motion product will be OPERA’s next offering beginning in 2028.\n\nFigure credit : Clockwise starting from bottom left. Firth River Yukon, Water Data. Credit: USGS/John Jones, Lava boiling out of the Kilauea Volcano, Volcano Data. Credit: ASI/NASA/JPL-Caltech, Subsidence and uplift over New York City, Vertical Land Motion Data. Credit: NASA/JPL-Caltech, Fire fighting helicopter carry water bucket to extinguish the forest fire, Fire Data. Credit: Hansen/UMD/Google/USGS/NASA\n\nOPERA Mission\n\nOPERA delivers high-quality, ready-to-use satellite-derived information to enable federal agencies to better monitor environmental changes, respond to natural disasters, assess infrastructure risks, and make data-driven decisions. To illustrate this goal, OPERA’s 5th Annual Stakeholder Engagement Workshop detailed real-world applications of this approach on Sept. 11, 2025.\n\nCase Study: Harnessing OPERA Data to Map Crop Health in Midwest United States\n\nWhen water lingers on farmland, the consequences often ripple outward, resulting in crop losses, changes in soil health, and shifting carbon storage. In the rolling landscape of central Iowa’s South Fork watershed, these challenges are a daily reality for farmers, researchers, and crop insurance companies. To address these concerns, scientists at the U.S. Department of Agriculture–Agriculture Research Service’s (USDA–ARS) National Laboratory for Agriculture and the Environment (NLAE) are partnering with NASA’s OPERA project.\n\nUsing OPERA’s Dynamic Surface Water Extent (DSWx) and Surface Disturbance (DIST) product suites, USDA–NLAE researchers began the process of identifying depressions where water consistently ponds across fields – see Figure 2 .\n\nFigure 2 . The map of maximum inundation combines individual Observational Products for End-Users from Remote Sensing Analysis (OPERA) Dynamic Surface Water Extent (DSWx) granules acquired over a month.\n\nFigure credit : NASA/JPL-Caltech, Dr. Renato Prata de Moraes Frasson\n\nThese sites are often more than nuisance puddles; they signal areas of reduced yield, risk for crop mortality, and hotspots for carbon and nutrient accumulation. By combining OPERA’s cloud-free, high-resolution mosaics with field-based measurements from USDA and university partners, the joint OPERA-NLAE team is producing actionable maps that pinpoint waterlogged zones – see Figure 3 . Farmers can use these maps to improve soil health and guide land-management decisions.\n\nFigure 3 . The map depicts a field south of Iowa Falls in Hardin County, IA. The pixels are color-coded to indicate the number of times a region is inundated with water from May through October 2024. Larger numbers are associated with deeper depressions and with perennial lakes and rivers, including the Iowa River flowing west to east in the northern part of the image.\n\nFigure credit :  NASA/JPL-Caltech, Dr. Renato Prata de Moraes Frasson\n\nThe OPERA products also support broader watershed management. Analyses of river migration, oxbow lake formation, and storm damage from powerful Midwestern derecho events show how OPERA data extend beyond field plots to larger areas. By detecting both persistent inundation and shifts in vegetation health, DSWx and DIST together provide synergistic information identifying areas where improved tile drainage may result in better crop health and increased yields. This approach can also be used to mitigate topsoil erosion and nutrient transport to control the development of harmful algal blooms and the occurrence of anoxic zones with implications far beyond the Mississippi Delta.\n\nConclusion\n\nThe use of OPERA data by USDA–ARS to map and monitor crop health in the Midwest United States highlights how this vital data product bridges the gap between Earth science and agricultural resilience. The outcome of this collaboration underscores OPERA’s mission – translating cutting-edge satellite observations into usable tools that support farmers, improve soil and water conservation, and strengthen the resilience of U.S. agriculture. This collaboration signifies the mandate of OPERA as an SNWG solution provider to fulfill the observation needs of federal users. All OPERA’s data products are freely available to the public from various NASA DAACs and are discoverable from the NASA Earthdata Search platform. The team welcomes direct engagement with individual federal, state, academic, and commercial stakeholders and can be reached via opera.sep@jpl.nasa.gov.\n\nSteven K. Chan\nJet Propulsion Laboratory, California Institute of Technology\nsteven.k.chan@jpl.nasa.gov\n\nRenato Prata de Moraes Frasson\nJet Propulsion Laboratory, California Institute of Technology\nrenato.prata.de.moraes.frasson@jpl.nasa.gov\n\nAl Handwerger\nJet Propulsion Laboratory, California Institute of Technology\nalexander.handwerger@jpl.nasa.gov\n\nShare\n\n-\n\n-\n\n-\n\n-\n\nDetails\n\nLast Updated\n\nDec 23, 2025\n\nRelated Terms\n\n- Earth Science",
  "contentSource": "content:encoded"
}
