{
  "id": "8938dc83636293b94a73dc8a1e4a9e17c003545e",
  "title": "NASA’s Hubble Reveals Largest Found Chaotic Birthplace of Planets",
  "summary": "Astronomers using NASA’s Hubble Space Telescope have imaged the largest protoplanetary disk ever observed circling a young star. For the first time in visible light, Hubble has revealed the disk is unexpectedly chaotic and turbulent, with wisps of material stretching much farther above and below the disk than astronomers have seen in any similar system. […]",
  "canonicalUrl": "https://science.nasa.gov/missions/hubble/nasas-hubble-reveals-largest-found-chaotic-birthplace-of-planets",
  "source": {
    "id": "nasa_release",
    "name": "NASA - News Releases",
    "url": "https://www.nasa.gov/",
    "feedUrl": "https://www.nasa.gov/news-release/feed/",
    "country": "US",
    "language": "en"
  },
  "publishedAt": "2025-12-23T14:00:20.000Z",
  "fetchedAt": "2025-12-24T00:05:42.850Z",
  "category": "science",
  "tags": [
    "Astrophysics",
    "Astrophysics Division",
    "Goddard Space Flight Center",
    "Hubble Space Telescope",
    "The Universe"
  ],
  "image": null,
  "language": "en",
  "storagePath": "data/articles/science/2025/12/23/8938dc83636293b94a73dc8a1e4a9e17c003545e.json",
  "contentText": "Explore Hubble\n\n- Hubble Home\n\n- Overview\n\n- About Hubble\n\n- The History of Hubble\n\n- Hubble Timeline\n\n- Why Have a Telescope in Space?\n\n- Hubble by the Numbers\n\n- At the Museum\n\n- FAQs\n\n- Impact &#038; Benefits\n\n- Hubble’s Impact &#038; Benefits\n\n- Science Impacts\n\n- Cultural Impact\n\n- Technology Benefits\n\n- Impact on Human Spaceflight\n\n- Astro Community Impacts\n\n- Science\n\n- Hubble Science\n\n- Science Themes\n\n- Science Highlights\n\n- Science Behind Discoveries\n\n- Universe Uncovered\n\n- Hubble’s Partners in Science\n\n- Hubble &#038; Citizen Science\n\n- AI &#038; Hubble Science\n\n- Explore the Night Sky\n\n- Observatory\n\n- Hubble Observatory\n\n- Hubble Design\n\n- Mission Operations\n\n- Science Operations\n\n- Astronaut Missions to Hubble\n\n- Hubble vs Webb\n\n- Team\n\n- Hubble Team\n\n- Career Aspirations\n\n- Hubble Astronauts\n\n- Multimedia\n\n- Images\n\n- Videos\n\n- Sonifications\n\n- Podcasts\n\n- e-Books\n\n- Online Activities\n\n- 3D Hubble Models\n\n- Lithographs\n\n- Fact Sheets\n\n- Posters\n\n- Hubble on the NASA App\n\n- Glossary\n\n- News\n\n- Hubble News\n\n- Social Media\n\n- Media Resources\n\n- More\n\n- 35th Anniversary\n\n- Online Activities\n\n4 Min Read\n\nNASA’s Hubble Reveals Largest Found Chaotic Birthplace of Planets\n\nAstronomers using NASA’s Hubble Space Telescope have imaged the largest protoplanetary disk ever observed circling a young star. For the first time in visible light, Hubble has revealed the disk is unexpectedly chaotic and turbulent, with wisps of material stretching much farther above and below the disk than astronomers have seen in any similar system. Strangely, more extended filaments are only visible on one side of the disk. The findings, which published Tuesday in The Astrophysical Journal, mark a new milestone for Hubble and shed light on how planets may form in extreme environments, as NASA’s missions lead humanity’s exploration of the universe and our place in it.\n\nLocated roughly 1,000 light-years from Earth, IRAS 23077+6707, nicknamed “Dracula’s Chivito,” spans nearly 400 billion miles — 40 times the diameter of our solar system to the outer edge of the Kuiper Belt of cometary bodies. The disk obscures the young star within it, which scientists believe may be either a hot, massive star, or a pair of stars. And the enormous disk is not only the largest known planet-forming disk; it’s also shaping up to be one of the most unusual.\n\n“The level of detail we’re seeing is rare in protoplanetary disk imaging, and these new Hubble images show that planet nurseries can be much more active and chaotic than we expected,” said lead author Kristina Monsch of the Center for Astrophysics | Harvard &#038; Smithsonian (CfA). “We’re seeing this disk nearly edge-on and its wispy upper layers and asymmetric features are especially striking. Both Hubble and NASA’s James Webb Space Telescope have glimpsed similar structures in other disks, but IRAS 23077+6707 provides us with an exceptional perspective — allowing us to trace its substructures in visible light at an unprecedented level of detail. This makes the system a unique, new laboratory for studying planet formation and the environments where it happens.”\n\nThe nickname “Dracula’s Chivito” playfully reflects the heritage of its researchers—one from Transylvania and another from Uruguay, where the national dish is a sandwich called a chivito. The edge-on disk resembles a hamburger, with a dark central lane flanked by glowing top and bottom layers of dust and gas.\n\nThis Hubble Space Telescope image shows the largest planet-forming disk ever observed around a young star. It spans nearly 400 billion miles — 40 times the diameter of our solar system.\n\nImage: NASA, ESA, STScI, Kristina Monsch (CfA); Image Processing: Joseph DePasquale (STScI)\n\nPuzzling asymmetry\n\nThe impressive height of these features wasn’t the only thing that captured the attention of scientists. The new images revealed that vertically imposing filament-like features appear on just one side of the disk, while the other side appears to have a sharp edge and no visible filaments. This peculiar, lopsided structure suggests that dynamic processes, like the recent infall of dust and gas, or interactions with its surroundings, are shaping the disk.\n\n“We were stunned to see how asymmetric this disk is,” said co-investigator Joshua Bennett Lovell, also an astronomer at the CfA. “Hubble has given us a front row seat to the chaotic processes that are shaping disks as they build new planets — processes that we don’t yet fully understand but can now study in a whole new way.”\n\nAll planetary systems form from disks of gas and dust encircling young stars. Over time, the gas accretes onto the star, and planets emerge from the remaining material. IRAS 23077+6707 may represent a scaled-up version of our early solar system, with a disk mass estimated at 10 to 30 times that of Jupiter — ample material for forming multiple gas giants. This, plus the new findings, makes it an exceptional case for studying the birth of planetary systems.\n\n“In theory, IRAS 23077+6707 could host a vast planetary system,” said Monsch. “While planet formation may differ in such massive environments, the underlying processes are likely similar. Right now, we have more questions than answers, but these new images are a starting point for understanding how planets form over time and in different environments.”\n\nCredit: NASA’s Goddard Space Flight Center; Lead Producer: Paul Morris\nThe Hubble Space Telescope has been operating for over three decades and continues to make ground-breaking discoveries that shape our fundamental understanding of the universe. Hubble is a project of international cooperation between NASA and ESA (European Space Agency). NASA’s Goddard Space Flight Center in Greenbelt, Maryland, manages the telescope and mission operations. Lockheed Martin Space, based in Denver, also supports mission operations at Goddard. The Space Telescope Science Institute in Baltimore, which is operated by the Association of Universities for Research in Astronomy, conducts Hubble science operations for NASA.\n\nFacebook logo\n\n@NASAHubble\n\n@NASAHubble\n\nInstagram logo\n\n@NASAHubble\n\nRelated Images &#038; Videos\n\nDracula’s Chivito (IRAS 23077+6707)\n\nThis Hubble Space Telescope image shows the largest planet-forming disk ever observed around a young star. It spans nearly 400 billion miles — 40 times the diameter of our solar system.\n\nDracula’s Chivito (IRAS 23077+6707) Compass Image\n\nImage of Dracula’s Chivito captured by Hubble’s WFC3 instrument, with compass arrows, scale bar, and color key for reference.\n\nHubble Spots Giant Vampire Sandwich? Video\n\nDracula’s Chivito isn’t just the largest protoplanetary disk ever imaged, it’s also a window into how planets are born and how systems like our solar system may have formed.\n\nShare\n\n-\n\n-\n\n-\n\n-\n\nDetails\n\nLast Updated\n\nDec 23, 2025\n\nEditor\n\nAndrea Gianopoulos\n\nLocation\n\nNASA Goddard Space Flight Center\n\nContact\n\nMedia\n\nClaire Andreoli\n\nNASA’s Goddard Space Flight Center\n\nGreenbelt, Maryland\n\nclaire.andreoli@nasa.gov\n\nChristine Pulliam\n\nSpace Telescope Science Institute\n\nBaltimore, Maryland\n\nAmy Oliver\n\nCenter for Astrophysics | Harvard &#038; Smithsonian\n\nCambridge, Massachusetts\n\nRelated Terms\n\n- Hubble Space Telescope\n\n- Astrophysics\n\n- Astrophysics Division\n\n- Goddard Space Flight Center\n\n- The Universe\n\nRelated Links and Documents\n\n- Science Paper: Hubble reveals complex multi-scale structure in the edge-on protoplanetary disk IRAS 23077+6707 by K. Monsch et al.\n\nKeep Exploring\n\nDiscover More Topics From Hubble\n\nHubble Space Telescope\n\nSince its 1990 launch, the Hubble Space Telescope has changed our fundamental understanding of the universe.\n\nHubble Science Highlights\n\nHubble Images\n\nHubble News",
  "contentSource": "content:encoded"
}
