{
  "id": "8fd3ca459fd665584b81d0df79152621b8ed21b5",
  "title": "Get In, We’re Going Moonbound: Meet NASA’s Artemis Closeout Crew",
  "summary": "For most, getting into a car is a task that can be done without assistance. Yet for those whose destination is the Moon, the process of getting inside and secured – in this case, in NASA’s Orion spacecraft – requires help. That’s the role of the Artemis closeout crew. Trained to support Artemis II and […]",
  "canonicalUrl": "https://www.nasa.gov/centers-and-facilities/kennedy/get-in-were-going-to-the-moon-meet-nasas-artemis-closeout-crew",
  "source": {
    "id": "nasa_release",
    "name": "NASA - News Releases",
    "url": "https://www.nasa.gov/",
    "feedUrl": "https://www.nasa.gov/news-release/feed/",
    "country": "US",
    "language": "en"
  },
  "publishedAt": "2025-12-23T18:44:07.000Z",
  "fetchedAt": "2025-12-24T00:05:42.850Z",
  "category": "science",
  "tags": [
    "Kennedy Space Center",
    "Andre Douglas",
    "Artemis 2",
    "Christina H. Koch",
    "Exploration Ground Systems",
    "G. Reid Wiseman",
    "Orion Multi-Purpose Crew Vehicle",
    "Space Launch System (SLS)",
    "Victor J. Glover"
  ],
  "image": null,
  "language": "en",
  "storagePath": "data/articles/science/2025/12/23/8fd3ca459fd665584b81d0df79152621b8ed21b5.json",
  "contentText": "3 Min Read\n\nGet In, We’re Going Moonbound: Meet NASA’s Artemis Closeout Crew\n\nMembers of the Artemis II closeout crew, from left, William Sattler; Tyler Sutherland; Michael Heinemann; Christian Warriner; Jenni Gibbons, Artemis II backup crew member; Bill Owens; Taylor Hose; and Andre Douglas, Artemis II backup crew member, pose for a photo with NASA’s Vehicle Assembly Building behind them at the agency’s Kennedy Space Center in Florida on Thursday, Dec. 19, 2025.\n\nCredits:\nNASA/Jim Ross\n\nFor most, getting into a car is a task that can be done without assistance. Yet for those whose destination is the Moon, the process of getting inside and secured – in this case, in NASA’s Orion spacecraft – requires help. That’s the role of the Artemis closeout crew.\n\nTrained to support Artemis II and future Moon missions, the five closeout crew members will be the last people to see NASA astronauts Reid Wiseman, Victor Glover, and Christina Koch, and CSA (Canadian Space Agency) astronaut Jeremy Hansen before their lunar journey.\n\nThe Artemis II closeout team consists of a lead, Taylor Hose; an astronaut support person, astronaut Andre Douglas; one technician specially trained on Orion crew survival system spacesuits, Bill Owens; and two Orion technicians, Christian Warriner and Ricky Ebaugh.\n\nWe are responsible for getting the astronauts strapped in their spacecraft, getting all their connections attached to their spacesuits, and then we close the hatch and close out Orion for launch.\n\nTaylor Hose\n\nArtemis II Closeout Team Lead\n\nThink of them like a pit crew for car races.\n\nWhen the astronauts arrive on launch day at Launch Complex 39B at NASA’s Kennedy Space Center in Florida, the closeout crew will already be in place. First, the team will help the astronauts don their helmets and gloves before entering the Orion spacecraft.\n\nCloseout Crew lead Taylor Hose, second from left, talks with NASA astronaut Andre Douglas, second from right as he and closeout crewmembers Will Sattler, left, and Christian Warriner prepare for the arrival of Artemis II crewmembers NASA astronauts Reid Wiseman, commander; Victor Glover, pilot; Christina Koch, mission specialist; and CSA (Canadian Space Agency) astronaut Jeremy Hansen, mission specialist; at the 275-foot level of the mobile launcher as they prepare to board their Orion spacecraft atop NASA’s Space Launch System rocket during the Artemis II countdown demonstration test, Saturday, Dec. 20, 2025, inside the Vehicle Assembly Building at NASA Kennedy.\n\nNASA/Joel Kowsky\n\nOnce inside, Owens and Douglas will assist each crew member with buckling up – except instead of using just one seatbelt like in a car, the crew needs several more intricate connections. Each seat includes five straps to secure the astronauts inside the crew module and several additional connections to the environmental control and life support systems and communications system aboard.\n\nAfter the astronauts are secured, the hatch technicians will begin closing the spacecraft hatch. Unlike a car door that easily opens and closes with the pull of a handle, Orion’s hatch requires more effort to securely close.\n\n“The hatch is pneumatically driven so we have to have air lines hooked up to it, and we need the help of the ground support system to close it,&#8221; said Hose.\n\nBill Owens of the Closeout Crew is seen as he leads Artemis II crewmembers CSA (Canadian Space Agency) astronaut Jeremy Hansen, mission specialist; and NASA astronauts Reid Wiseman, commander; Victor Glover, pilot; and Christina Koch, mission specialist; out of at the elevator towards the crew access arm at the 275-foot level of the mobile launcher as they prepare to board their Orion spacecraft atop NASA’s Space Launch System rocket during the Artemis II countdown demonstration test, Saturday, Dec. 20, 2025, inside the Vehicle Assembly Building at NASA Kennedy.\n\nNASA/Joel Kowsky\n\nOn launch day, it will take about four hours for the crew to get situated inside Orion and for the closeout process, including buttoning up both the crew module hatch and an exterior launch abort system hatch, to be complete. Even a single strand of hair inside the hatch doors could potentially pose issues with closing either hatch, so the process is carefully done.\n\n“We have a lot of work to do with the seals alone – greasing, cleaning, taking the hatch cover off – and then we get into crew module hatch closure,” Hose said. “So after latching the hatch, we take window covers off, install thermal protection panels, and remove the purge barrier in between the vehicle and the ogive panels, which help protect the crew module during launch and ascent.”\n\nThe team then closes the launch abort system hatch and finishes final preparations before launch. Following the abort system hatch closure, the closeout crew departs the launch pad but stays nearby in case they need to return for any reason.\n\nTaylor Hose prepares for the arrival of Artemis II crewmembers NASA astronauts Reid Wiseman, commander; Victor Glover, pilot; Christina Koch, mission specialist; and CSA (Canadian Space Agency) astronaut Jeremy Hansen, mission specialist; at the 275-foot level of the mobile launcher to board their Orion spacecraft atop NASA’s Space Launch System rocket during the Artemis II countdown demonstration test, Saturday, Dec. 20, 2025, inside the Vehicle Assembly Building at NASA Kennedy.\n\nNASA/Joel Kowsky\n\nMy life goal was to be an astronaut. To help send people to the Moon for the first time since 1972 to not just go and visit, but this time to stay, I think that’s everything. That&#039;s our first steppingstone of going to Mars and expanding into the solar system.\n\nTaylor Hose\n\nArtemis II Closeout Team Lead\n\nAfter launch, several team members will head to San Diego, to help with post-splashdown efforts once the mission concludes.\n\nAs part of a Golden Age of innovation and exploration, the Artemis II test flight is the first crewed flight under NASA’s Artemis campaign. It is another step toward new U.S.-crewed missions on the Moon’s surface that will help the agency prepare to send the first astronauts – Americans – to Mars.\n\nAbout the Author\n\nAntonia Jaramillo\n\nShare\n\n-\n\n-\n\n-\n\n-\n\nDetails\n\nLast Updated\n\nDec 23, 2025\n\nRelated Terms\n\n- Kennedy Space Center\n\n- Andre Douglas\n\n- Artemis 2\n\n- Christina H. Koch\n\n- Exploration Ground Systems\n\n- G. Reid Wiseman\n\n- Orion Multi-Purpose Crew Vehicle\n\n- Space Launch System (SLS)\n\n- Victor J. Glover\n\nExplore More\n\n4 min read\n\nArtemis II Flight Crew, Teams Conduct Demonstration Ahead of Launch\n\nArticle\n\n2 days ago\n\n3 min read\n\nI Am Artemis: Grace Lauderdale\n\nArticle\n\n2 days ago\n\n6 min read\n\nNASA Kennedy Top 20 Stories of 2025\n\nArticle\n\n3 days ago\n\nKeep Exploring\n\nDiscover More Topics From NASA\n\nMissions\n\nHumans in Space\n\nClimate Change\n\nSolar System",
  "contentSource": "content:encoded"
}
