{
  "id": "bd50898d7ce52db11014538c624beb09c889262a",
  "title": "Curiosity Blog, Sols 4750-4762: See You on the Other Side of the Sun",
  "summary": "Written by Lucy Thompson, Planetary Scientist and APXS team member, University of New Brunswick, Canada Earth planning date: Monday, Dec. 22, 2025 As we all prepare for the holiday season here on Earth, we have been planning a few last activities before Curiosity and the team of scientists and engineers take a well-deserved, extended break. […]",
  "canonicalUrl": "https://science.nasa.gov/blog/curiosity-blog-sols-4750-4762-see-you-on-the-other-side-of-the-sun",
  "source": {
    "id": "nasa_release",
    "name": "NASA - News Releases",
    "url": "https://www.nasa.gov/",
    "feedUrl": "https://www.nasa.gov/news-release/feed/",
    "country": "US",
    "language": "en"
  },
  "publishedAt": "2025-12-23T01:37:40.000Z",
  "fetchedAt": "2025-12-24T00:05:42.850Z",
  "category": "science",
  "tags": [
    "Blogs"
  ],
  "image": null,
  "language": "en",
  "storagePath": "data/articles/science/2025/12/23/bd50898d7ce52db11014538c624beb09c889262a.json",
  "contentText": "Curiosity Navigation\n\n- Curiosity Home\n\n- Mission Overview\n\n- Where is Curiosity?\n\n- Mission Updates\n\n- Science\n\n- Overview\n\n- Instruments\n\n- Highlights\n\n- Exploration Goals\n\n- News and Features\n\n- Multimedia\n\n- Curiosity Raw Images\n\n- Images\n\n- Videos\n\n- Audio\n\n- Mosaics\n\n- More Resources\n\n- Mars Missions\n\n- Mars Sample Return\n\n- Mars Perseverance Rover\n\n- Mars Curiosity Rover\n\n- MAVEN\n\n- Mars Reconnaissance Orbiter\n\n- Mars Odyssey\n\n- More Mars Missions\n\n- Mars Home\n\n3 min read\n\nCuriosity Blog, Sols 4750-4762: See You on the Other Side of the Sun\n\nNASA’s Mars rover Curiosity acquired this image, with the boxwork terrain in the foreground and Gale crater rim in the far background, using its Right Navigation Camera. Curiosity captured the image on Dec. 21, 2025 — Sol 4755, or Martian day 4,755 of the Mars Science Laboratory mission — at 15:57:21 UTC.\n\nNASA/JPL-Caltech\n\nWritten by Lucy Thompson, Planetary Scientist and APXS team member, University of New Brunswick, Canada\n\nEarth planning date: Monday, Dec. 22, 2025\n\nAs we all prepare for the holiday season here on Earth, we have been planning a few last activities before Curiosity and the team of scientists and engineers take a well-deserved, extended break. This holiday season coincides with conjunction — every two years, because of their different orbits, Earth and Mars are obstructed from one another by the Sun; this one will last from Dec. 27 to Jan. 20. We do not like to send commands through the Sun in case they get scrambled, so we have been finishing up a few last scientific observations before preparing Curiosity for its quiet conjunction break.\n\nAs part of a pre-planned transect between our two recent drill holes, “Valle de la Luna” (hollow) and “Nevado Sajama” (ridge), we successfully completed chemical analyses and imaging of a ridge wall. These observations were acquired to document changes in texture, structure, and composition between the two drill holes and to elucidate why we see such contrasting physical features of resistant ridges and eroded hollows in this region. Mastcam and ChemCam also imaged a little further afield. ChemCam continued observations of the “Mishe Mokwa” butte and captured textures in the north facing wall of the next, adjacent hollow. Mastcam imaged the central fracture along the “Altiplano” ridge above the wall we were parked at, as well as polygonal features in our previous workspace.\n\nThe rover engineers then successfully orchestrated Curiosity’s drive back up onto the nearby ridge to ensure a safe parking spot over conjunction. We documented the drive with a MARDI sidewalk video, tracking how the terrain beneath the rover changes as we drive. Although we could not use APXS and MAHLI on the robotic arm from Friday on, owing to constraints that need to be in place prior to conjunction, we were able to use the rover’s Mastcam to image areas of interest in the near field, which will help us with our planned activities when we return from conjunction. These will hopefully include getting chemistry (with APXS and ChemCam) and imaging (with MAHLI) of some freshly broken rock surfaces that we drove over.\n\nThe environmental scientists were also very busy. Navcam observations included: Navcam suprahorizon and zenith movies to monitor clouds; Navcam line-of-sight observations; and Navcam dust-devil movies and surveys as we enter the dust storm season on Mars. Mastcam tau observations were acquired to monitor the optical depth of the atmosphere, and APXS analyses of the atmosphere were also planned to monitor seasonal variations in argon.\n\nToday we are uplinking the last plan before Mars disappears behind the Sun and we all take a break (the actual conjunction plan to take us through sols 4763-4787 was uplinked a couple of weeks ago). Because of constraints put in place to make sure Curiosity stays safe and healthy, we were limited to very few activities in today’s plan. These include more APXS atmospheric argon measurements and Hazcam and Navcam imaging including monitoring for dust-devil activity.\n\nAs usual, our plans also included background DAN, RAD, and REMS observations, which continue through conjunction.\n\nIt has been a pleasure to be a part of this amazing team for another year. We are all looking forward to coming back in January, when Mars reappears from behind the Sun, to another exciting year of roving in Gale crater.\n\n-\n\nWant to read more posts from the Curiosity team?\n\nVisit Mission Updates\n\n-\n\nWant to learn more about Curiosity’s science instruments?\n\nVisit the Science Instruments page\n\nNASA’s Mars rover Curiosity at the base of Mount Sharp\n\nNASA/JPL-Caltech/MSSS\n\nShare\n\n-\n\n-\n\n-\n\n-\n\nDetails\n\nLast Updated\n\nDec 22, 2025\n\nRelated Terms\n\n- Blogs\n\nExplore More\n\n3 min read\n\nWind-Sculpted Landscapes: Investigating the Martian Megaripple ‘Hazyview’\n\nArticle\n\n3 days ago\n\n3 min read\n\nCuriosity Blog, Sols 4743-4749:  Polygons in the Hollow\n\nArticle\n\n4 days ago\n\n2 min read\n\nHi ya! Hyha\n\nArticle\n\n5 days ago\n\nKeep Exploring\n\nDiscover More Topics From NASA\n\nMars\n\nMars is the fourth planet from the Sun, and the seventh largest. It’s the only planet we know of inhabited…\n\nAll Mars Resources\n\nExplore this collection of Mars images, videos, resources, PDFs, and toolkits. Discover valuable content designed to inform, educate, and inspire,…\n\nRover Basics\n\nEach robotic explorer sent to the Red Planet has its own unique capabilities driven by science. Many attributes of a…\n\nMars Exploration: Science Goals\n\nThe key to understanding the past, present or future potential for life on Mars can be found in NASA’s four…",
  "contentSource": "content:encoded"
}
