{
  "id": "bf38326ab2c1392bfe31a76c370df9820f384616",
  "title": "Artemis II Flight Crew, Teams Conduct Demonstration Ahead of Launch",
  "summary": "NASA’s launch and mission teams, along with the Artemis II crew, completed a key test Dec. 20, a countdown demonstration test, ahead of the Artemis II flight around the Moon early next year. The astronauts, supported by launch and flight control teams, dressed in their launch and entry suits, boarded their spacecraft on top of […]",
  "canonicalUrl": "https://www.nasa.gov/missions/artemis/artemis-2/artemis-ii-flight-crew-teams-conduct-demonstration-ahead-of-launch",
  "source": {
    "id": "nasa_release",
    "name": "NASA - News Releases",
    "url": "https://www.nasa.gov/",
    "feedUrl": "https://www.nasa.gov/news-release/feed/",
    "country": "US",
    "language": "en"
  },
  "publishedAt": "2025-12-23T16:00:31.000Z",
  "fetchedAt": "2025-12-24T00:05:42.850Z",
  "category": "science",
  "tags": [
    "Artemis 2",
    "Andre Douglas",
    "Christina H. Koch",
    "Exploration Ground Systems",
    "G. Reid Wiseman",
    "Kennedy Space Center",
    "Orion Multi-Purpose Crew Vehicle",
    "Space Launch System (SLS)",
    "Victor J. Glover"
  ],
  "image": null,
  "language": "en",
  "storagePath": "data/articles/science/2025/12/23/bf38326ab2c1392bfe31a76c370df9820f384616.json",
  "contentText": "4 Min Read\n\nArtemis II Flight Crew, Teams Conduct Demonstration Ahead of Launch\n\nNASA’s launch and mission teams, along with the Artemis II crew, completed a key test Dec. 20, a countdown demonstration test, ahead of the Artemis II flight around the Moon early next year. The astronauts, supported by launch and flight control teams, dressed in their launch and entry suits, boarded their spacecraft on top of its towering rocket at the agency’s Kennedy Space Center in Florida to validate their launch date timeline.\n\nWinding the clock down to a point just before liftoff, the rehearsal enabled NASA teams to practice the exact steps teams will take as they move toward launch of the test flight.\n\nThis test marks the passage of a key milestone on America’s journey to the launchpad. We have many more to go, but I’m encouraged by the expertise and precision demonstrated by our teams as we continue NASA’s ambitious lunar exploration legacy.\n\nJared Isaacman\n\nNASA Administrator\n\nWhile launch teams in the firing rooms of Kennedy’s Launch Control Center ran through procedures just as they would on launch day, the Artemis II crew members – NASA astronauts Reid Wiseman, Victor Glover, and Christina Koch, and CSA (Canadian Space Agency) astronaut Jeremy Hansen – donned their&nbsp; Orion crew survival system &nbsp;spacesuits in the Astronaut Crew Quarters inside Kennedy’s Neil A. Armstrong Operations and Checkout Building.\n\nFrom left, NASA astronauts Victor Glover, Artemis II pilot, and Reid Wiseman, Artemis II commander, undergo spacesuit checks inside the crew quarters suit-up room in the Neil A. Armstrong Operations and Checkout Building part of the countdown demonstration test at NASA Kennedy on Saturday, Dec. 20, 2025.\n\nNASA/Glenn Benson\n\nOnce suited, the crew made the same walk taken by Gemini, Apollo, space shuttle, and Commercial Crew Program astronauts launching from Florida’s Space Coast during the last six decades. Through the suit-up room, down the hallway, and after a quick ride on an elevator, the Artemis II crew exited the building through the double doors featuring dozens of human spaceflight mission patch stickers.\n\nThe Artemis astronaut van waited outside to take the crew members to their SLS (Space Launch System) rocket. On the actual launch day, the four astronauts will complete a 20-minute ride to Kennedy’s Launch Complex 39B ahead of liftoff. But, for the countdown test the destination was High Bay 3 of Kennedy’s Vehicle Assembly Building, where the Artemis II Moon rocket is undergoing final processing and checkouts before rolling out to the launch pad. A convoy of support vehicles, as well as Artemis II backup crew members, NASA astronaut Andre Douglas and CSA astronaut Jenni Gibbons, escorted the crew to its destination.\n\nFrom right to left, NASA astronauts Reid Wiseman, commander; Victor Glover, pilot; Christina Koch, mission specialist; and CSA (Canadian Space Agency) astronaut Jeremy Hansen, mission specialist are seen as they depart the Neil A. Armstrong Operations and Checkout Building to board their Orion spacecraft atop NASA’s Space Launch System rocket inside the Vehicle Assembly Building as part of the Artemis II countdown demonstration test, Saturday, Dec. 20, 2025, at NASA Kennedy.\n\nNASA/Aubrey Gemignani\n\nAfter a short trip to the building, the flight crew rode the mobile launcher’s elevator up nearly 300 feet to the crew access arm and the White Room, the enclosed area where the crew enters the spacecraft. The closeout crew, whose job it is to ensure the flight crew enters the spacecraft without issue, helped the astronauts enter Orion, which they have named Integrity . The closeout team assisted the astronauts by strapping them into their seats and closed the hatch once all closeout operations were completed. With the crew secured in Orion, teams conducted suit leak and communications checks, just as they will on launch day.\n\nArtemis II crewmembers CSA astronaut Jeremy Hansen, mission specialist, right, and NASA astronauts Victor Glover, pilot; Christina Koch, mission specialist; after exiting the elevator at the 275-foot level of the mobile launcher as they walk towards the crew access arm prepare to board their Orion spacecraft atop NASA’s Moon rocket during the Artemis II countdown demonstration test, Saturday, Dec. 20, 2025, inside the Vehicle Assembly Building at NASA Kennedy.\n\nNASA/Joel Kowsky\n\nThroughout the testing, teams ran through the final 5.5 hours of launch day procedures, completing the countdown test about 30 seconds before what will be the time of liftoff on launch day. As they may encounter on launch day, teams navigated through several real-time issues, including audio communications and environmental control and life support systems closeout activities during the test. All objectives were met, and the countdown demonstration provided a valuable opportunity to conduct operations in a day-of-launch configuration to minimize first-time learnings on launch day.\n\nCharlie Blackwell-Thompson, NASA&#8217;s Artemis launch director, monitors the progress of Artemis II countdown demonstration test with Artemis II crew members onboard their Orion spacecraft from Firing Room 1 of the Rocco A. Petrone Launch Control Center at NASA Kennedy on Saturday, Dec. 20.\n\nNASA/Glenn Benson\n\nAlthough Artemis II teams have performed parts of the launch countdown testing previously, this test was the first full end-to-end rundown with the crew and Orion in the launch configuration. The crew will participate in additional countdown testing after the rocket arrives to the launchpad, focusing on emergency operations.\n\nAs part of a Golden Age of innovation and exploration, the Artemis II test flight is the first crewed mission under NASA’s Artemis campaign. It is another step toward new U.S.-crewed missions on the Moon’s surface that will help the agency prepare to land American astronauts on Mars.\n\nAbout the Author\n\nJason Costa\n\nShare\n\n-\n\n-\n\n-\n\n-\n\nDetails\n\nLast Updated\n\nDec 23, 2025\n\nRelated Terms\n\n- Artemis 2\n\n- Andre Douglas\n\n- Christina H. Koch\n\n- Exploration Ground Systems\n\n- G. Reid Wiseman\n\n- Kennedy Space Center\n\n- Orion Multi-Purpose Crew Vehicle\n\n- Space Launch System (SLS)\n\n- Victor J. Glover\n\nExplore More\n\n3 min read\n\nGet In, We’re Going Moonbound: Meet NASA’s Artemis Closeout Crew\n\nArticle\n\n2 days ago\n\n3 min read\n\nI Am Artemis: Grace Lauderdale\n\nArticle\n\n2 days ago\n\n6 min read\n\nNASA Kennedy Top 20 Stories of 2025\n\nArticle\n\n3 days ago\n\nKeep Exploring\n\nDiscover More Topics From NASA\n\nMissions\n\nHumans in Space\n\nClimate Change\n\nSolar System",
  "contentSource": "content:encoded"
}
