{
  "id": "2df52f77afc93446dc6117519b8830875d7a20dd",
  "title": "Pixel 10 phones and Switch 2 games round out this week’s best deals",
  "summary": "Google’s Pixel 10 phones are some of the best Android phones on the market. If you’re taking it easy during the slow, in-between week between Christmas and New Year’s, now’s a good time to catch up on deals you might’ve missed. Many of our favorite discounts from the past week are still hanging around, making this an especially convenient moment to shop. Wh…",
  "canonicalUrl": "https://www.theverge.com/gadgets/850390/google-pixel-10-anker-laptop-power-bank-nintendo-switch-game-sale-deal-sale",
  "source": {
    "id": "theverge",
    "name": "The Verge",
    "url": "https://www.theverge.com/",
    "feedUrl": "https://www.theverge.com/rss/index.xml",
    "country": "US",
    "language": "en"
  },
  "publishedAt": "2025-12-27T16:07:03.000Z",
  "fetchedAt": "2025-12-27T16:27:46.366Z",
  "category": "tech",
  "tags": [],
  "image": "https://platform.theverge.com/wp-content/uploads/sites/2/2025/10/Google-Pixel-10-Lineup.jpg?quality=90&#038;strip=all&#038;crop=0,0,100,100",
  "language": "en",
  "storagePath": "data/articles/tech/2025/12/27/2df52f77afc93446dc6117519b8830875d7a20dd.json",
  "contentText": "Google’s Pixel 10 phones are some of the best Android phones on the market.\n\nIf you’re taking it easy during the slow, in-between week between Christmas and New Year’s, now’s a good time to catch up on deals you might’ve missed. Many of our favorite discounts from the past week are still hanging around, making this an especially convenient moment to shop. Whether you’re eyeing a new phone, gearing up for travel, or just looking to treat yourself before the year wraps up, we’re seeing notable price drops on Google’s Pixel 10 lineup , AirTags , and a wide selection of Nintendo Switch games , along with a handful of other Verge-approved picks worth grabbing now. Here are the best deals worth checking out before the year comes to a close.\n\nGoogle Pixel 10\n\nThis model touts a 6.3-inch 1080p OLED that supports up to a 120Hz refresh rate. It has the same Tensor G5 processor found in all Pixel 10-series phones, but with a slightly lower 12GB RAM count compared to 16GB on the Pro. Verge reviewer Allison Johnson notes in her review that those who want to take great — not just good — photos should get the 10 Pro instead.\n\nWhere to Buy:\n\n- $799 $499 at Amazon (with code PIXEL10)\n\n- $799 $499 at Best Buy\n\n- $799 $599 at Google\n\nGoogle Pixel 10 Pro\n\nIn addition to have extra memory for handling tasks more swiftly than the Pixel 10, its cameras pack improvements, both in terms of hardware and AI-enhanced software, like the sometimes great, sometimes terrible Pro Res Zoom mode that’s powered by generative AI. Its portrait mode is improved, according to our review .\n\nWhere to Buy:\n\n- $999 $649 at Amazon (with code PIXEL10)\n\n- $999 $649 at Best Buy\n\n- $999 $749 at Google Store\n\nGoogle Pixel 10 Pro XL (256GB)\n\nThe Pixel 10 Pro XL is the larger version of Google’s flagship, with a 6.8-inch OLED screen, Google&#8217;s Tensor G5 chip, and support for Pixelsnap wireless charging at up to 25W.\n\nWhere to Buy:\n\n- $1399 $799 at Amazon (with code PIXEL10)\n\n- $1199 $799 at Best Buy\n\n- $1199 $899 at Google\n\nGoogle’s Pixel 10 phones are among the best Android phones &nbsp; you can buy, and this week they’ve dropped to some of their lowest prices yet. Amazon is selling the Pixel 10 for $499 ($300 off) with promo code PIXEL10, marking its second-best price to date. If you want better&nbsp; cameras, Amazon is also offering record-low prices on the Pixel 10 Pro and 6.8-inch Pixel 10 Pro XL , down to $649 ($350 off) and $799 ($400 off), respectively, with the same code.\n\nAll three phones support Qi2 wireless charging with built-in magnets and run on Google’s snappy Tensor G5 chip. In her review , The Verge’s Allison Johnson called the Pixel 10 a great, basic Android phone with meaningful upgrades, including a bright 6.3-inch OLED display with a 120Hz refresh rate and up to 3,000 nits of peak brightness. It also adds a dedicated telephoto lens — a first for a non-Pro Pixel — which makes a noticeable difference for portraits.\n\nIf you’re aiming for great (not just good) photos, though, the 6.3-inch Pixel 10 Pro or 6.8-inch Pro XL are better picks. Both offer improved main and 48-megapixel ultrawide cameras, and additional AI-powered features like Pro Res Zoom and an upgraded portrait mode. They also come with extra memory for smoother multitasking along with sharper displays.\n\nRead our Pixel 10 review .\n\nAnker Laptop Power Bank\n\nAnker’s 25,000mAh power bank sports two built-in USB-C cables (one of which is retractable), plus one USB-C and USB-A port. It tops out at 165W when charging two devices simultaneously, or 130W when charging three or four.\n\nWhere to Buy:\n\n- $119.99 $87.99 at Amazon\n\n- $119.99 $87.99 at Walmart\n\nAnker’s Laptop Power Bank is once again on sale at Amazon and Walmart for $87.99 ($47 off), which matches the record-low price we last saw a month ago. A favorite among Verge staffers , the 25,000mAh / 90Wh power bank features a retractable USB-C cable along with a second built-in USB-C cable that doubles as a handle for easier portability. You also get a handy LCD screen that shows remaining battery life, total power output, and temperature at a glance. It includes a USB-A port and an extra USB-C port as well, letting you charge a MacBook Pro and up to three other devices at the same time. Power output tops out at 165W when charging two devices, or up to 130W with more plugged in — and since it’s carry-on compliant, you can bring the power bank along on flights.\n\nCyberpunk 2077: Ultimate Edition\n\nCD Projekt Red has delivered on an incredibly ambitious vision: a vast virtual city with a complex narrative and roleplaying system. Read our review.\n\nWhere to Buy:\n\n- $69.99 $39.99 at Nintendo\n\nSuper Mario Odyssey\n\nThe first mainline Mario  title for the Nintendo Switch,  Super Mario Odyssey,  doesn’t disappoint. The game brings plenty of fun, new mechanics, and ample charm. Read our review.\n\nWhere to Buy:\n\n- $59.99 $39.99 at Nintendo\n\n- $59.99 $39.99 at Amazon\n\nThe Legend of Zelda: Echoes of Wisdom\n\nEchoes of Wisdom finally lets you play as Nintendo’s titular heroine. The game mixes the top-down perspective of 2D Zelda games with gameplay from the series’ newer, open-world 3D entries. Read our review .\n\nWhere to Buy:\n\n- $59.99 $41.99 at Nintendo\n\n- $59.99 $49.73 at Amazon\n\nIf you’re looking to stock up on Nintendo Switch games, now’s a great time to do it. Nintendo is currently taking up to 50 percent off some of its best-known titles . That includes a number of &nbsp; first-party Nintendo games like Super Mario Odyssey ($39.99 down from $59.99), along with Princess Peach: Showtime ($41.99 down from $59.99) and The Legend of Zelda, Echoes of Wisdom (also $41.99 down from $59.99).\n\nThe deals aren’t limited to Nintendo’s own catalog, either. A number of well-known third-party games are included as well, from popular releases like Cyberpunk 2077: Ultimate Edition ($39.99 down from $69.99)&nbsp; to game of the year contenders such as Hades 2 ($22.49, down from $29.99) and Hollow Knight: Silksong ($15.99, down from $19.99) . Just mark your calendar — most of these deals run through January 4th.\n\nA few more deals we’re digging:\n\n- Right now, you can buy a single AirTag for $19 ($10 off) at Amazon , which is about $1 shy of its best price to date. We strongly recommend Apple’s Bluetooth tracker for iPhone owners , largely because it taps into Apple’s wide Find My network for reliable out-of-range tracking, with built-in UWB delivering an impressive level of precision. You can also share an AirTag’s location with up to five people or, in some cases, participating airlines. Read our review.\n\n- The Twelve South AirFly Pro 2 Bluetooth transmitter / receiver is on sale for $49.99 ($10 off) at Amazon and Best Buy , which is its second-best price to date. The adapter adds Bluetooth support to any device with a 3.5mm headphone jack, whether you’re listening to in-flight entertainment or using older gym equipment and cars that lack built-in Bluetooth. You can even connect up to two sets of headphones or earbuds at once, making it a great option for watching a movie or listening to a playlist with a travel companion.\n\n- If you missed out on Amazon’s Echo device sale, the retailer recently launched a new winter sale that basically is a continuation of its holiday sale.&nbsp; For example, you can still pick up the Amazon Echo Spot for $44.99 ($35 off) at Amazon and Best Buy . That matches the lowest price we’ve seen so far on the&nbsp; bedside smart speaker and alarm clock, which comes with a small display for checking things like the weather at a glance. Read our review.",
  "contentSource": "content"
}
