{
  "id": "4d5a85936531faa82e8d49924ae91dab0da9b841",
  "title": "WHO Global Summit charts a bold future for traditional medicine",
  "summary": "The second WHO Global Summit on Traditional Medicine, jointly organized with the Government of India, concluded today in New Delhi, marking a major milestone for global health as it drew over 16 000 online registrations and brought together 800 delegates from more than 100 countries, including ministers from over 20 nations. Combined with a strong line up o…",
  "canonicalUrl": "https://www.who.int/news/item/22-12-2025-who-global-summit-charts-a-bold-future-for-traditional-medicine",
  "source": {
    "id": "who_news",
    "name": "World Health Organization - News (EN)",
    "url": "https://www.who.int/news",
    "feedUrl": "https://www.who.int/rss-feeds/news-english.xml",
    "country": "UN",
    "language": "en"
  },
  "publishedAt": "2025-12-22T17:50:16.000Z",
  "fetchedAt": "2025-12-24T00:05:45.493Z",
  "category": "health",
  "tags": [],
  "image": null,
  "language": "en",
  "storagePath": "data/articles/health/2025/12/22/4d5a85936531faa82e8d49924ae91dab0da9b841.json",
  "contentText": "The second WHO Global Summit on Traditional Medicine, jointly organized with the&nbsp;Government&nbsp;of India,&nbsp;concluded today in New Delhi, marking a major milestone for global health as it drew over 16 000 online registrations and brought together 800 delegates from more than 100 countries, including ministers from over 20 nations.&nbsp;Combined&nbsp;with&nbsp;a strong line up of&nbsp;160 speakers, the global traditional medicine community&nbsp;shared&nbsp;insights on how&nbsp;traditional medicine (TM)&nbsp;can strengthen health systems&nbsp;with&nbsp;more&nbsp;safe, evidence-based, and affordable care.&nbsp;\n\nThe energy in Delhi was palpable as ministers, scientists, Indigenous leaders, and practitioners came together to advance the&nbsp; WHO Global Traditional Medicine Strategy 2025&ndash;2034 . The Summit was not just about dialogue&nbsp;&ndash;&nbsp;it was about action. WHO unveiled the&nbsp; Traditional Medicine Global Library , a first-of-its-kind digital platform&nbsp;consolidating&nbsp;1.6 million resources&nbsp;on&nbsp;TM, from scientific studies to Indigenous knowledge. With advanced features like&nbsp;Evidence Gap Maps&nbsp;and an AI-powered tool, TMGL GPT, the Library promises to transform access to trusted information and accelerate research worldwide.&nbsp;\n\nInnovation took&nbsp;centre&nbsp;stage with the launch of&nbsp;Health & Heritage Innovations (H2I), an initiative to nurture breakthrough ideas that bridge traditional practices with&nbsp;cutting-edge&nbsp;technologies such as AI, genomics, and digital health. From over&nbsp;1000 submissions,&nbsp;21 finalists&nbsp;were announced at the Summit and will enter a year-long acceleration&nbsp;programme&nbsp;to refine prototypes, receive scientific and regulatory guidance, and connect with&nbsp;policy-makers&nbsp;and investors.&nbsp;\n\nWHO also announced the&nbsp; Strategic and Technical Advisory Group on Traditional, Complementary and Integrative Medicine (STAG-TM) , a new advisory body to guide the Global&nbsp;Strategy. Comprised of&nbsp;19 independent experts, STAG-TM will shape research priorities, develop standards, and advise on integration into health systems. At its inaugural meeting during the Summit, the group set urgent priorities:&nbsp;evidence&nbsp;generation, preservation of traditional knowledge, digital innovation, and capacity building.&nbsp;\n\nCountries rallied behind the&nbsp; Delhi&nbsp;Declaration ,&nbsp;with&nbsp; commitments from 26 Member States ,&nbsp;signaling a new era for traditional medicine. This collective pledge focuses on integrating traditional medicine into primary health care, strengthening regulation and safety standards, investing in research, and building interoperable data systems to track outcomes.&nbsp;It&rsquo;s&nbsp;a shift from recognition to results&nbsp;&ndash;&nbsp;ensuring traditional medicine is not a parallel system but a driver of universal health coverage.&nbsp;\n\n&ldquo;Through the Delhi Commitment, countries have agreed not only on why traditional medicine matters&nbsp;&ndash;&nbsp;but on how to act,&rdquo; said&nbsp;Dr Tedros Adhanom Ghebreyesus, WHO Director-General. &ldquo;Traditional medicine can help to address many of the threats to&nbsp;health&nbsp;of our modern world: the growing burden of noncommunicable diseases; inequitable access to health services; and climate change. It can help to support care that is person-centred, culturally grounded, and holistic.&rdquo;&nbsp;\n\nLooking ahead, WHO will work with Member States to turn these commitments into reality&ndash;&nbsp;scaling access to trusted knowledge, accelerating innovation, and embedding&nbsp;TM&nbsp;into health systems everywhere. The Global Traditional Medicine Strategy 2025&ndash;2034 charts a bold course toward a future where care is more inclusive, culturally grounded, and resilient.&nbsp;",
  "contentSource": "content"
}
