{
  "id": "74d79dce3aadc02db567a1b63fc6ac82b886604e",
  "title": "Holidays in Space: 25 Years of Space Station Celebrations",
  "summary": "In the quarter century that humans have lived and worked aboard the International Space Station, astronauts and visitors from around the world have celebrated countless holidays more than 250 miles above Earth while traveling 17,500 miles per hour. Crews have marked Thanksgiving, Christmas and Hanukkah, New Year’s, birthdays, and national holidays as they c…",
  "canonicalUrl": "https://www.nasa.gov/centers-and-facilities/johnson/nasa-johnson-celebrates-25-years-of-holidays-in-space",
  "source": {
    "id": "nasa_release",
    "name": "NASA - News Releases",
    "url": "https://www.nasa.gov/",
    "feedUrl": "https://www.nasa.gov/news-release/feed/",
    "country": "US",
    "language": "en"
  },
  "publishedAt": "2025-12-22T22:09:47.000Z",
  "fetchedAt": "2025-12-24T00:05:42.850Z",
  "category": "science",
  "tags": [
    "Johnson Space Center",
    "Humans in Space",
    "International Space Station (ISS)"
  ],
  "image": "https://www.youtube.com/embed/F4rldqgCaHE",
  "language": "en",
  "storagePath": "data/articles/science/2025/12/22/74d79dce3aadc02db567a1b63fc6ac82b886604e.json",
  "contentText": "In the quarter century that humans have lived and worked aboard the International Space Station, astronauts and visitors from around the world have celebrated countless holidays more than 250 miles above Earth while traveling 17,500 miles per hour. Crews have marked Thanksgiving, Christmas and Hanukkah, New Year’s, birthdays, and national holidays as they circle the planet every 90 minutes.&nbsp;&nbsp;\n\nHoliday traditions in space often look familiar, just adapted for microgravity. NASA astronauts share special meals packed by the Space Food Systems Laboratory at the agency’s Johnson Space Center in Houston, where crews select their menus with help from nutritionists and food scientists before launch. Cargo launches arriving before special occasions often deliver Holiday Bulk Overwrapped Bags filled with foods like clams, oysters, turkey, green beans, and smoked salmon, along with shelf-stable treats such as candies, icing, almond butter, and hummus.&nbsp;\n\nCrew members exchange small gifts that float through the modules, add festive decorations around the station, and connect with loved ones through video calls. Astronauts also send holiday greetings to Earth, a reminder that even in space, home is never far away.&nbsp;\n\nThe Expedition 73 crew share a holiday message aboard the International Space Station in Dec. 2025.\n\nEnjoy 25 years of celebrations below.&nbsp;\n\nNASA astronauts Nick Hague and Suni Williams, Expedition 72 flight engineer and commander, share snacks and goodies on Christmas Eve in 2024 inside the gallery of the space station&#8217;s Unity module.\n\nNASA\n\nFour Expedition 70 crewmates join each other inside the space station&#8217;s Unity module for a Christmas Day meal in Dec. 2023. From left are, Flight Engineer Koichi Wakata from JAXA (Japan Aerospace Exploration Agency); Commander Andreas Mogensen from ESA (European Space Agency); and NASA Flight Engineers Loral O&#8217;Hara and Jasmin Moghbeli.\n\nNASA\n\nESA astronaut Samantha Cristoforetti pictured aboard the space station on Dec. 20, 2014, during Expedition 42.\n\nNASA\n\nExpedition 4 crew members, former NASA astronauts Daniel Bursch and Carl Walz, along with Roscosmos cosmonaut Yuri Onufriyenko, pose for a Christmas photo in Dec. 2001.\n\nNASA\n\nThe Expedition 64 crew celebrate Christmas in 2019 with a brunch inside the space station&#8217;s Unity module decorated with stockings, flashlight &#8220;candles&#8221; and a Christmas tree banner. Clockwise from bottom left are, NASA Flight Engineers Jessica Meir and Christina Koch, Roscosmos Flight Engineers Oleg Skripochka and Alexander Skvortsov, NASA Flight Engineer Drew Morgan, and Commander Luca Parmitano of ESA.\n\nExpedition 13 crew members, Roscosmos cosmonaut Valery I. Tokarev, left, and former NASA astronaut William McArthur, pose with Christmas stockings in Dec. 2005.\n\nNASA\n\nThe six Expedition 30 crew members assemble in the U.S. Destiny laboratory aboard the space station for a Christmas celebration in Dec. 2011.\n\nNASA\n\nFour Expedition 70 crewmates join each other inside the space station&#8217;s Unity module for Christmas Eve festivities in 2023. From left are, NASA Flight Engineers Jasmin Moghbeli and Loral O&#8217;Hara; Flight Engineer Koichi Wakata from JAXA; and Commander Andreas Mogensen from ESA.\n\nNASA\n\nExpedition 22 crew members celebrate the holidays aboard the orbital outpost in Dec. 2009. In the front row are former NASA astronaut Jeffrey Williams, commander (right), and Russian cosmonaut Maxim Suraev, flight engineer. In the back row, from left, are Russian cosmonaut Oleg Kotov, former NASA astronaut T.J. Creamer, and JAXA astronaut Soichi Noguchi, all flight engineers.\n\nNASA\n\nExpedition 50 crew members celebrate the holidays aboard the orbiting laboratory in Dec. 2016.\n\nNASA\n\nNASA astronauts Don Pettit and Suni Williams, Expedition 72 flight engineer and commander, pose for a fun holiday season portrait while speaking on a ham radio inside the space station&#8217;s Columbus laboratory module.\n\nNASA\n\nNASA astronaut and Expedition 72 Commander Suni Williams shows off a holiday decoration of a familiar reindeer aboard the space station on Dec. 16, 2024. The decoration was crafted with excess hardware, cargo bags, and recently-delivered Santa hats.\n\nNASA\n\nThe space station remains a vital scientific platform, providing the foundation needed to survive and thrive as humanity ventures into the unexplored territories of our universe.\n\nLearn more about the space station’s 25 years of continuous human presence and explore stories, images, and research at:\n\nhttps://www.nasa.gov/international-space-station/iss25\n\nExplore More\n\n3 min read\n\nGet In, We’re Going Moonbound: Meet NASA’s Artemis Closeout Crew\n\nArticle\n\n2 days ago\n\n4 min read\n\nArtemis II Flight Crew, Teams Conduct Demonstration Ahead of Launch\n\nArticle\n\n2 days ago\n\n6 min read\n\nNASA Kennedy Top 20 Stories of 2025\n\nArticle\n\n3 days ago",
  "contentSource": "content:encoded"
}
