{
  "id": "078707fcd26a1c21d907fd6c86204f0219ea053b",
  "title": "Justin Bieber Criticizes Music Industry in Spiritual Christmas Eve Post: ‘I’m Not a Product’",
  "summary": "\"I don't want revenge,\" the singer wrote. \"I want redemption.\"",
  "canonicalUrl": "https://www.billboard.com/music/music-news/justin-bieber-criticizes-music-industry-not-a-product-1236145762",
  "source": {
    "id": "billboard",
    "name": "Billboard",
    "url": "https://www.billboard.com/",
    "feedUrl": "https://www.billboard.com/feed/",
    "country": "US",
    "language": "en"
  },
  "publishedAt": "2025-12-26T17:42:20.000Z",
  "fetchedAt": "2025-12-26T18:33:07.222Z",
  "category": "entertainment",
  "tags": [
    "Music",
    "Music News",
    "genre pop"
  ],
  "image": "https://www.billboard.com/wp-content/uploads/2025/02/kendrick-lamar-Apple-Music-Super-Bowl-LIX-Halftime-Show-billboard-1548.jpg?w=237&#038;h=147&#038;crop=1",
  "language": "en",
  "storagePath": "data/articles/entertainment/2025/12/26/078707fcd26a1c21d907fd6c86204f0219ea053b.json",
  "contentText": "Justin Bieber took a moment this Christmas Eve to reflect on his spiritual and professional journey through the music industry, reminding his fans and followers, &#8220;I am not a product.&#8221;\n\nRelated\n\nThe Top 10 Wildest Music Moments That Defined Pop Culture in&nbsp;2025\n\nJustin Bieber Tries to Be the Real Slim Shady & Shows Off Rap Skills With Speedy Eminem&nbsp;Cover\n\nLorde Says Justin Bieber&#8217;s &#8216;Daisies&#8217; Was Her 2025 Song of the Summer: &#8216;It Ticked All the Boxes for&nbsp;Me&#8217;\n\nIn a post on Instagram on Wednesday (Dec. 24), the pop star shared snippets of Bible verses interspersed with his own thoughts about overcoming painful memories in his career. &#8220;I&#8217;m not speaking as a victim still bleeding &#8212; I&#8217;m speaking as someone restored,&#8221; Bieber wrote.\n\n&#8220;I don&#8217;t want revenge. I want redemption,&#8221; he continued. &#8220;I&#8217;m not a product. I&#8217;m not what the industry demanded. I&#8217;m a son.&#8221;\n\nClarifying that he doesn&#8217;t &#8220;want to burn the music industry down,&#8221; the singer added, &#8220;I want to see it made new &#8212; safer, more honest, more human.&#8221;\n\nJustin later shared a selfie in front of a fireplace lined with Christmas stockings, as well as a photo of himself and his wife, Rhode founder Hailey Bieber, bundled up in winter gear. &#8220;MERRY CHRISTMAS FROM THE BIEBERS,&#8221; he wrote in the caption.\n\nThe Grammy winner has previously expressed his faith online, as well as his issues with certain facets of fame. Earlier this year, he called out the relentlessness of some paparazzi with posts on Instagram, writing in April, &#8220;Everyone telling me to move &#8230; U think I’m gonna get bullied to leave where my influence is most needed? How can we make a change if we run away from the darkness?&#8221;\n\nIn July, Justin thanked Jesus for having &#8220;patience&#8221; with him. “I can be extremely selfish and impatient yet Jesus always has his arms open toward me,&#8221; he added at the time.\n\nThis year has also seen the musician release two albums, Swag and Swag II . The former reached No. 2 on the Billboard 200 and set Justin up to headline Coachella in 2026 alongside Sabrina Carpenter and Karol G, a gig for which he&#8217;s been hard at work preparing in his very own warehouse rehearsal and Twitch livestreaming space.\n\nSee Bieber&#8217;s post below.\n\nView this post on Instagram",
  "contentSource": "content:encoded"
}
