{
  "id": "0d9e267837e7dce1235dab5b90b9ce22bf66a715",
  "title": "All the 2025 Billboard Latin Artists on the Rise: CA7RIEL & Paco Amoroso, Netón Vega, Beéle & More",
  "summary": "A wide-ranging group of 12 up-and-coming Latin artists were featured this year.",
  "canonicalUrl": "https://www.billboard.com/lists/billboard-latin-artists-on-the-rise-2025",
  "source": {
    "id": "billboard",
    "name": "Billboard",
    "url": "https://www.billboard.com/",
    "feedUrl": "https://www.billboard.com/feed/",
    "country": "US",
    "language": "en"
  },
  "publishedAt": "2025-12-26T21:35:02.000Z",
  "fetchedAt": "2025-12-26T22:22:34.617Z",
  "category": "entertainment",
  "tags": [
    "Latin",
    "Music",
    "genre latin"
  ],
  "image": null,
  "language": "en",
  "storagePath": "data/articles/entertainment/2025/12/26/0d9e267837e7dce1235dab5b90b9ce22bf66a715.json",
  "contentText": "Over the past year, Billboard &#8216;s Latin Artist on the Rise series has spotlighted a curated group of artists who achieved breakthroughs within or beyond their genre, reached notable chart milestones, and/or generated undeniable buzz.\n\nThis series has long highlighted artists on the verge of stardom — much like we spotlighted Peso Pluma in March 2023 or Xavi in January 2024 , just before their global breakthroughs — and this year has been no different.\n\nRegional Mexican hitmaker Netón Vega was February&#8217;s Latin Artist of the Rise of 2025, and it’s safe to say he went on to have an extraordinary year. The Baja California Sur singer-songwriter earned the title of new artist of the year at the 2025 Billboard Latin Music Awards and dropped two albums this year, his debut  Mi Vida Mi Muerte  in February and Delirium last month. Furthermore, he scored the No. 1 spot on  Billboard ‘s New Latin Artists of 2025 list .\n\nArgentine duo CA7RIEL & Paco Amoroso were April’s Latin Artist on the Rise since skyrocketing to stardom ever since their NPR Tiny Desk performance. They embarked on a 60-date world tour, which included stops in global festivals like Coachella (U.S.), Fuji Rock (Japan), Glastonbury (England), Roskilde (Denmark), and Lollapalooza (Berlin, Paris). And they won five Latin Grammys this year, including best alternative music album ( Papota ), best pop song (“El Día Del Amigo”), and best alternative song (“#Tetas”).\n\nOther acts that were part of our Latin Artist on the Rise series this year were Beéle, Yailin La Más Viral, Bebeshito and, most recently, Milo J. Below, we showcase all 12 artists featured throughout 2025.",
  "contentSource": "content:encoded"
}
