{
  "id": "0f576209cf7e8aaaa6cda486875ae2f20ac441a5",
  "title": "Taylor Swift Supports an Emotional Travis Kelce at His Last Chiefs Home Game of the Season",
  "summary": "If the tight end retires after this season, the game will also mark his last time playing at Arrowhead.",
  "canonicalUrl": "https://www.billboard.com/music/music-news/taylor-swift-supports-travis-kelce-christmas-chiefs-game-1236145689",
  "source": {
    "id": "billboard",
    "name": "Billboard",
    "url": "https://www.billboard.com/",
    "feedUrl": "https://www.billboard.com/feed/",
    "country": "US",
    "language": "en"
  },
  "publishedAt": "2025-12-26T16:01:39.000Z",
  "fetchedAt": "2025-12-26T16:27:38.960Z",
  "category": "entertainment",
  "tags": [
    "Music",
    "Music News",
    "genre pop",
    "lifestyle",
    "sports"
  ],
  "image": "https://www.billboard.com/wp-content/uploads/2025/12/Stephen-A-Smith-hope-global-2025-billboard-1800.jpg?w=237&#038;h=147&#038;crop=1",
  "language": "en",
  "storagePath": "data/articles/entertainment/2025/12/26/0f576209cf7e8aaaa6cda486875ae2f20ac441a5.json",
  "contentText": "This year, Taylor Swift spent her Christmas at Arrowhead Stadium, where fiancé Travis Kelce played his final Kansas City Chiefs home game of the NFL season.\n\nRelated\n\nStephen A. Smith Thinks Travis Kelce Will Retire in 2026 to Be With Taylor Swift: &#8216;Now Would Be the&nbsp;Time&#8217;\n\nTaylor Swift Joined in Skybox By BFF Selena Gomez For First Time to Cheer on Fiancé Travis Kelce As Chiefs Season on&nbsp;Brink\n\nTravis Kelce Says He & Taylor Swift Have &#8216;Never Once&#8217; Argued in 2.5 Years of&nbsp;Dating\n\nShowing up in her signature red lip and a matching bomber jacket alongside her parents, the pop star was all smiles as she entered the venue, as captured in clips posted online by the NFL. She hunkered down in her usual suite at Arrowhead Stadium to watch the tight end and his team play against the Denver Broncos, who ended up winning 20-13.\n\nKelce was visibly emotional during the national anthem, rocking back and forth with his hand over his chest. He was also clearly fired up as he first entered the field, striking his signature archer pose at the center of flashing lights, smoke and thunderous applause.\n\nThe Christmas Day matchup marked the Chiefs&#8217; penultimate game of the 2025-26 season, with the team this year missing the playoffs for the first time since 2014 after quarterback Patrick Mahomes suffered an ACL injury earlier in December. Their last game will be against the Las Vegas Raiders at Allegiant Stadium in Sin City on a soon-to-be-scheduled date.\n\nBut the Chiefs&#8217; final home game might have had even more significance for Kelce. Throughout this year, the Grotesquerie star has faced much speculation about whether he will retire after this season, something he has not yet confirmed or denied.\n\nHe did, however, address the possibility after the Broncos face-off, according to ESPN . &#8220;I&#8217;ll let that be a decision I&#8217;ll make with my family, friends, the Chiefs organization when the time comes,&#8221; he reportedly said, adding that he was feeling &#8220;a whole lot of emotions.&#8221;",
  "contentSource": "content:encoded"
}
