{
  "id": "14011375c36f12b1f1197f4120a84e261cc9e8c3",
  "title": "Mariah Carey Gets $92,000 Refund After Beating ‘All I Want for Christmas Is You’ Lawsuit",
  "summary": "The ruling comes during the hit song’s record-extending 21st week atop the Billboard Hot 100.",
  "canonicalUrl": "https://www.billboard.com/pro/mariah-carey-wins-refund-fees-christmas-lawsuit",
  "source": {
    "id": "billboard",
    "name": "Billboard",
    "url": "https://www.billboard.com/",
    "feedUrl": "https://www.billboard.com/feed/",
    "country": "US",
    "language": "en"
  },
  "publishedAt": "2025-12-26T19:21:55.000Z",
  "fetchedAt": "2025-12-26T20:24:37.282Z",
  "category": "entertainment",
  "tags": [
    "Business",
    "Legal News",
    "all i want for Christmas is you",
    "genre pop",
    "holiday music",
    "lawsuit",
    "Legal"
  ],
  "image": "https://www.billboard.com/wp-content/uploads/2025/12/YE-PRO-2025-Legal-hero-billboard-1800.jpg?w=237&#038;h=147&#038;crop=1",
  "language": "en",
  "storagePath": "data/articles/entertainment/2025/12/26/14011375c36f12b1f1197f4120a84e261cc9e8c3.json",
  "contentText": "Mariah Carey’s “All I Want for Christmas Is You” smashed Billboard chart records this holiday season – and now, the pop star is getting a refund for her copyright battle over the hit song.\n\nBack in March, a federal judge dismissed a lawsuit that alleged “All I Want for Christmas” infringed songwriter Vince Vance’s 1989 song of the same name. The court held that the two tracks shared only holiday clichés and ordered Vance’s attorney, Gerard Fox , to repay Carey’s legal fees as a sanction for filing “frivolous” arguments.\n\nRelated\n\nThe 10 Biggest Music Law Stories of 2025: AI, Diddy, Drake, Mariah Carey &&nbsp;More\n\nDiddy Seeks Immediate Release From Prison in Appeals Argument\n\nBig Sean Named Creative Director of Global Experience for Detroit Pistons\n\nAfter months of back and forth on what this sum should be, Judge Mónica Ramírez&nbsp;Almadani ruled on Tuesday (Dec. 23) that Fox must pay Carey $92,000 for 154 hours of work by her lawyers from the entertainment powerhouse Davis Wright Tremaine.\n\nThe judge also ordered Fox to cover $15,000 in fees paid to Sony Music’s attorneys at Pryor Cashman; $2,000 for Kobalt’s legal team at Kendall Brill & Kelly; and $1,000 to Kenneth Freundlich, who represents Carey’s “All I Want for Christmas” co-writer Walter Afanasieff.\n\n“[This] amount is proportional to the clear need for deterrence and punishment in this case,” wrote Judge Almadani. “Fox has been given many opportunities to engage fairly in this litigation, but he has failed to do so and must now face the consequences.”\n\nThe total fee award of $110,000 is less than the $186,000 in combined fees sought by Carey, Afanasieff, Sony and Kobalt. Judge Almadani deducted billing entries that she said were “excessive,” “unnecessary” or rooted in “clerical or secretarial tasks.”\n\nRelated\n\nYear-End Roundup: The Biggest Music Business Stories of 2025 (And a Look Ahead to&nbsp;2026)\n\nFox did not immediately return a request for comment on Friday (Dec. 26), nor did the lawyers for Carey, Afanasieff, Sony and Kobalt.\n\nTuesday’s ruling officially wraps up the litigation over “All I Want for Christmas,” which debuted in 1994 and ballooned in popularity over the last decade. The song has retaken the top spot on the Billboard Hot 100 every holiday season since 2019, hitting No. 1 for a record-breaking 20th week on last week’s chart.\n\nCarey continued to make history with “All I Want for Christmas” this week, achieving a record-extending 21st week atop the Hot 100 on Monday (Dec. 22). The song also surpassed Dua Lipa’s “Levitating” as the longest-charted title ever by a female artist, and Carey herself claimed a milestone 100th career week at No. 1.",
  "contentSource": "content:encoded"
}
