{
  "id": "271895cfafcc478aed5ae96f2dd9ea6d66ac6a93",
  "title": "This Disney Store Princess Shirt References a Fan-Fave Taylor Swift Track",
  "summary": "The shirt is pretty in pink and comes in a slew of sizes for women.",
  "canonicalUrl": "https://www.billboard.com/culture/product-recommendations/disney-taylor-swift-today-was-a-fairytale-t-shirt-1236145673",
  "source": {
    "id": "billboard",
    "name": "Billboard",
    "url": "https://www.billboard.com/",
    "feedUrl": "https://www.billboard.com/feed/",
    "country": "US",
    "language": "en"
  },
  "publishedAt": "2025-12-26T16:40:37.000Z",
  "fetchedAt": "2025-12-26T17:19:56.312Z",
  "category": "entertainment",
  "tags": [
    "Culture",
    "Product Recommendations",
    "disney",
    "fashion"
  ],
  "image": "https://www.billboard.com/wp-content/uploads/2025/12/billboard-disney-store-t-shirt-taylor-swift.jpg?w=942&#038;h=623&#038;crop=1",
  "language": "en",
  "storagePath": "data/articles/entertainment/2025/12/26/271895cfafcc478aed5ae96f2dd9ea6d66ac6a93.json",
  "contentText": "All products and services featured are independently chosen by editors. However, Billboard may receive a commission on orders placed through its retail links, and the retailer may receive certain auditable data for accounting purposes.\n\nIs your T-shirt collection lacking a little Swiftie flair? If you&#8217;re both a Swiftie and a Disney fan, the Disney Store just dropped a women&#8217;s tee in a dreamy pink that makes reference to a fan-favorite Taylor Swift track , 2010&#8217;s &#8220;Today Was a Fairytale.&#8221; The graphic tee, retailing for $32.99 , features that exact wording affixed to the front in black with dainty bow detailing, contrasting the pink background, accompanied by a graphic on the back featuring a few favorite Disney Princess. There&#8217;s Tiana, Cinderella, Aurora, Belle and Jasmine all smiles with sparkle graphics around them.\n\nThis tee is made of a comfy and breathable jersey knit in an oversized fit. The neckline is a ribbed style that transitions into dropped shoulders and a high-low hem, offering the otherwise basic tee a stylistic flair. Sizing for the tee is currently available from XS to 3XL. To style, we&#8217;d recommend wearing solo with a skirt or layered over a long sleeve or under a jean jacket. The style meshes two of the world&#8217;s most loyal fandoms &#8212; Swift and Disney.\n\nDisney Princess \"Today Was a Fairytale\" T-Shirt for Women\n\n$32.99\n\nBuy Now at disney store\n\nA women&#8217;s pink T-shirt from the Disney Store.\n\nThe Disney Store has a slew of stylish tees available to shop on the website, giving fans fashion-forward merch at an affordable price tag. If your wardrobe is lacking whimsey, this tee is an easy way to introduce color into your wardrobe, since the pink hue is gentle on the eyes and goes with just about everything.\n\nSwift&#8217;s track &#8220;Today Was a Fairytale&#8221; was released in 2010 for the film Valentine&#8217;s Day, starring Julia Roberts, Jessica Biel, Anne Hathaway and Bradley Cooper, among others. The track is a mix of country and pop, and makes reference to a picture-perfect date Swift went on, whether real or fake. While the song is about 15 years old, it still holds up, still making waves with fans to this day.\n\nThis isn&#8217;t the only track of Swift&#8217;s that the star offered to use in the film. The Valentine&#8217;s Day soundtrack also features the song &#8220;Jump Then Fall.&#8221; The film soundtrack also features songs from other hit artists, including Maroon 5, Jewel, Stevie Wonder, Jamiroquai, Willie Nelson, Will.i.am, Foreigner, Nat &#8220;King&#8221; Cole and Jamie Foxx. The soundtrack peaked at No. 20 on the Billboard 200, while on Billboard&#8217;s Top Soundtracks charts, it reached No. 2.",
  "contentSource": "content:encoded"
}
