{
  "id": "37b05b04727ac4a81c2b423795b49d7b4ceb65b2",
  "title": "Cardi B Jokes ‘Perfect Christmas Picture Don’t Exist in This House’ as She Celebrates With Her 4 Kids",
  "summary": "Her boyfriend Stefon Diggs left a cute message on her post.",
  "canonicalUrl": "https://www.billboard.com/music/rb-hip-hop/cardi-b-perfect-christmas-picture-doesnt-exist-4-kids-1236145736",
  "source": {
    "id": "billboard",
    "name": "Billboard",
    "url": "https://www.billboard.com/",
    "feedUrl": "https://www.billboard.com/feed/",
    "country": "US",
    "language": "en"
  },
  "publishedAt": "2025-12-26T17:21:01.000Z",
  "fetchedAt": "2025-12-26T18:33:07.222Z",
  "category": "entertainment",
  "tags": [
    "Music",
    "R&B/Hip-Hop",
    "genre hiphop",
    "Music News"
  ],
  "image": "https://www.billboard.com/wp-content/uploads/2025/12/YE25-Rap-Albums-hero-2025-billboard-1800.jpg?w=237&#038;h=147&#038;crop=1",
  "language": "en",
  "storagePath": "data/articles/entertainment/2025/12/26/37b05b04727ac4a81c2b423795b49d7b4ceb65b2.json",
  "contentText": "Cardi Claus brought the holiday cheer on Thursday (Dec. 25), as Cardi B and her four children celebrated Christmas together.\n\nRelated\n\nThe 20 Best Rap Albums of 2025: Staff&nbsp;Picks\n\nA Timeline of Cardi B & Stefon Diggs&#8217;&nbsp;Relationship\n\nCardi B Shuts Down Rumors Offset Tried to Attend Stefon Diggs&#8217; Birthday&nbsp;Party\n\nThe Bronx native posted a slideshow of photos from Christmas Day to her Instagram, which in part showed off the personality of each of her children, along with the chaos that comes with Christmas as a mother of four.\n\n&#8220;The perfect Christmas picture don’t exist in this house,&#8221; she wrote, as photos showed all of her kids couldn&#8217;t get on the same page for a peaceful family photo.\n\nCardi is mom to daughters Kulture and Blossom, as well as son Wave, with estranged husband Offset. She also welcomed a baby boy in November with boyfriend Stefon Diggs. The little one&#8217;s name has not yet been publicly revealed.\n\nBusta Rhymes and Paris Hilton were among those sending Cardi B some Christmas wishes in her comments. &#8220;Yea bardi kulture an IT girl watch out nah,&#8221; rapper Kash Doll added of Cardi&#8217;s oldest daughter.\n\nAs for Cardi&#8217;s boo, the New England Patriots star appeared to be celebrating Christmas elsewhere with his other children. &#8220;One of my boys first Christmas,&#8221; he wrote on an Instagram Stories photo of himself holding one of his sons in front of a Christmas tree.\n\nHe also made sure to share a sweet message for Cardi on Christmas. &#8220;Miss yaw!!! Don&#8217;t be squeezing him too tight you making him soft,&#8221; he quipped wrote when resharing Cardi&#8217;s photo of the rapper holding their newborn in front of a tree decorated with plush footballs.\n\nCardi B also got emotional seeing all of the Bardi Gang opening up tickets to her upcoming Little Miss Drama Tour for Christmas gifts from Santa.\n\n&#8220;These videos of people receiving my concert tickets for Christmas gifts, they making me so happy, but then again I&#8217;m thinking like, &#8216;God damn, I gotta really work hard. I gotta give it all I got. People are receiving me for Christmas.&#8217; Don&#8217;t worry, y&#8217;all, I&#8217;m finna go to work,&#8221; she said in a clip on her IG Story on Friday (Dec. 26).\n\nCardi&#8217;s got about six weeks left to train for her first headlining tour, as the North American trek is slated to kick off in Palm Desert, Calif., on Feb. 11.",
  "contentSource": "content:encoded"
}
