{
  "id": "412cb12ed8651ddd6cdc51ff0e564038e24aea6a",
  "title": "Russell Wilson & Ciara Make Eye-Popping Donation to Children’s Hospital: ‘Better Than Any Touchdown or Trophy’",
  "summary": "The football player visits young patients every Tuesday.",
  "canonicalUrl": "https://www.billboard.com/music/music-news/russell-wilson-ciara-donate-3-million-childrens-hospital-1236146102",
  "source": {
    "id": "billboard",
    "name": "Billboard",
    "url": "https://www.billboard.com/",
    "feedUrl": "https://www.billboard.com/feed/",
    "country": "US",
    "language": "en"
  },
  "publishedAt": "2025-12-26T21:51:53.000Z",
  "fetchedAt": "2025-12-26T22:22:34.617Z",
  "category": "entertainment",
  "tags": [
    "Music",
    "Music News",
    "Billboard Family",
    "sports"
  ],
  "image": "https://www.billboard.com/wp-content/uploads/2025/08/taylor-swift-travis-kelce-afc-championship-2025-espanol-billboard-1800.jpg?w=237&#038;h=147&#038;crop=1",
  "language": "en",
  "storagePath": "data/articles/entertainment/2025/12/26/412cb12ed8651ddd6cdc51ff0e564038e24aea6a.json",
  "contentText": "Russell Wilson and Ciara are definitely in the giving spirit this holiday season, with the couple donating millions of dollars to the Mount Sinai Karvis Children&#8217;s Hospital to close out a year of charitable efforts through the football player&#8217;s Why Not You Foundation.\n\nAs announced Friday (Dec. 26) through a Good Morning America segment, Wilson and the singer have contributed $3 million to the medical center&#8217;s pediatric programs. The money will go toward improving the hospital&#8217;s common area &#8212; where patients are free to engage in therapeutic and creative activities as a respite from doctors and treatments &#8212; as well as the children&#8217;s holiday shop.\n\nRelated\n\n15 Musicians Who Have Had Romances With Pro Athletes, From Taylor Swift to Megan Thee&nbsp;Stallion\n\nCiara Talks &#8216;CiCi&#8217; Album & Why She Shouldn&#8217;t Make Music With Russell Wilson (&#8216;Dad Is Crazy!&#8217;) in Chat With 8-Year-Old&nbsp;Daughter\n\nRussell Wilson Got Major Dad Points After Cynthia Erivo FaceTimed Into His Daughter&#8217;s &#8216;Wicked&#8217;-Themed Birthday&nbsp;Party\n\nThe donation comes as Wilson has been visiting the children&#8217;s hospital every Tuesday on his days off from practice and games with the New York Giants. &#8220;I started going to children&#8217;s hospitals, because my dad was unfortunately always in the hospital &#8212; he had diabetes &#8212; and my mom was an ER nurse,&#8221; he said in an interview with GMA .\n\n&#8220;For me, I thought, like, &#8216;How can I make a difference somewhere?'&#8221; the athlete continued. &#8220;Every time I walk in a room, I&#8217;m praying for a miracle, something great to happen. And I&#8217;ve seen those miracles happen time and time again.&#8221;\n\nThe $3 million comes by way of Wilson&#8217;s Why Not You Foundation, which he founded in 2014. &#8220;My dad used to always say, &#8216;Son, why not you?&#8217; It kind of became the mantra of my life,&#8221; he recalled, adding that he and Ciara decided to name the organization in honor of the phrase as &#8220;our parents both instilled that &#8216;Why not you?&#8217; attitude in us.&#8221;\n\nSix weeks prior to the Mount Sinai news, Wilson wrote on Instagram that the Why Not You Foundation had raised more than $21 million to go toward its programs championing education, children&#8217;s health and the fight against poverty. Some of the money also went to The V Foundation for Cancer Research.\n\nCiara, who works closely with her husband&#8217;s Why Not You Foundation, also recently attended an event at St. Peter&#8217;s Church in Atlanta to pledge $2 million to programs combating food insecurity.\n\nAs for what he hopes to see his donation accomplish, Wilson told GMA , &#8220;I want [the kids] to be inspired, and I want them to take their mind a little bit off of the pain they&#8217;re going through.&#8221;\n\n&#8220;It&#8217;s probably been the greatest thing I&#8217;ve been able to do in my career so far,&#8221; he added of helping young hospital patients. &#8220;It&#8217;s better than any touchdown or any trophy.&#8221;\n\nLearn more about Wilson and Ciara&#8217;s donation to Mount Sinai Karvis below.\n\nView this post on Instagram",
  "contentSource": "content:encoded"
}
