{
  "id": "510df7a034a5eaed87431bdaaba9a306a572b61c",
  "title": "Olivia Dean’s ‘Man I Need’ Hits No. 1 on Pop Airplay Chart",
  "summary": "Plus, she bookends the list as “So Easy (To Fall in Love)” debuts at No. 40.",
  "canonicalUrl": "https://www.billboard.com/music/chart-beat/olivia-dean-man-i-need-number-one-pop-airplay-chart-1236145790",
  "source": {
    "id": "billboard",
    "name": "Billboard",
    "url": "https://www.billboard.com/",
    "feedUrl": "https://www.billboard.com/feed/",
    "country": "US",
    "language": "en"
  },
  "publishedAt": "2025-12-26T17:46:52.000Z",
  "fetchedAt": "2025-12-26T18:33:07.222Z",
  "category": "entertainment",
  "tags": [
    "Chart Beat",
    "Music",
    "genre pop",
    "Music News"
  ],
  "image": "https://www.billboard.com/wp-content/uploads/2025/10/chartbreaker-olivia-dean-pr-cr-lola-mansell-billboard-2025-bb14-1-1200.jpg?crop=0px%2C51px%2C1200px%2C744px&#038;resize=237%2C147",
  "language": "en",
  "storagePath": "data/articles/entertainment/2025/12/26/510df7a034a5eaed87431bdaaba9a306a572b61c.json",
  "contentText": "Olivia Dean ’s “Man I Need” ascends two spots to No. 1 on Billboard ’s Pop Airplay chart (dated Jan. 3, 2026).\n\nRelated\n\nChartbreaker: Olivia Dean Scored a Breakthrough Because She ‘Had a Crush’ and Wanted to&nbsp;Dance\n\nHow Olivia Dean Positioned Herself For a Global Breakout With &#8216;The Art of&nbsp;Loving&#8217;\n\nREPUBLIC Collective Dominates 2025 Year-End Label&nbsp;Charts\n\nThe British singer-songwriter leads with her first entry on the survey, marking the latest rookie reign. HUNTR/X’s “Golden,” from Netflix’s KPop Demon Hunters , slayed for three weeks at No. 1 beginning in November after Lola Young’s “Messy” led for a week in May. All three songs have been promoted to radio by Republic (with “Man I Need” on Polydor/Island/Republic).\n\nMeanwhile, “Man I Need” marks the fifth consecutive new Pop Airplay No. 1 worked by Republic, extending the longest streak of leaders for a label in the chart’s 33-year history. The song follows Taylor Swift’s “The Fate of Ophelia,” which ruled for five weeks starting in late November; “Golden”; Justin Bieber’s “Daisies,” three weeks, beginning in October; and Sabrina Carpenter’s “Manchild,” one week in September. (Dean opened dates on Carpenter’s Short n’ Sweet Tour this year, ahead of her The Art of Loving tour, set to kick off in July.)\n\nPlus, Dean bookends Pop Airplay as “So Easy (To Fall in Love)” debuts at No. 40. Both songs are from her sophomore album, The Art of Loving , which rose to No. 5 on the Billboard 200 in November. “Man I Need” has reached No. 4 on the all-genre, multimetric Billboard Hot 100 and “So Easy (To Fall in Love),” No. 18.\n\n“We started with the 6/8 groove,” Dean told Billboard in October of crafting “Man I Need.” “I had a crush at the time. I was like, ‘Listen: Talk to  me !’ That initial joy when you first fancy somebody — I just wanted to channel that essence into a song.\n\n“Every day, I’m being told a new stat,” she marveled of her chart breakthrough. “It’s a bit of a new world for me.”\n\nAll charts dated Jan. 3 will update on Billboard.com Tuesday, Dec. 30.",
  "contentSource": "content:encoded"
}
