{
  "id": "58553f2f4d4445d0353d85b07761538c7379eb01",
  "title": "Celine Dion Croons ‘All By Myself’ and Does ‘Grinch’ Monologue in Full, Furry Costume on Christmas Eve: Watch",
  "summary": "The singer went method with her fireside recitation of Jim Carrey's harried monologue about his busy schedule.",
  "canonicalUrl": "https://www.billboard.com/music/pop/celine-dion-all-by-myself-grinch-monologue-costume-watch-1236145657",
  "source": {
    "id": "billboard",
    "name": "Billboard",
    "url": "https://www.billboard.com/",
    "feedUrl": "https://www.billboard.com/feed/",
    "country": "US",
    "language": "en"
  },
  "publishedAt": "2025-12-26T12:44:28.000Z",
  "fetchedAt": "2025-12-26T12:47:33.445Z",
  "category": "entertainment",
  "tags": [
    "Music",
    "Pop",
    "christmas",
    "genre pop",
    "Music News"
  ],
  "image": "https://i.imgur.com/2HpFicp.png",
  "language": "en",
  "storagePath": "data/articles/entertainment/2025/12/26/58553f2f4d4445d0353d85b07761538c7379eb01.json",
  "contentText": "Celine Dion definitely got the Christmas assignment. The iconic pop superstar went fully method for her holiday video this year, slipping into a lime green Grinch costume on Christmas Eve (Dec. 24) for a recitation of the holiday baddie&#8217;s overstuffed schedule.\n\nIn a clip shared this week , the singer posted up in a chair by a fire pit in the backyard and crooned her indelible cover of Eric Carmen&#8217;s maudlin ballad &#8220;All By Myself,&#8221; which Dion first recorded for her fourth English-language album, 1996&#8217;s Falling Into You . Of course, the sight of famously well-attired Dion goofily crooning the song while wearing a Santa getup over her green, furry costume was enough of a gift.\n\nBut then Dion made it a notch sillier by cutting to a shot of her holding one of her little pups on her lap while reciting a version of the Grinch&#8217;s lament about his busy schedule from the 2000 Ron Howard-directed, Jim Carrey-starring How the Grinch Stole Christmas .\n\n“The nerve of those Whos, inviting me down there on such short notice. Even if I wanted to go, my schedule wouldn’t allow it!” Dion says as the dog wearing antlers like the Grinch&#8217;s pooch, Max, wriggles out of her grasp. “4:00 — exercise my voice. 4:30 — wake my children up. 5:00 — solve world hunger. Tell no one. 5:30 — jazzercize. 6:30 — dinner with me. I can’t cancel that again! 7:00 — wrestle with my creative ideas.”\n\nThe dramatic recitation goes on, as Dion-as-Grinch honks, &#8220;I&#8217;m booked! Of course, if I bumped my creative ideas to 9:00, I’ll still have time to lay in bed and scroll TikTok videos endlessly. Or I can just simply wish everyone a merry Christmas and a happy new year,&#8221; she adds mock contentedly before shouting, &#8220;boring!”\n\nThe video winds down with Dion crooning a bit more of the song, casually singing, &#8220;When I was young/ I never needed anyone.&#8221;\n\nThe appearance was one of the rare public outings this year from Dion, who was diagnosed with the neurological disorder stiff-person syndrome in 2022, which seriously affected her voice and caused uncontrolled tremors , forcing her to cancel a planned 2023-2024 world tour to focus on her health.",
  "contentSource": "content:encoded"
}
