{
  "id": "5c22b1761e6752d7bd54e35df4515b50ad68409c",
  "title": "‘I Only Dunk When She’s Here’: NBA Star Donovan Mitchell Gets Bounce From Coco Jones",
  "summary": "Mitchell got up for some nasty slam dunks during the Cavs' Christmas game at the Knicks, inspired by his partner.",
  "canonicalUrl": "https://www.billboard.com/music/rb-hip-hop/nba-star-donovan-mitchell-shows-off-coco-jones-1236145635",
  "source": {
    "id": "billboard",
    "name": "Billboard",
    "url": "https://www.billboard.com/",
    "feedUrl": "https://www.billboard.com/feed/",
    "country": "US",
    "language": "en"
  },
  "publishedAt": "2025-12-26T08:33:56.000Z",
  "fetchedAt": "2025-12-26T09:25:47.311Z",
  "category": "entertainment",
  "tags": [
    "Music",
    "R&B/Hip-Hop",
    "bbnews",
    "nba"
  ],
  "image": null,
  "language": "en",
  "storagePath": "data/articles/entertainment/2025/12/26/5c22b1761e6752d7bd54e35df4515b50ad68409c.json",
  "contentText": "There are muses, and there is Coco Jones &#8212; an R&B artist who gives NBA star Donovan Mitchell a lift when she’s in the house.\n\nMitchell is an elite scorer for his Cleveland Cavaliers, a walking highlight package who combines deep range with flair for getting to the hoop, and impressive hops.\n\nWhen the Cavs stopped by Madison Square Garden on Christmas Day to face off with the New York Knicks, Jones sat courtside as her fiancé got to work, notching 34 points, along with seven rebounds and six assists.\n\nThe six-time NBA All-Star and 2018 Sam Dunk Contest champion Mitchell also got up for some nasty slam dunks, inspired by his partner. The 6’2” shooting guard was mic’d up for the game, which aired on ESPN, and admitted Jones gave him wings. “I ain&#8217;t dunk in like three months. I only dunk when she here,” remarked Mitchell, p er SportsCenter .\n\nTheir combined efforts weren’t enough as the Knicks ran out winners 126-124. It&#8217;s a long season.\n\nMitchell and Jones announced their engagement in July 2025, after dating for more than a year. Earlier, in March, Jones confirmed they were dating during an appearance on&nbsp; Club Shay Shay . “I love the Internet because they definitely clocked my tea. Little spies everywhere,” she told Shannon Sharpe. “I’m happy and I will say, my music is my outlet where I tell my stories and my truth. Some things I keep for myself because this is my life, too. I say some things and you can&nbsp;hear it on my album.”\n\nJones continued: “Secrecy is not what I prefer. I don’t want to feel like I have to be somebody secret. I don’t want to make anybody feel like they’re mine. For me, I’m trying to protect myself, and I’m trying to protect my family and who I love, so I am more private.”\n\nWhile Mitchell is balling out in the NBA, Jones dropped her anticipated&nbsp; Why Not More?&nbsp; debut album in April, following the release last year of several singles, including her Grammy-nominated hit “Here We Go (Uh Oh),” which was up for best R&B song and best R&B performance at this year’s awards show. “Here We Go (Uh Oh)” also became her&nbsp; first No. 1 &nbsp;on&nbsp; Adult R&B Airplay&nbsp; and received a remix with&nbsp; Leon Thomas .&nbsp;",
  "contentSource": "content:encoded"
}
