{
  "id": "6a05873e89a12cdedafb1e29d00a2985f44c6dfa",
  "title": "Travis Kelce Reveals One of Taylor Swift’s Favorite Gifts From Him So Far",
  "summary": "The Kansas City Chiefs player spilled on an episode of his podcast.",
  "canonicalUrl": "https://www.billboard.com/music/music-news/travis-kelce-reveals-taylor-swift-favorite-gifts-from-him-1236145833",
  "source": {
    "id": "billboard",
    "name": "Billboard",
    "url": "https://www.billboard.com/",
    "feedUrl": "https://www.billboard.com/feed/",
    "country": "US",
    "language": "en"
  },
  "publishedAt": "2025-12-26T19:14:49.000Z",
  "fetchedAt": "2025-12-26T19:18:07.798Z",
  "category": "entertainment",
  "tags": [
    "Music",
    "Music News",
    "lifestyle"
  ],
  "image": "https://www.billboard.com/wp-content/uploads/2025/08/taylor-swift-travis-kelce-afc-champs-2025-chiefs-billboard-1800.jpg?w=237&#038;h=147&#038;crop=1",
  "language": "en",
  "storagePath": "data/articles/entertainment/2025/12/26/6a05873e89a12cdedafb1e29d00a2985f44c6dfa.json",
  "contentText": "Travis Kelce gave now-fiancée Taylor Swift a brilliant cut diamond ring when he proposed in August, but when it came time to reveal which of the gifts he&#8217;d given the superstar since they began their romance is her favorite, it wasn&#8217;t the bling that he mentioned.\n\nRelated\n\nTaylor Swift Supports an Emotional Travis Kelce at His Last Chiefs Home Game of the&nbsp;Season\n\nA Timeline of Taylor Swift&#8217;s&nbsp;Generosity\n\nBeyond &#8216;Showgirl&#8217;: Taylor Swift&#8217;s Biggest Revelations on Falling for Travis Kelce & More on &#8216;New&nbsp;Heights&#8217;\n\nWhile discussing Christmas gifts for significant others with Jason Kelce and sister-in-law Kylie Kelce on the brothers&#8217; New Heights podcast episode that arrived Christmas Eve, the Kansas City Chiefs&#8217; tight end shared the present that Swift appreciates more than many of the others she&#8217;s received from him.\n\n&#8220;What about, like, kitchen appliances?&#8221; Travis wondered about the likelihood of such a gift being appreciated. &#8220;I will say one of Tay&#8217;s favorite gifts that I got her was the bread slicer.&#8221;\n\nBoth Kylie and Jason nodded and shared their approval as Travis continued of Swift&#8217;s penchant for baking, &#8220;&#8216;Cause she&#8217;s been throwing together so much f&#8211;kin&#8217; sourdough. Gosh. I got the best gut health there is. I love you, Tay!&#8221;\n\nJason then chimed in with why a bread slicer would be a great gift for someone who loves to bake. &#8220;One of the unfortunate things with making fresh bread is trying to cut that s&#8211;t, and it is hard!&#8221; he exclaimed. &#8220;The slicer makes a big deal!&#8221;\n\nKylie &#8212; who also hosts her own podcast titled Not Gonna Lie &#8212; then confused the brothers with her next comment: &#8220;More importantly, the responsibility to eat it!&#8221;\n\n&#8220;Whaaaaat?!&#8221; exclaimed Travis as his big brother declared, &#8220;That&#8217;s the easy part!&#8221;\n\nSwift&#8217;s love for whipping up baked goods in her kitchen has made numerous headlines. She&#8217;s famously whipped up homemade pop-tarts for friends such as Channing Tatum as well as the Kansas City Chiefs, cinnamon rolls for her love before a game, and a loaf of fresh sourdough for longtime pal Selena Gomez and Benny Blanco.\n\nDuring her first appearance on New Heights in August, the pop superstar &#8212; who made multiple $1 million donations to charity just before Christmas &#8212; revealed her love for making sourdough bread, and that she was in search of the perfect recipe. She noted: &#8220;Right now we’re very deep in a sourdough obsession that has taken over my life.&#8221;\n\nWatch the clip of Travis revealing one of Taylor&#8217;s favorite gifts from him so far:",
  "contentSource": "content:encoded"
}
