{
  "id": "6b778969231a21d98e62d5633305edd921a765f8",
  "title": "Check Out How Mariah Carey, Jennifer Lopez, Justin Bieber, Cardi B and BLACKPINK’S ROSÉ Celebrated Christmas",
  "summary": "Matching jammies and cozy nights by the fire were the order of the day for stars this week.",
  "canonicalUrl": "https://www.billboard.com/lists/christmas-2025-mariah-carey-jlo-cardi-b-rose-justin-bieber",
  "source": {
    "id": "billboard",
    "name": "Billboard",
    "url": "https://www.billboard.com/",
    "feedUrl": "https://www.billboard.com/feed/",
    "country": "US",
    "language": "en"
  },
  "publishedAt": "2025-12-26T18:06:40.000Z",
  "fetchedAt": "2025-12-26T18:33:07.222Z",
  "category": "entertainment",
  "tags": [
    "Music",
    "Music News",
    "christmas"
  ],
  "image": "https://i.imgur.com/2HpFicp.png",
  "language": "en",
  "storagePath": "data/articles/entertainment/2025/12/26/6b778969231a21d98e62d5633305edd921a765f8.json",
  "contentText": "The stars: they&#8217;re just like us. And, just like us, this week they coordinated with family in matching pajamas to sit around the fire and open presents, decked their halls with boughs of holly and enough lights to illuminate the darkest days of the year and shared their Christmas celebrations on Instagram for all to enjoy.\n\nWhether it was Cardi B chilling with her brood of four at home, with each kid posing in front of a different, sparkling Christmas tree, or Celine Dion slipping into something way less comfortable to play the Grinch in a fireside video in which she lamentably sings her hit cover of Eric Carmen&#8217;s &#8220;All By Myself,&#8221; the holiday spirit was in the air on Christmas Eve (Dec. 24) and Christmas Day (Dec. 25).\n\nThe Queen of Christmas, as you can imagine, was all in, with Mariah Carey cozying up to Santa himself, who seemed to make a house call as he hung out on the couch in pics along with the &#8220;All I Want For Christmas Is You&#8221; singer and her teenage twins, Moroccan and Monroe.\n\nJustin Bieber and wife Hailey Bieber also got into the action, posting a Merry Christmas message and a cute selfie in which they leaned their heads together in the winter chill, with &#8220;Daisies&#8221; singer Justin rocking a puffy white coat and model Hailey opting for a fuzzy black jacket and red scarf.\n\nFamily gatherings are the order of the day, which seemed like the vibe for Jennifer Lopez and her crew, who slipped into matching red and white striped pajamas for a family couch snuggle on Christmas Eve.\n\nCheck out some of the other scenes from stars&#8217; Christmas celebrations below.",
  "contentSource": "content:encoded"
}
