{
  "id": "7d6a3ac900ef7af85d2882fb18e6cc5448d2cc50",
  "title": "Gone But Not Forgotten: Musicians We Lost in 2025",
  "summary": "From Ace Frehley to D'Angelo, Ozzy Osbourne, Roberta Flack and beyond, Billboard remembers the artists who left us this year.",
  "canonicalUrl": "https://www.billboard.com/photos/musicians-who-died-2025-1235881159",
  "source": {
    "id": "billboard",
    "name": "Billboard",
    "url": "https://www.billboard.com/",
    "feedUrl": "https://www.billboard.com/feed/",
    "country": "US",
    "language": "en"
  },
  "publishedAt": "2025-12-26T21:19:54.000Z",
  "fetchedAt": "2025-12-26T22:22:34.617Z",
  "category": "entertainment",
  "tags": [
    "Music",
    "Music News",
    "obituary",
    "Photo Gallery"
  ],
  "image": null,
  "language": "en",
  "storagePath": "data/articles/entertainment/2025/12/26/7d6a3ac900ef7af85d2882fb18e6cc5448d2cc50.json",
  "contentText": "2025 got off to a rough start in the music world, with two music greats passing away on the first day of the new year. Argentine artist and composer Leo Dan &#8212; known for his romantic tracks such as“Cómo Te Extraño Mi Amor,” “Mary Es Mi Amor” and “Pídeme La Luna” &#8212; died at age 82; Wayne Osmond, the second oldest of the Osmond Brothers, died at 73, his family announced the day after his passing.\n\nSoul singer Brenton Wood, known for 1967&#8217;s &#8220;The Oogum Boogum Song,&#8221; died of natural causes on Jan. 3 at age 83. And before the first week of the new year ended, Peter Yarrow of popular folk trio Peter, Paul and Mary died in his New York City home at age 86 after a four-year battle against bladder cancer.\n\nThe losses continued with Sam Moore of the duo Sam & Dave passing away at age 89 on Jan. 10, followed by The Whites&#8217; Buck White, who died three days later at age 94, then Thin Lizzy and Whitesnake guitarist John Sykes passing on at age 65 after a cancer battle. And on the final day of the third week of the new year, Garth Hudson &#8212; the last surviving member of Rock Hall-honored group The Band &#8212; died in his sleep at age 87.\n\nMusic fans were dealt another blow when the iconic Roberta Flack died at age 88 on Feb. 24, surrounded by her loved ones. Another big loss hit on July 22, when metal icon Ozzy Osbourne passed away at the age 76, just weeks after the final Black Sabbath concert.\n\nWhile the world has had to say goodbye to many musicians so far this year, they will live in the memories of not only their families, but their fans. Here, Billboard remembers the musical artists who passed away in 2025.",
  "contentSource": "content:encoded"
}
