{
  "id": "95f9d6f9a837612d8cddba9d71abed61c49410c5",
  "title": "Olivia Dean Reigns Over Final ARIA Charts For 2025",
  "summary": "Dean claims the ARIA Chart double for a third consecutive cycle.",
  "canonicalUrl": "https://www.billboard.com/music/chart-beat/olivia-dean-reigns-final-aria-charts-2025-1236145625",
  "source": {
    "id": "billboard",
    "name": "Billboard",
    "url": "https://www.billboard.com/",
    "feedUrl": "https://www.billboard.com/feed/",
    "country": "US",
    "language": "en"
  },
  "publishedAt": "2025-12-26T07:49:14.000Z",
  "fetchedAt": "2025-12-26T07:56:34.114Z",
  "category": "entertainment",
  "tags": [
    "Chart Beat",
    "Music",
    "Aria",
    "bbcharts",
    "bbnews"
  ],
  "image": null,
  "language": "en",
  "storagePath": "data/articles/entertainment/2025/12/26/95f9d6f9a837612d8cddba9d71abed61c49410c5.json",
  "contentText": "It’s Olivia Dean for the win, as the English singer and songwriter ends the year in charge of the ARIA Singles and Albums Charts.\n\nWhen the national tallies were published late Friday, Dec. 26, Dean’s international smash “Man I Need” holds top spot on the singles chart for a sixth straight week, and its parent The Art Of Loving (via Universal) rules the albums rankings for a fourth non-consecutive week.\n\nFollowing her appearance at the 2025 ARIA Awards, presented last month in Sydney, Dean has dominated the ARIA charts for much of December. Indeed, she claims the double for a third consecutive cycle in these final stages of the year, and this week bags one of four new releases on the ARIA Singles Chart, as “I’ve Seen It” drops in at No. 50.\n\nTwo of those fresh cuts belong to Liverpool, England rapper EsDeeKid, who converts a hot presence on TikTok and wild Internet speculation into multiple, improving chart positions. “4 Raws” impacts the ARIA Top 50 Singles Chart for the first time, up 54-28, as does “Century,” up 60-45, while “Phantom” featuring Rico Ace makes its move, lifting 31-21 (all through Lizzy Records/ADA).\n\nFall Out Boy brings song holiday spirit to the latest frame, as “It Feels Like Christmas” unwraps at No. 29. The emo favorites&#8217; latest top 40 hit is a cover, the original of which appeared in the 1992 film The Muppet Christmas Carol.\n\nThe only Australian artist taking a bite out of the national chart is Tame Impala &#8216;s “Dracula” (Columbia/Sony), down 35-41 in its 10 th week.\n\nAt this time of year, Christmas-themed songs would typically swamp the all-genres singles and albums charts. That’s no longer the case, thanks to a sweeping overhaul of the chart criteria several months ago, which now sees golden oldies &#8212; those recordings that were released at least two years ago &#8212; relegated to the On Replay charts.\n\nThere are some familiar faces, and tunes, cleaning up there. Michael Buble’s Christmas (Reprise/Warner) reclaims No. 1 atop the On Replay Albums Chart and Mariah Carey’s “All I Want For Christmas Is You” (Columbia/Sony) is crowned on the singles side .",
  "contentSource": "content:encoded"
}
