{
  "id": "a0526385cc698890c3fa21b9c777f9dcd17b997c",
  "title": "How Peso Pluma and Tito Double P Made ‘Dinastía,’ and Changed the Sound of Corridos",
  "summary": "'Dinastía' is their first joint album.",
  "canonicalUrl": "https://www.billboard.com/music/latin/peso-pluma-tito-double-p-dinastia-first-joint-album-1236145589",
  "source": {
    "id": "billboard",
    "name": "Billboard",
    "url": "https://www.billboard.com/",
    "feedUrl": "https://www.billboard.com/feed/",
    "country": "US",
    "language": "en"
  },
  "publishedAt": "2025-12-26T04:59:00.000Z",
  "fetchedAt": "2025-12-26T05:35:05.528Z",
  "category": "entertainment",
  "tags": [
    "Latin",
    "Music",
    "bbnews",
    "genre latin"
  ],
  "image": null,
  "language": "en",
  "storagePath": "data/articles/entertainment/2025/12/26/a0526385cc698890c3fa21b9c777f9dcd17b997c.json",
  "contentText": "Peso Pluma (real name Hassan Emilio Kabande Laija) and Tito Double P (real name Jesús Roberto Laija) might have been second cousins, but they never actually met in their native Mexico until Peso moved to Culiacán, the capital of Sinaloa in Northwestern Mexico.\n\nThere, at a party, the 18-year-old Peso met his 20-year old cousin Tito for the first time. Both were aspiring musicians, but Peso already came with a sound and a style: he sang the corridos tumbados that were beginning to make the rounds with the likes of Natanael Cano and Junior H, about lifestyle and drugs, a far cry from the “corridos de hombres” about heroes and anti-heroes that most Mexicans had grown up with.\n\nEven then, his nasal, piercing vocals struck a chord. And, more than anything, says Tito, so did his energy.\n\n“I made music as a hobby then,&#8221; says Tito today. “And from the moment he arrived, I said, come here. I&#8217;ll write, you sing.&#8221;\n\nIt was the beginning of a musical partnership and a close friendship that first propelled Peso to super-stardom (with Tito co-writing many of his biggest hits) and more recently, Tito. The cousins ended 2025 at No. 4 (Tito) and No. 5 (Peso) on Billboard’s year-end Top Latin artists chart , and are considered leaders of the new Mexican music movement. Now, more than five years after their first encounter, the two are releasing their first-ever album together.\n\nDinastía , released right after Christmas, at midnight on Dec. 26, features Tito and Peso dueting in 14 tracks, ranging from ballads and love songs to hard-hitting corridos that tell tales of life and heartbreak, all rooted in Mexico and its rich arsenal of tradition.\n\nMany of the songs ooze musicianship, from the virtuoso chops required from the accompanying musicians to a level of sophisticated execution that’s uncommon in any pop genre. Listen carefully to focus track “dopamina” and enjoy the initial ambient background vocals, the crescendos and decrescendos of the tuba, the contra punctual syncopated beats under the percussive vocals, Peso’s higher tenor in contrast to Tito’s more aggressive delivery.\n\nThe album, in the works for over a year, got a major rehaul this summer following Mexico’s growing ban on narcocorridos, a staple of both Tito and Peso’s repertoire. Instead, the cousin re-worked lyrics to reflect other, equally compelling realities, from life on the streets, to sheer bragadoccio to pain of loss.\n\nRich in symbolism, the album’s cover features dueling biblical brothers Jacob and Esuú, who in their Peso-Tito reading are also different but bonded by family, friendship, music and country. &nbsp;\n\nThe album was teased with an “intro” video , featuring lucha libre imagery and Mexican actress Kate del Castillo (who played the lead in the series La Reina del Sur) and shot in stunning black and white cinematography. At the end, Jasiel Núñez and Chivo, part of the next generation of regional Mexican music artists, take off their masks to reveal their faces.\n\n“We might have our differences, but beyond those, we’re one. What matters is the unity &#8212; what we’re doing for family, for Mexico, and for corridos as a genre. That’s the message we want to leave behind,&#8221; says Peso.\n\nPeso and Tito spoke exclusively to Billboard via Zoom, Peso from his home in Los Angeles and Tito from his home in Mexico.\n\nBillboard: You’ve recorded several songs together, and Tito is signed to your label, Double P records. But this is the first time you actually put out an album together. How long was this in the works?\n\nPeso: From the moment we started working together, and when I invited Tito to be my exclusive songwriter, I always had the idea that “Double P” wasn’t just me &#8212; it was both of us. When Tito decided to pursue his own solo career, I was so happy and proud that he chose that path. This album is something we’ve wanted to do for years. We never really sat down and planned it out properly until recently, but we’ve always loved creating music together. When we were on the road, we’d write songs in hotels, and some of our biggest hits &#8212; like “PRC” and “AMG” &#8212; came from those late-night sessions. We officially started working on Dinastía on December 10 of last year.\n\nSo, it&#8217;s been cooking for a while?\n\nPeso: Definitely! It’s like a Christmas dinner &#8212; you have to let it sit in the oven for a while. The genre is evolving, and we’re taking the lead in shaping it. We’ve had to navigate changes, like the bans on certain lyrics. It&#8217;s similar to what happened with reggae and rap back in the day. But we’re proud to step up, take the hits and push the genre forward. Other artists are watching us closely to see what we do. We&#8217;re setting the standard and we want to do it right. That’s why this project took time. We also wanted to work with the best songwriters in the world of corridos and make them part of this project and create something meaningful.\n\nThe timing makes the message even stronger. Tito and I wanted to show everyone—Mexicans and the Latin community—that you can create beautiful corridos without glorifying crime or drugs. Corridos are part of our roots, our culture.\n\nPeso Pluma\n\nMexico’s crackdown on narcocorridos has intensified this year, impacting live shows and music releases. How did that affect the album?\n\nPeso: We initially planned to release the album in the summer, but fate had other plans. Now that it’s coming out on Christmas, I think the timing makes the message even stronger. Tito and I wanted to show everyone &#8212; Mexicans and the Latin community &#8212; that you can create beautiful corridos without glorifying crime or drugs. Corridos are part of our roots, our culture, so we wanted to bring that essence back and celebrate it. That&#8217;s why we wanted to involve all these elements of Mexican culture.\n\nTito: Yeah, we had to pull some songs, change lyrics, and go back to the studio. It wasn’t easy because the album was originally set for a summer release and the music changed, the producers, the sound. Other artists do their music and take sounds from us. We took out songs, changed lyrics, added more songs, which I loved. The album feels complete now &#8212; it’s packed with emotion and meaning.\n\nThere’s a lot of romantic songs on the album. That took me by surprise.\n\nTito: It&#8217;s about singing to the girls too. That’s what I told Hassan &#8212; I said, “We need to include love songs.” The album’s heavy on corridos, but they’re “clean” corridos. You don’t need to sing about crime to make impactful music.\n\nBut your songs still have that edge .\n\nTito: Definitely. You don’t have to sing about the streets directly &#8212; it’s all in the tone [aggressive] and the instruments. But we’re telling stories, sharing day-to-day experiences, and capturing emotions, that&#8217;s it.\n\nPeso:  I told Tito from the beginning, “You’ve got an ear for what’s trending right now &#8212; for what the streets, the kids, and the women want to hear. Help me choose the songs and shape this project.” We started with over 30 songs and narrowed it down to just over half. This album has everything &#8212; songs to cry to, corridos to drink to, songs to dance to, love songs, and heartbreak anthems. Corridos are for everyone, not just people involved in crime. This album represents that duality perfectly.\n\nThe album cover features Jacob and Esau. What’s the story behind that?\n\nPeso: The idea is that we’re a duality &#8212; two people with the same last name. We’re opposites, like black and white, yin and yang, angels and demons. The biblical story of Jacob and Esau &#8212; two brothers who fought even before they were born &#8212; captures that tension. Tito and I might have our differences, but at the end of the day, we’re united. This album is about family, about Mexico, and about what we’re doing for corridos. That’s the bigger picture.",
  "contentSource": "content:encoded"
}
