{
  "id": "b270eabf1801ce800dcf6da5addebba9316f3a4a",
  "title": "Publishing Briefs: BMG Bolsters Ties With TikTok — Plus, UMPG Heeds Warning",
  "summary": "This week's publishing roundup features a dollop of deals.",
  "canonicalUrl": "https://www.billboard.com/lists/publishing-deals-bmg-tiktok-warning-umpg-believe-icmp",
  "source": {
    "id": "billboard",
    "name": "Billboard",
    "url": "https://www.billboard.com/",
    "feedUrl": "https://www.billboard.com/feed/",
    "country": "US",
    "language": "en"
  },
  "publishedAt": "2025-12-26T17:00:00.000Z",
  "fetchedAt": "2025-12-26T17:19:56.312Z",
  "category": "entertainment",
  "tags": [
    "Business",
    "Publishing",
    "billboard green",
    "bmg",
    "Publishing Briefs",
    "TikTok"
  ],
  "image": "https://www.billboard.com/wp-content/uploads/2025/12/christmas-holiday-music-illo-billboard-1800.jpg?w=237&#038;h=147&#038;crop=1",
  "language": "en",
  "storagePath": "data/articles/entertainment/2025/12/26/b270eabf1801ce800dcf6da5addebba9316f3a4a.json",
  "contentText": "BMG has renewed and expanded its direct music publishing agreement with TikTok , signaling a deeper collaboration aimed at modernizing digital rights and creating greater value for songwriters. The updated deal enhances reporting and attribution standards across platforms and introduces advanced tools for rights management and promotion. These improvements will give BMG increased visibility into music usage and strengthen its infrastructure for rights holders in today’s fast-evolving, social-first environment.\n\n“BMG truly understands the power of TikTok and the opportunity it creates for songwriters today,” said Tracy Gardner , TikTok’s global head of music business development. “They understand the platform, they embrace innovation, and they work with us hand-in-hand to strengthen rights management and unlock meaningful value. This expanded partnership reflects the trust and momentum we’ve built together — and we’re excited to continue driving growth for the songwriters at the heart of music discovery on TikTok.”&nbsp;\n\nRelated\n\nWhy Creating a Holiday Hit Is the &#8216;Holy Grail&#8217; For&nbsp;Songwriters\n\n-\n\nKristin Robinson\n\n-\n\nCeline Joshua , evp of global marketing and streaming, said,&nbsp;&#8220;This agreement underscores our focus on building scalable, forward-looking partnerships that elevate the role of songwriting in today’s music economy. We continue to invest in systems and structures that protect rights, ensure attribution, and add value for creators across the digital landscape.&#8221;\n\nThe partnership with BMG comes as TikTok continues to shape music discovery and engagement. In a recent Billboard interview, Gardner emphasized that the platform’s relationship with the music industry remains strong despite layoffs and licensing challenges in 2025. Gardner, who joined TikTok in 2019 after six years at Warner Music, highlighted features like songwriter tagging and e-commerce integrations, including successful livestreams and fan events. Gardner noted that while TikTok requires users to tag AI-generated music, industry-wide solutions remain unclear, calling it “uncharted territory” and emphasizing the platform’s commitment to balancing innovation with rights protection.\n\nCheck out the rest of this week’s publishing news below:",
  "contentSource": "content:encoded"
}
