{
  "id": "c5c0063172323f94a0aff2cf834559ef1da89be5",
  "title": "Kenshi Yonezu’s ‘IRIS OUT’ Returns to No. 1 for 11th Week on Japan Hot 100",
  "summary": "Debuting at No. 2 is “Are wa Fairy,” the title track of Bokuga Mitakatta Aozora’s seventh single.",
  "canonicalUrl": "https://www.billboard.com/music/chart-beat/kenshi-yonezu-iris-out-11th-week-japan-hot-100-1236146109",
  "source": {
    "id": "billboard",
    "name": "Billboard",
    "url": "https://www.billboard.com/",
    "feedUrl": "https://www.billboard.com/feed/",
    "country": "US",
    "language": "en"
  },
  "publishedAt": "2025-12-26T21:19:40.000Z",
  "fetchedAt": "2025-12-26T21:20:48.225Z",
  "category": "entertainment",
  "tags": [
    "Chart Beat",
    "Music",
    "Billboard Japan",
    "Global",
    "Japan",
    "Music News"
  ],
  "image": null,
  "language": "en",
  "storagePath": "data/articles/entertainment/2025/12/26/c5c0063172323f94a0aff2cf834559ef1da89be5.json",
  "contentText": "Kenshi Yonezu’s “IRIS OUT” returns to No. 1 on the Billboard Japan Hot 100 , on the chart released Dec. 24.\n\nThe Chainsaw Man – The Movie: Reze Arc theme rebounds to the summit for the first time in two weeks, marking its 11th total week at No. 1. Week over week, downloads rise to 114%, streaming to 102%, and video views to 101%. The track also holds No. 1 for a 13th consecutive week on the Global Japan Songs Excl. Japan chart dated Dec. 18. While its combined video and audio streams outside Japan total 9.86 million, falling short of 10 million, it nonetheless maintains the top spot.\n\nDebuting at No. 2 is “Are wa Fairy,” the title track of Bokuga Mitakatta Aozora’s seventh single. The CD launched with 120,035 copies to take No. 2 for sales and comes in at No. 3 for radio. Panda Dragon’s “Winter Song Boeitai” bows at No. 3. The title track of the five-member boy band&#8217;s 13th single leads sales with 131,384 copies, but places third on the Japan Hot 100 this week due to a lack of support from other metrics. Also making its first appearance on the chart at No. 4 is OCTPATH’s “Starlight Rendezvous.” The title track of the group’s eighth single sold 85,717 copies to take No. 3 for the metric. This week, sales-driven titles fill the slots from No. 2 through No. 4.\n\nAt No. 5 is HANA’s “NON STOP,” down a notch from last week. Downloads fall to 54% of the prior frame, streaming to 81%, and radio to 75%.\n\nElsewhere on the Japan Hot 100, songs by back number see a broad resurgence, with 12 tracks landing on the tally. “Christmas Song” is up to 123% in total points, while “Heroine” rises to 109% and “Suiheisen” to 108% week-over-week. Released in 2011, “Shiawase” makes its first-ever appearance on the chart this week.\n\nThe Billboard Japan Hot 100 combines physical and digital sales, audio streams, radio airplay, video views and karaoke data.\n\nSee the full Billboard Japan Hot 100 chart, tallying the week from Dec. 15 to 21, here . For more on Japanese music and charts, visit Billboard Japan’s English X account .",
  "contentSource": "content:encoded"
}
