{
  "id": "cc2c228e701f1e1839e3b0248c8692ff12e59dcd",
  "title": "2026 Grammy Nominees for Record & Song of the Year are Nearly Identical. How Unusual Is That?",
  "summary": "It’s the first time in 11 years that there is just one difference in the lineups in the two categories.",
  "canonicalUrl": "https://www.billboard.com/lists/grammy-nominees-record-song-of-the-year-overlap-full-list",
  "source": {
    "id": "billboard",
    "name": "Billboard",
    "url": "https://www.billboard.com/",
    "feedUrl": "https://www.billboard.com/feed/",
    "country": "US",
    "language": "en"
  },
  "publishedAt": "2025-12-26T19:39:19.000Z",
  "fetchedAt": "2025-12-26T20:24:37.282Z",
  "category": "entertainment",
  "tags": [
    "Awards",
    "Music",
    "grammy award for record of the year",
    "Grammys",
    "Record of the Year",
    "song of the year"
  ],
  "image": null,
  "language": "en",
  "storagePath": "data/articles/entertainment/2025/12/26/cc2c228e701f1e1839e3b0248c8692ff12e59dcd.json",
  "contentText": "As Recording Academy voters pore over the 2026 nominations list before final-round voting closes on Jan. 5, they are sure to notice that the nominees for record and song of the year are nearly identical. Seven of the eight record of the year nominees are also up for song of the year.\n\nThe only difference between the two lists is that Chappell Roan’s “The Subway” is nominated for record of the year but not song of the year, and HUNTR/X’s “Golden” is nominated for song of the year but not record of the year.\n\nOther than that, the lineups overlap exactly: Bad Bunny’s “DtMF,” Sabrina Carpenter’s “Manchild,” Doechii’s “Anxiety,” Billie Eilish’s “Wildflower,” Lady Gaga’s “Abracadabra,” Kendrick Lamar with SZA’s “luther” and Rosé & Bruno Mars’ “APT.”\n\nIt’s the first time in 11 years that there is just one difference in the lineups for record and song of the year.\n\nYou probably know, but to refresh you: Record of the year honors a specific recording of a song; song of the year honors the song itself. Record of the year is awarded to the artist and producer(s), recording engineer(s) and/or mixer(s) and mastering engineer(s), if other than the artist. Song of the year is awarded solely to the songwriters.\n\nSince the first Grammy ceremony in 1959, there was just one year when the record and song of the year nominees overlapped 100%. That was at the 1973 ceremony.\n\nHere’s a complete list of all the times there was no more than one difference between the rosters of record and song of the year nominees. The years shown are the years of the Grammy ceremonies.",
  "contentSource": "content:encoded"
}
