{
  "id": "ce04b91c98a2f2befa1363911e6486930ea7cc26",
  "title": "Snoop Dogg Headlines Netflix’s NFL Christmas Entertainment Spot With Huntr/x, Andrea Bocelli & More: Watch",
  "summary": "“Snoop’s Holiday Halftime Party” had a little something for everyone: hip-hip, country, K-pop and classical-crossover.",
  "canonicalUrl": "https://www.billboard.com/music/music-news/snoop-dogg-netflix-nfl-christmas-entertainment-1236145639",
  "source": {
    "id": "billboard",
    "name": "Billboard",
    "url": "https://www.billboard.com/",
    "feedUrl": "https://www.billboard.com/feed/",
    "country": "US",
    "language": "en"
  },
  "publishedAt": "2025-12-26T09:29:10.000Z",
  "fetchedAt": "2025-12-26T09:59:55.999Z",
  "category": "entertainment",
  "tags": [
    "Music",
    "Music News",
    "bbnews",
    "christmas",
    "nfl"
  ],
  "image": null,
  "language": "en",
  "storagePath": "data/articles/entertainment/2025/12/26/ce04b91c98a2f2befa1363911e6486930ea7cc26.json",
  "contentText": "For those of us who were good this year, Santa brought us Christmas Day gifts, good food and some Doggfather delights.\n\nSnoop Dogg headlined the halftime entertainment for Netflix’s&nbsp; NFL &nbsp;Christmas Gameday Live, a matchup of Detroit Lions and the Minnesota Vikings. And he didn’t drop the ball.\n\nMartha Stewart introduced “Snoop’s Holiday Halftime Party,” a colorful spot with a little something for everyone: hip-hip, country, K-pop and classical-crossover.\n\nSnoop stepped into centerfield at U.S. Bank Stadium in Minneapolis, MN, wearing an all-red ensemble, a long red coat with furry trim over a double-breasted suit, as he hit a succession of classics.\n\nThe party started with Dr. Dre covers “The Next Episode” and “Nuthin&#8217; but a &#8220;G&#8221; Thang,” and a rendition of “The Twelve Days of Christmas,” featuring EJAE, AUDREY NUNA and REI AMI, the singers that make up Huntr/x, the heroic girl group Netflix’s animated hit Kpop Demon Hunters .\n\nNext up, Snoop served some homestyle cooking with “Drop It Like It&#8217;s Hot” and “Who Am I? (What&#8217;s My Name?),” before country star Lainey Wilson sledded on in for a performance of “Santa Claus Is Coming to Town.”\n\nThe spectacle wrapped up with a cover of Bing Crosby’s “White Christmas,” with Snoop flanked by world-renowned Italian tenor Andrea Bocelli and his son Matteo Bocelli.\n\nEarlier, Kelly Clarkson set the tone with a special gridiron-meets-white-Christmas themed video for &#8220;Underneath the Tree,&#8221; the American Idol&#8217;s contemporary holiday classic that dropped in 2013.\n\nNetflix announced the all-star special earlier this month. “NFL, Netflix and your uncle Snoop on Christmas Day? We’re servin’ up  music , love and good vibes for the whole world to enjoy,” Snoop teased in a statement at the time. “That’s the kind of holiday magic Santa can’t fit in a bag.” To celebrate the big reveal, the streaming giant shared a festive teaser on its official social media pages, narrated by funk pioneer  George Clinton .\n\nSnoop Dogg’s halftime takeover comes one year after&nbsp; Beyoncé &nbsp;played Netflix’s inaugural Christmas Day extravaganza. Queen Bey, who earned the&nbsp; highest-grossing solo tour of 2025 , treated her hometown of Houston to the first live performance of tracks from her three-time Grammy-winning&nbsp; Cowboy Carter &nbsp;LP.&nbsp;\n\nThe 2025 Christmas Day doubleheader kicked off with the Dallas Cowboys facing off against the Washington Commanders. For the record, the Cowboys beat the Commanders 30-23, and the Vikings went on to beat the Lions by 23-10.",
  "contentSource": "content:encoded"
}
