{
  "id": "cfeca78c683fc0648ff5b7a44379ebffb9b7fe12",
  "title": "Guaynaa’s Joyful Aguinaldo ‘Para el Año Nuevo’ & More Best New Music Latin",
  "summary": "Plus, check out Billboard's New Music Latin weekly playlist below!",
  "canonicalUrl": "https://www.billboard.com/music/latin/best-new-music-latin-guaynaa-para-el-ano-nuevo-1236145731",
  "source": {
    "id": "billboard",
    "name": "Billboard",
    "url": "https://www.billboard.com/",
    "feedUrl": "https://www.billboard.com/feed/",
    "country": "US",
    "language": "en"
  },
  "publishedAt": "2025-12-26T19:28:59.000Z",
  "fetchedAt": "2025-12-26T20:24:37.282Z",
  "category": "entertainment",
  "tags": [
    "Latin",
    "Music",
    "genre latin",
    "new releases"
  ],
  "image": null,
  "language": "en",
  "storagePath": "data/articles/entertainment/2025/12/26/cfeca78c683fc0648ff5b7a44379ebffb9b7fe12.json",
  "contentText": "New Music Latin is a compilation of the best new Latin songs and albums recommended by&nbsp; Billboard&nbsp; and&nbsp; Billboard Español&nbsp; editors. Check out this week’s picks below.\n\nCris MJ, Las Filtradas (Sonar LLC)\n\nCris MJ chose Christmas as the perfect moment to drop  Las Filtradas , an 18-track LP that relies upon minimalist beats while blending reggaetón with trap textures. Opening with “Pensando Brígido,” produced by Reelian, the album leans on Autotuned vocals and straightforward street narratives to establish its sound. Focus track “Botellita de Champagne” is an explicit ode to seduction, fitting into reggaetón’s risqué traditions, while “Hoy Te Toca,” featuring FloyyMenor, brings a flirtatious vibe to the mix. Cris MJ nods to his global ambitions on “Subieron las Ventanas,” teaming up with Puerto Rican heavyweight Bryant Myers to deliver boastful, defiant verses over bass-heavy production.\n\nTrue to its title,  Las Filtradas  — his second album this year, and fourth overall — built online buzz ahead of its release due to unauthorized leaks. While the project offers a cohesive collection for longtime fans, it largely sticks to Cris MJ’s established formula. Still, the album underscores Chilean reggaetón’s rising presence in the global urban music scene. —   ISABELA RAYGOZA\n\nGuaynaa, “Para el Año Nuevo” (Guaynaa Records LLC)\n\nWith a fresh sound rich in strings, percussion, vocals and brass, Guaynaa manifests all the positive things one could wish for in the coming year in this infectious and joyful aguinaldo — a traditional Christmas music genre from Puerto Rico and Venezuela — that invites us to dance and celebrate. “Let the good times come (Let them come!)/ The bad times are gone (They&#8217;re gone!)/ Where do we throw them? (Where?)/ Back, back, back,” sings the Puerto Rican artist, accompanied by a large orchestra, while repeating the chorus like a mantra: “For the new year you will have/ Joy, health, and prosperity.”\n\nWritten by Guaynaa alongside renowned salsa composer José Juan Hernández, and produced by Guss Music Baby with arrangements by Gustavo Alberto, “Para el Año Nuevo” is an instant classic for the holiday season. — SIGAL RATNER-ARIAS\n\nDale Pututi, Nesty, Wow Popy ft. Maykel Falcón, &#8220;Personaje &#8216;La Rumba'&#8221; (Dale Pututi)\n\nThroughout 2025, Dale Pututi and Nesty unlocked a successful strategy: lacing traditional Cuban rhythms with contemporary music. Their new single “Personaje (La Rumba),” in collaboration with Wow Popy and Maykel Falcón, follows that formula. Produced by Alejandro Arce (Pututi) and RoMn Beatz, “Personaje” is a modern-day rumba, honoring the rich Afro-Cuban rhythm that’s often linked to the Yoruba religion. Sonically, it&#8217;s backed by different components of son and rumba melodies such as yambú, guaguancó, and columbia.\n\nLyrically, it&#8217;s cleverly charged with local Cuban slang and phrases, and describes a person who’s not impressed and can’t be fooled by fake people. “Personaje (La Rumba)” comes on the heels of Pututi and Nesty’s “Tata (La Conga),” which has gone viral on social media. — JESSICA ROIZ\n\nYng Lvcas, &#8220;LEROLE&#8221; (Yng Lvcas)\n\nMexican reggaetón and trap artist Yng Lvcas responds with &#8220;Lerole&#8221; to the controversy sparked by his previous song &#8220;Naqueto,&#8221; a diss track aimed at Mexican rapper Bogueto, in which he also mentions other figures in the Mexican urban music scene such as Bellakath and Yeri Mua. On &#8220;Lerole,&#8221; which is based on the famous song &#8220;Calabria&#8221; by Danish DJ and producer Rune Reilly Kölsch, Yng Lvcas reiterates his criticism, although this time without mentioning his colleague&#8217;s name.\n\n&#8220;I made a whole genre cry/ What am I saying, a whole genre?/ The whole circus/ Something bothered them/ And that&#8217;s not my problem/ Well, I guess it is/ But look how I&#8217;m laughing,&#8221; he sings with rhythm and style, clarifying that this one is not a diss track. — NATALIA CANO\n\nPipe Bueno, &#8220;Si Tu Boquita Fuera&#8221; (WEA Latina)\n\nPipe Bueno closes out 2025 in style with a new take on the Banda R-15 classic “Si Tu Boquita Fuera.” Inspired by the beloved Banda Machos version, Bueno stays true to his signature approach, celebrating the festive sounds of Mexican posadas, the warmth of the holiday season, and the joy of traditions and love. “Si Tu Boquita Fuera” is a song steeped in history, having accompanied countless celebrations. In Bueno&#8217;s hands, it is reborn: he honors its roots with reverence but infuses it with his own energy and style.\n\nThe impeccable production delivers a powerful blend rooted in the strength of banda music, yet enriched with a more acoustic, norteño touch, complete with accordion and drums. It&#8217;s a charming tribute to the past that feels fresh and vibrant, ensuring its legacy continues to be enjoyed by new generations. — INGRID FAJARDO\n\nCheck out more recommendations this week in our New Music Latin playlist below:",
  "contentSource": "content:encoded"
}
