{
  "id": "d174baea7c7a19b4ad2a25371f8c25094ef704ed",
  "title": "How to Watch Gloria Estefan, Andrea Bocelli & More Perform at ‘A Grammy Celebration of Latin Music’ Special for Free",
  "summary": "The two-hour special will air live on Dec. 28.",
  "canonicalUrl": "https://www.billboard.com/culture/product-recommendations/how-to-watch-a-grammy-celebration-of-latin-music-free-1236145703",
  "source": {
    "id": "billboard",
    "name": "Billboard",
    "url": "https://www.billboard.com/",
    "feedUrl": "https://www.billboard.com/feed/",
    "country": "US",
    "language": "en"
  },
  "publishedAt": "2025-12-26T19:33:11.000Z",
  "fetchedAt": "2025-12-26T20:24:37.282Z",
  "category": "entertainment",
  "tags": [
    "Culture",
    "Product Recommendations",
    "streaming"
  ],
  "image": null,
  "language": "en",
  "storagePath": "data/articles/entertainment/2025/12/26/d174baea7c7a19b4ad2a25371f8c25094ef704ed.json",
  "contentText": "All products and services featured are independently chosen by editors. However, Billboard may receive a commission on orders placed through its retail links, and the retailer may receive certain auditable data for accounting purposes.\n\nIn celebration of Latin music and its impact, a two-hour special titled A Grammy Celebration of Latin Music is set to air Sunday, Dec. 28, from 8 to 10 p.m. ET/PT on CBS. If you aren&rsquo;t able to catch it live, you can stream the event on Paramount+.\n\nNCIS &nbsp;actor and producer&nbsp; Wilmer Valderrama &nbsp;and singer-songwriter, actress and producer&nbsp; Roselyn S&aacute;nchez &nbsp;will cohost the show. The night will feature special performances from numerous Latin acts, including &Aacute;ngela Aguilar, Gloria Estefan, Luis Fonsi, Aym&eacute;e Nuviola, Prince Royce and Jon Secada. Michael Bubl&eacute;, Maren Morris, Robin Thicke and Billy Idol are also among the performers set to take the stage.\n\nThe show will also feature three collaborations &mdash; Car&iacute;n Le&oacute;n and Nuno Bettencourt, who recently released &ldquo;We Made It Look Easy/Hicimos Que Pareciera Facil&rdquo;; Thicke and Orianthi; and The Warning with Idol and Steve Stevens. The show will also include a performance by the cast of Broadway&rsquo;s&nbsp; Buena Vista Social Club , which received 10 Tony nominations this year and won four. The show is currently nominated for a Grammy for best musical show album.\n\nIf you&rsquo;re intrerested in tuning in to this special in celebration of all things Latin music, we&rsquo;ll be showing you how down below. The best part? It won&rsquo;t cost you a cent. Keep reading to find out how to watch A Grammy Celebration of Latin Music for free.\n\nHow to Watch A Grammy Celebration of Latin Music\n\nwatch A Grammy Celebration of Latin Music Free ON DIRECTV\n\nIf you&rsquo;re looking to watch the special through CBS, consider DIRECTV . All of DIRECTV &lsquo;s packages include access to CBS. However, we&rsquo;d suggest the ENTERTAINMENT package. The package is currently on sale for $49.99 a month, down from $89.99 a month . This package is for those looking to tap into a slew of entertainment-based channels. If you&rsquo;re unsure about committing to a new subscription, you can simply try the service out for free for five days , which will give you plenty of time to watch the two-hour special before canceling your subscription.\n\nWith a subscription , users will gain access to live TV, local networks such as NBC, ABC and PBS, and you can also watch various entertainment networks, including AMC, Bravo, E!, FX, FXX, Freeform, HGTV, Hallmark Channel, Lifetime and Paramount Network. That&rsquo;s more than 90-plus channels that you can tap into with the touch of a button.\n\nwatch A Grammy Celebration of Latin Music Free ON Fubo\n\nAnother way to watch the special via CBS is on Fubo , which has a weeklong free trial available here. Fubo&rsquo;s package includes a free DVR so you record the broadcast to watch all the performances back on-demand. Continue with one of Fubo&rsquo;s streaming deals or cancel before your free trial is up to avoid being charged. See details here .\n\nwatch A Grammy Celebration of Latin Music with Paramount+ Premium\n\nYou can also stream the event via Paramount+&rsquo;s Premium plan . A no-ads plan will run you $12.99 a month . The streaming service offers a seven-day free trial, which should give you plenty of time to watch the special without interruption. If you do happen to keep your subscription, which we highly recommend, you&rsquo;ll have access to a vast library of more than 40,000+ ad-free episodes and movies, including music-themed hits such as Love & Hip Hop: Miami , School of Rock , Lolla: The Story of Lollapalooza and much more. Paramount+ Premium plan holders will also be able to stream the service on three devices at once, gain access to SHOWTIME&reg; Originals, download movies and shows and Stream CBS live, with more sports and events.",
  "contentSource": "content:encoded"
}
