{
  "id": "47f293d583d9cc9915dab0b4f16c72a673bb8bd8",
  "title": "Embark on a visual voyage of art inspired by black holes",
  "summary": "Art and science converge in Lynn Gamwell's book, Conjuring the Void: The Art of Black Holes",
  "canonicalUrl": "https://arstechnica.com/science/2025/12/embark-on-a-visual-voyage-of-art-inspired-by-black-holes",
  "source": {
    "id": "arstechnica",
    "name": "Ars Technica",
    "url": "https://arstechnica.com/",
    "feedUrl": "https://feeds.arstechnica.com/arstechnica/index",
    "country": "US",
    "language": "en"
  },
  "publishedAt": "2025-12-26T16:40:40.000Z",
  "fetchedAt": "2025-12-26T18:33:04.451Z",
  "category": "tech",
  "tags": [
    "Culture",
    "Science",
    "art and science",
    "black holes",
    "books",
    "science history"
  ],
  "image": "https://cdn.arstechnica.net/wp-content/uploads/2025/10/blackhole4-1152x648-1760991049.jpg",
  "language": "en",
  "storagePath": "data/articles/tech/2025/12/26/47f293d583d9cc9915dab0b4f16c72a673bb8bd8.json",
  "contentText": "Black holes have long captured the imagination of both scientists and the general public. These exotic objects—once thought to be merely hypothetical—have also conceptually inspired countless artists all over the world. A generous sampling of such work is featured in Conjuring the Void: The Art of Black Holes .\n\nAuthor Lynn Gamwell spent ten years as director of the New York Academy of Science's Gallery of Art and Science. She has an extensive background writing about the intersection of math, art, and science. So she was a natural choice to speak at the annual conference of Harvard's interdisciplinary Black Hole Initiative a few years ago. Gamwell focused her talk on the art of black holes, and thus the seeds for what would become Conjuring the Void were sown.\n\n\"I was just astounded at how much art there is [about black holes], and I was specifically interested in Asian art,\" Gamwell told Ars. \"There's just something about the concept of a black hole that resonates with the Eastern tradition. So many of the themes—the science of black holes, void, nothingness, being inescapable—relate to the philosophy of Buddhism and Taoism and so on.\"\n\nRead full article\n\nComments",
  "contentSource": "content:encoded"
}
