{
  "id": "5a5995a70e0755dc68bc814b002e2574e1d87a27",
  "title": "Cyberpunk 2077: Ultimate Edition and other Nintendo games are up to 50 percent off",
  "summary": "Unlike the day after Thanksgiving, when people are rushing online and to the stores to look for deals, the day after Christmas is usually a time to recover from the festivities and check your budget to see how much all that gifting has cost you. However, if you’re in a shopping mood, or if you suddenly realized you forgot somebody important, there are still…",
  "canonicalUrl": "https://www.theverge.com/gadgets/850279/cyberpunk-2077-ultimate-edition-and-other-nintendo-games-are-up-to-50-percent-off",
  "source": {
    "id": "theverge",
    "name": "The Verge",
    "url": "https://www.theverge.com/",
    "feedUrl": "https://www.theverge.com/rss/index.xml",
    "country": "US",
    "language": "en"
  },
  "publishedAt": "2025-12-26T16:08:50.000Z",
  "fetchedAt": "2025-12-26T16:27:36.619Z",
  "category": "tech",
  "tags": [],
  "image": "https://platform.theverge.com/wp-content/uploads/sites/2/2025/12/cyberpunk.avif?quality=90&#038;strip=all&#038;crop=0,0,100,100",
  "language": "en",
  "storagePath": "data/articles/tech/2025/12/26/5a5995a70e0755dc68bc814b002e2574e1d87a27.json",
  "contentText": "Unlike the day after Thanksgiving, when people are rushing online and to the stores to look for deals, the day after Christmas is usually a time to recover from the festivities and check your budget to see how much all that gifting has cost you. However, if you’re in a shopping mood, or if you suddenly realized you forgot somebody important, there are still some deals out there.\n\nFor example, Nintendo is offering a bunch of its best-known games at deals ranging from 25 to 50 percent off. These include Princess Peach: Showtime ($41.99 down from $59.99), The Legend of Zelda, Echoes of Wisdom (also ($41.99 down from $59.99), Super Mario Odyssey ($39.99 down from $59.99), Cyberpunk 2077: Ultimate Edition ($39.99 down from $69.99) — and a slew of others.&nbsp;\n\nPrincess Peach: Showtime!\n\nPrincess Peach: Showtime! is the first Nintendo game to star the Mushroom Kingdom royal in nearly 20 years, and it’s a welcome return to form. Peach finds herself having to fight, puzzle, and platform her way through different sets in a community theater. Read our review .\n\nWhere to Buy:\n\n- $59.99 $49.99 at Amazon\n\n- $59.99 $41.99 at Nintendo\n\nSo if you’ve received a new Switch 2 for the holidays — or you gifted yourself one — this is a great way to start assembling your game library for the new year.\n\nOther great deals\n\nAmazon is still offering major discounts on some of its smart speakers. For example, the Amazon Echo Spot , a nifty bedside smart speaker / clock, is on sale at Amazon for $44.99 down from $79.99, the lowest price it has sold for. If you want something with a screen, the Echo Show 5 is available at Amazon for $59.99, down from $89.99, and while it’s gone down as low as $39.99 in the past, this isn’t a bad price if you want one now. Read our reviews of the Echo Spot and the Echo Show 5 .\n\nAnker’s Prime Charger is a charging station which supports 250W output via four USB-C and two USB-A ports. It’s now at its lowest price of $99.99 (down from $169.99, a savings of $70) at Amazon and at Anker (using the code WS7DV2I5IMSW).\n\nYou can still get an Apple Airtag for $19 (down from $29) at Walmart — and after all, how can you have too many of these handy trackers (our choice as best tracker for iPhone users ), especially if you’ve gotten any holiday gifts that you really don’t want to misplace? Read our original review.",
  "contentSource": "content"
}
