{
  "id": "2e159aa297de52bf34abb6857ff89ce6f31bdd9d",
  "title": "Countries to reconvene sooner to accelerate progress on WHO Pathogen Access and Benefit Sharing system negotiations",
  "summary": "WHO Member States today ended their latest round of intensive negotiations on the world’s first Pathogen Access andBenefit Sharing (PABS) system. Countries decided to resume deliberations in January in a reflection of the shared commitment and urgency needed to help make the world safer from future pandemics. Countries convened for the fourth meeting of the…",
  "canonicalUrl": "https://www.who.int/news/item/05-12-2025-countries-to-reconvene-sooner-to-accelerate-progress-on-who-pathogen-access-and-benefit-sharing-system-negotiations",
  "source": {
    "id": "who_news",
    "name": "World Health Organization - News (EN)",
    "url": "https://www.who.int/news",
    "feedUrl": "https://www.who.int/rss-feeds/news-english.xml",
    "country": "UN",
    "language": "en"
  },
  "publishedAt": "2025-12-05T18:44:42.000Z",
  "fetchedAt": "2025-12-24T00:05:45.493Z",
  "category": "health",
  "tags": [],
  "image": null,
  "language": "en",
  "storagePath": "data/articles/health/2025/12/05/2e159aa297de52bf34abb6857ff89ce6f31bdd9d.json",
  "contentText": "WHO Member States today ended their latest round of intensive negotiations on the world&rsquo;s first Pathogen Access andBenefit Sharing (PABS) system. Countries decided to resume deliberations in January in a reflection of the shared commitment and urgency needed to help make the world safer from future pandemics.\n\nCountries convened for the fourth meeting of the Intergovernmental Working Group (IGWG) on the WHO Pandemic Agreement in Geneva from 1&ndash;5 December 2025. They requested to extend the current fourth round of negotiations, agreeing to resume from 20&ndash;22 January 2026.\n\nThe World Health Assembly established the IGWG to undertake several tasks, including, as a priority, to draft and negotiate the PABS annex to the WHO Pandemic Agreement.&nbsp;Member States requested the establishment of a PABS platform to operate as a global system to share pathogens and their genetic information, along with the benefits that arise from their use, in a timely, fair and transparent way. This would pave the way for a more effective and equitable response to the next pandemic.\n\n&ldquo;As we cross the halfway mark in negotiations on the Pathogen Access and Benefit-Sharing (PABS) system, I am encouraged by the progress we&rsquo;ve made towards enabling a faster and more equitable global response to future pandemics,\" said IGWG Bureau co-chair Mr Matthew Harpur of the United Kingdom. \"Member States have demonstrated real commitment to finding common ground and bridging differences, as we work to deliver a strong PABS system by the next World Health Assembly.&rdquo;\n\nIGWG Bureau co-Chair Ambassador Tovar da Silva Nunes, of Brazil, said: &ldquo;WHO Member States have shown their dedication to finishing this important task. The progress achieved on access, benefit-sharing and core governance areas provides the foundation to move the process forward. We are confident we can build a strong and balanced PABS system that will benefit all people.&rdquo;&nbsp;\n\nWHO Director-General Dr Tedros Adhanom Ghebreyesus added: &ldquo;This is both a generational opportunity and a generational responsibility. I thank Member States and the IGWG Bureau for rising to the occasion. As we get ready to close out this year, we are in a strong position to forge consensus, finalize the draft, and prepare for adoption at next year&rsquo;s World Health Assembly. Together, we are moving toward a world that is better prepared for future pandemics.\"&nbsp;&nbsp;\n\nBefore this fourth session, the IGWG Bureau organized informal dialogues with stakeholders, including representatives from the private sector, academia, laboratories and sequence information databases. Similar focused dialogues will continue over the following weeks, in preparation for the resumed session in January. The fifth IGWG meeting will take place on 9&ndash;14 February 2026.\n\n&nbsp;",
  "contentSource": "content"
}
