{
  "id": "1601966ba83163a5afe3943645f15fa5778c9fe7",
  "title": "F1’s new engines are causing consternation over compression ratios",
  "summary": "A loophole in the rules might have given Mercedes and Red Bull a big advantage.",
  "canonicalUrl": "https://arstechnica.com/cars/2025/12/f1s-new-engines-are-causing-consternation-over-compression-ratios",
  "source": {
    "id": "arstechnica",
    "name": "Ars Technica",
    "url": "https://arstechnica.com/",
    "feedUrl": "https://feeds.arstechnica.com/arstechnica/index",
    "country": "US",
    "language": "en"
  },
  "publishedAt": "2025-12-23T15:25:38.000Z",
  "fetchedAt": "2025-12-24T00:05:19.483Z",
  "category": "tech",
  "tags": [
    "Cars",
    "Formula 1",
    "Racing"
  ],
  "image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/13_27.jpg",
  "language": "en",
  "storagePath": "data/articles/tech/2025/12/23/1601966ba83163a5afe3943645f15fa5778c9fe7.json",
  "contentText": "There's still another couple of months before the 2026 crop of F1 cars takes to the track for the first preseason test. It's a year of big change for the sport, which is adopting new power unit rules that place much more emphasis on the electric motor's contribution. The switch to the new power units was meant to attract new manufacturers to the sport, and in that regard, it has succeeded. But controversy has erupted already as loopholes appear and teams exploit them.\n\nSince 2014, F1 cars have used 1,000 hp (745 kW) power units that combine a turbocharged 1.6 L V6 gasoline engine with a pair of hybrid systems. One is the MGU-H, which recovers energy from (or deploys it to) the turbocharger's turbine; the other is a 160 hp (120 kW) MGU-K that harvests and deploys energy at the rear wheels. Starting next year, the MGU-H is gone, and the less-powerful 1.6 L V6 should generate about 536 hp (400 kW). That will be complemented by a 483 hp (350 kW) MGU-K, plus a much larger battery to supply it.\n\nAnd the new rules have already attracted new OEMs to the sport. After announcing its departure at the end of 2021—sort of— Honda changed its mind and signed on to the 2026 regs , supplying Aston Martin. Audi signed up and bought the Sauber team. Red Bull decided to build its own internal combustion engines, hiring heavily from the Mercedes program, but Ford is providing Red Bull with the MGU-K and the rest of the hybrid system. And Cadillac has started an engine program, albeit one that won't take the grid until 2029.\n\nRead full article\n\nComments",
  "contentSource": "content:encoded"
}
