{
  "id": "38ae72d9972195fe3dba30db7409143df3ed5d71",
  "title": "Leaked Avengers: Doomsday teaser is now public",
  "summary": "It's purportedly the first of four planned teasers, one per week, showing before Avatar: Fire and Ash.",
  "canonicalUrl": "https://arstechnica.com/culture/2025/12/steve-rogers-returns-in-avengers-doomsday-teaser",
  "source": {
    "id": "arstechnica",
    "name": "Ars Technica",
    "url": "https://arstechnica.com/",
    "feedUrl": "https://feeds.arstechnica.com/arstechnica/index",
    "country": "US",
    "language": "en"
  },
  "publishedAt": "2025-12-23T19:45:32.000Z",
  "fetchedAt": "2025-12-24T00:05:19.483Z",
  "category": "tech",
  "tags": [
    "Culture",
    "Avengers: Doomsday",
    "entertainment",
    "film trailers",
    "marvel studios",
    "MCU Phase Six",
    "Trailers"
  ],
  "image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/avengers-1152x648.jpg",
  "language": "en",
  "storagePath": "data/articles/tech/2025/12/23/38ae72d9972195fe3dba30db7409143df3ed5d71.json",
  "contentText": "You've no doubt heard some version of the Robert Burns adage about the best-laid plans. Marvel Studios had an elaborate marketing plan in place to introduce four teaser trailers for Avengers: Doomsday as previews prior to screenings of Avatar: Fire and Ash , with one teaser rolling out each successive week. But the first one leaked online a few days early, revealing that (as rumored) Steve Rogers/Captain America (Chris Evans) will appear and will have a newborn baby, presumably with Hayley Atwell's Peggy Carter.\n\nSo maybe you've seen a bootleg version floating around the Internet, but Marvel has now released the HD version to the public. Merry Christmas! And we can look forward to three more: one focused on Thor, one on Doctor Doom, and the final one is purportedly a more traditional teaser trailer.\n\nAs previously reported , Marvel Studios originally planned to build its Phase Six Avengers arc ( The Kang Dynasty ) around Jonathan Majors’ Kang the Conqueror (and associated variants), introduced in Loki and Ant-Man and the Wasp: Quantumania . But then Majors was convicted of domestic violence, and Marvel fired the actor soon after. That meant the studio needed to retool its Phase Six plans, culminating in the announced return of the Russo brothers, who directed four of the Marvel Cinematic Universe’s most successful films, which brought in more than $6 billion at the global box office.\n\nRead full article\n\nComments",
  "contentSource": "content:encoded"
}
