{
  "id": "236df437d671f42559f0b2a44f82c5c2db6b7a6a",
  "title": "Bizarrap & J Balvin Drop Vallenato-Tinged Collaboration ‘BZRP Music Session #62/66’: Stream It Here",
  "summary": "The Argentine hitmaker teams up with the Colombian reggaetón trailblazer for the first time.",
  "canonicalUrl": "https://www.billboard.com/music/latin/bizarrap-j-balvin-bzrp-music-sessions-62-stream-it-here-1236146104",
  "source": {
    "id": "billboard",
    "name": "Billboard",
    "url": "https://www.billboard.com/",
    "feedUrl": "https://www.billboard.com/feed/",
    "country": "US",
    "language": "en"
  },
  "publishedAt": "2025-12-27T00:23:12.000Z",
  "fetchedAt": "2025-12-27T01:19:38.252Z",
  "category": "entertainment",
  "tags": [
    "Latin",
    "Music",
    "genre latin"
  ],
  "image": null,
  "language": "en",
  "storagePath": "data/articles/entertainment/2025/12/27/236df437d671f42559f0b2a44f82c5c2db6b7a6a.json",
  "contentText": "After months of speculation and years of anticipation, Bizarrap and J Balvin have finally joined forces for “BZRP Music Sessions #62/66” on Friday (Dec. 26), closing out the year on a high note.\n\nClocking in at just over three minutes, the track showcases Balvin&#8217;s romantic side over a vallenato-tinged production with a splash of EDM, courtesy of Bizarrap. &#8220; Siento que tu nombre está en todos mis pensamientos/ No te puedo ver pero estás como el viento &#8221; (&#8220;I feel like your name is in all of my thoughts/ I can’t see you but you’re like the wind&#8221;), the Medellín artist belts out, donning a dapper blue suit.\n\nThe Argentine producer and the Colombian reggaetón superstar announced the unexpected collaboration on Christmas Day with a playful photo posted on social media. The snapshot, where both artists hold sneakers as if they were phones, was captioned, “BZRP Music Session #62. Mañana. Feliz Navidad,” immediately igniting fan excitement.\n\nThis union also carries historical weight, subtly reminding to Balvin’s complicated past with Bizarrap, specifically 2022’s “BZRP Music Session #49” with Residente . The nearly 10-minute diss track famously targeted the Colombian superstar, fueling debates across the Latin music world. Now, with Session #62/66, Balvin appears to turn the page, using the platform to reflect on his resilience and personal growth.\n\nThis release comes just days after another public moment of introspection and reconciliation: J Balvin’s surprise appearance during Bad Bunny’s final Debí Tirar Más Fotos World Tour show in Mexico City. The two artists, who had a falling out in 2022 partly due to the Latin Grammys controversy, shared a heartfelt moment, exchanged apologies, and performed hits from their 2019 collaborative Oasis album for the first time in years.\n\nFueled by his viral collabs with artists like Shakira , Daddy Yankee , and Peso Pluma , Bizarrap keeps building hype with every session he drops.\n\nWatch Bizarrap and J Balvin’s “BZRP Music Sessions #62” above.",
  "contentSource": "content:encoded"
}
