{
  "id": "23b9415d686896b4472ac4c8c588d88c946299c9",
  "title": "Pop-Tarts Bowl 2025: How to Watch BYU vs. Georgia Tech Online for Free",
  "summary": "The 2025 Pop-Tarts Bowl kicks off at 3:30 pm ET on Saturday, Dec. 27.",
  "canonicalUrl": "https://www.billboard.com/culture/product-recommendations/pop-tarts-bowl-2025-byu-georgia-tech-watch-online-1236145784",
  "source": {
    "id": "billboard",
    "name": "Billboard",
    "url": "https://www.billboard.com/",
    "feedUrl": "https://www.billboard.com/feed/",
    "country": "US",
    "language": "en"
  },
  "publishedAt": "2025-12-27T17:14:52.000Z",
  "fetchedAt": "2025-12-27T17:19:50.355Z",
  "category": "entertainment",
  "tags": [
    "Culture",
    "Product Recommendations",
    "NCAA",
    "NOADS",
    "sports",
    "streaming"
  ],
  "image": "https://www.billboard.com/wp-content/uploads/2024/11/directv-stream.png?w=512&#038;h=512&#038;crop=1",
  "language": "en",
  "storagePath": "data/articles/entertainment/2025/12/27/23b9415d686896b4472ac4c8c588d88c946299c9.json",
  "contentText": "All products and services featured are independently chosen by editors. However, Billboard may receive a commission on orders placed through its retail links, and the retailer may receive certain auditable data for accounting purposes.\n\nThe 2025 Pop-Tarts Bowl is here and bringing with a hard-hitting match up between No. 12 BYU Cougars vs. No. 22 Georgia Tech Yellow Jackets. While missing their chance to make College Football Playoffs after losing in the Big 12 championship game earlier this month, the Cougars could still clinch their first 12-win season since 2001 with a victory this Saturday, Dec. 27. The Yellow Jackets, on the other hand, are fighting for their first 10-win season since 2011.\n\nHow to Watch the BYU vs. Georgia Tech Pop-Tarts Bowl, at a Glance:\n\n- Kickoff: Saturday, 3:30 p.m. ET\n\n- Where: Camping World Stadium\n\n- Broadcast: ABC\n\n- Stream: DirecTV , Fubo , Sling TV , Hulu + Live TV\n\nWant to stream the Pop-Tarts Bowl online for free and without cable? Keep reading our guide below.\n\nWhere to Watch&nbsp;NCAA Football&nbsp;for Free\n\nFor cord-cutters, there are a few ways to watch the BYU vs. Georgia Tech Pop-Tarts Bowl, if you don&#8217;t have cable, especially if you want to watch for free. DirecTV has a five-day free trial , while other streaming services, such as Fubo , also offer free trials, so you can watch your favorite teams play for free.\n\nDirecTV\n\nGet Five-Day Free Trial\n\nSign up here.\n\nA subscription to DirecTV &#8212;&nbsp;which comes with ABC, ACC Network, Big Ten Network, CBS, CBS Sports Network, The CW, ESPN, ESPN2, ESPNU, Fox, Fox Sports, NBC, SEC Network and truTV &#8212; gets you access to live TV, local and cable channels, starting at $49.99 for the first month $89.99 per month afterwards. The service even offers a five-day free trial to watch for free, if you sign up now.\n\nYou can watch local networks such as PBS, while you can also watch many cable networks, including Lifetime, FX, AMC, A&E, Bravo, BET, MTV, Paramount Network, Cartoon Network, VH1, Fuse, CNN, Food Network, CNBC and many others.\n\nFuboTV\n\nGet Five-Day Free Trial\n\nSign up here.\n\nTo watch the Pop-Tarts Bowl, Fubo starts at $54.99 for the first month of service $84.99 per month afterwards with nearly 235 channels &#8212; including local and cable &#8212; that are streamable on smart TVs, smartphones, tablets and on web browsers. And with a seven-day free trial , you can watch for free, if you act fast and sign up now.\n\nThe service even gets you live access to local broadcast networks including ABC, CBS, Fox and NBC, while it also has dozens of cable networks, such as ACC Network, Big Ten Network, CBS Sports Network, The CW, ESPN, ESPN2, ESPNU, Fox Sports, SEC Network and truTV and much more.\n\nSling TV\n\nGet Sling TV\n\nSign up here.\n\nWith prices starting at just $4.99 for a day pass, Sling TV includes ESPN, ESPN2 and ESPN 3 (for ABC simucast) with it Sling Orange and Sling Orange + Blue packages &#8212; which features dozens of channels that can be streamed on up to three devices at the same time. Sling Orange + Blue features FS1 and the NFL Network too.\n\nHulu + Live TV\n\nGet three-day free trial\n\nSign up here.\n\nFor the most content options, Hulu + Live TV gives you access to the entire Hulu library in addition to more than 95 live TV channels &#8212; including ESPN and ABC for just $82.99 per month.\n\nAnd, unlike the rest of the options, you can also expand your content library by bundling Hulu + Live TV with Disney+ and ESPN Unlimited . You&#8217;ll not only have all of the Hulu library to watch, but also exclusive and original programming available exclusively on ESPN Unlimited .",
  "contentSource": "content:encoded"
}
