{
  "id": "42601916c20a7bdfc5c179f1c7effa53706bc761",
  "title": "Daddy Yankee to Ring In 2026 With ‘Dick Clark’s New Year’s Rockin’ Eve’ & More Uplifting Moments in Latin Music",
  "summary": "Plus, Latin stars like Fuerza Regida and Elena Rose spread holiday cheer by giving back this Christmas.",
  "canonicalUrl": "https://www.billboard.com/music/latin/daddy-yankee-dick-clarks-new-years-rockin-eve-uplifting-1236146236",
  "source": {
    "id": "billboard",
    "name": "Billboard",
    "url": "https://www.billboard.com/",
    "feedUrl": "https://www.billboard.com/feed/",
    "country": "US",
    "language": "en"
  },
  "publishedAt": "2025-12-27T17:24:49.000Z",
  "fetchedAt": "2025-12-27T18:31:36.829Z",
  "category": "entertainment",
  "tags": [
    "Latin",
    "Music",
    "genre latin",
    "Music News",
    "News"
  ],
  "image": null,
  "language": "en",
  "storagePath": "data/articles/entertainment/2025/12/27/42601916c20a7bdfc5c179f1c7effa53706bc761.json",
  "contentText": "From career milestones to new music releases to major announcements and those little important moments,&nbsp; Billboard&nbsp; editors highlight uplifting moments in Latin music. Here’s what happened in the Latin music world this week.\n\nDY & More Stars to Ring 2026 with &#8216;Dick Clark&#8217;s New Year&#8217;s Rockin&#8217; Eve&#8217;\n\nDaddy Yankee will join Dick Clark’s New Year’s Rockin’ Eve With Ryan Seacrest 2026 for a live celebration from Puerto Rico. The reggaetón superstar will be joined by host Roselyn Sánchez. The event — which airs live Wednesday (Dec. 31) at 8 p.m. ET on ABC, Hulu (next-day streaming), and iHeartRadio stations — will feature performances from various iconic locations.\n\nRyan Seacrest and Rita Ora will host from Times Square, with a headlining performance by legend Diana Ross. Additional artists include Ciara, LE SSERAFIM, Little Big Town, and Maren Morris. Chance the Rapper will co-host and perform from Chicago alongside Jamila Woods. Rob Gronkowski and Julianne Hough will handle hosting duties in Las Vegas, with performances by artists like 50 Cent, Demi Lovato and Charlie Puth.\n\nThe west coast lineup features stars including Mariah Carey, Zara Larsson, New Kids on the Block and DJ Cassidy’s Pass the Mic Live! featuring artists like Busta Rhymes and Wyclef Jean. Other notable artists include Post Malone in Nashville and Chappell Roan in Kansas City. Pitbull, 4 Non Blondes and many more are also set to take the mic. Check out the full lineup here .\n\nView this post on Instagram\n\nElena Rose Spreads Holiday Cheer to Migrant Families\n\nElena Rose visited the Redland Center of Homestead Housing to support Harvesting Hope in their mission to assist more than 1,500 diverse migrant families across four agricultural camps. The organization provides resources for children and their families, including school supplies, health services, scholarships and opportunities for academic growth and post-secondary education. Her contribution helps amplify these efforts, spreading holiday joy and making a difference in these communities. &#8220;We collected 300 gifts. Join us in delivering them to children from immigrant families in need,&#8221; she wrote on her Instagram.\n\nView this post on Instagram\n\nFuerza Regida Organize Massive Toy Drive for Kids\n\nFuerza Regida gave back to their hometown of San Bernardino by organizing a massive toy drive for children in need. The band showed up at El Super grocery store on Mount Vernon Ave. to personally deliver a semi-truck full of toys, reportedly valued at over $250,000. Hundreds of children, ages 3 and up, lined up to receive the gifts. The band shared a video of the heartwarming event on social media, capturing the joy of the families and children who attended.\n\nView this post on Instagram",
  "contentSource": "content:encoded"
}
