{
  "id": "d6b25adca79445f439df3e04c64bf1f07a65b2ef",
  "title": "NLE Choppa Reveals Engagement in Holiday Instagram Post",
  "summary": "Choppa captioned the post simply, “Now That’s Gangsta,” removing all other images from his feed shortly afterward.",
  "canonicalUrl": "https://www.billboard.com/music/rb-hip-hop/nle-choppr-engagement-1236146229",
  "source": {
    "id": "billboard",
    "name": "Billboard",
    "url": "https://www.billboard.com/",
    "feedUrl": "https://www.billboard.com/feed/",
    "country": "US",
    "language": "en"
  },
  "publishedAt": "2025-12-27T06:53:04.000Z",
  "fetchedAt": "2025-12-27T07:20:41.649Z",
  "category": "entertainment",
  "tags": [
    "Music",
    "R&B/Hip-Hop",
    "genre rap",
    "Music News"
  ],
  "image": null,
  "language": "en",
  "storagePath": "data/articles/entertainment/2025/12/27/d6b25adca79445f439df3e04c64bf1f07a65b2ef.json",
  "contentText": "NLE Choppa has announced his engagement to Erica Ravén, sharing proposal photos on Instagram during the holiday season following months of public attention.\n\nNLE Choppa has announced his engagement to Erica Ravén, sharing the news via Instagram during the holiday period and shifting the spotlight from recent rap headlines to a major personal milestone.\n\nThe Memphis rapper revealed the proposal through a short series of photos posted to his Instagram account, showing him down on one knee presenting a diamond engagement ring. In the opening image, Ravén appears visibly surprised as the proposal unfolds, while a subsequent photo shows her holding up the ring.\n\nChoppa captioned the post simply, “Now That’s Gangsta,” removing all other images from his feed shortly afterward.\n\nThe announcement quickly spread across social media, with fans and peers offering congratulations as the images circulated. While Choppa has not shared further details about the proposal, the understated post marked a clear pivot in tone for the artist as the year comes to a close.\n\nRumors that Choppa and Ravén were romantically involved only began circulating publicly in recent months. In October, the pair shared affectionate posts online, including a photo together that fueled speculation about their relationship.\n\nWeeks earlier, Choppa reposted an Instagram Story originally shared by Ravén showing the two kissing, though neither addressed the attention at the time.\n\nThe engagement news arrives following a period where Choppa’s name was frequently in headlines for reasons unrelated to his personal life.\n\nIn recent months, the rapper had been engaged in a public back-and-forth with NBA YoungBoy, releasing tracks including “KO” and “Hello Revenge” that referenced concerns about influence and accountability within hip-hop. The tension escalated into a brief confrontation involving members of YoungBoy’s camp in Houston, though no further incidents have been reported.\n\nView this post on Instagram",
  "contentSource": "content:encoded"
}
