{
  "id": "e8ee21cb2be330ab0b2abd47e2b1792e87938cd2",
  "title": "Kennedy Center President to ‘Seek $1 Million in Damages’ From Jazz Musician Who Called Off Christmas Eve Show",
  "summary": "Chuck Redd chose to cancel the holiday \"Jazz Jams\" performance after Donald Trump's name was added to the venue.",
  "canonicalUrl": "https://www.billboard.com/business/legal/kennedy-center-president-chuck-redd-lawsuit-letter-trump-1236146270",
  "source": {
    "id": "billboard",
    "name": "Billboard",
    "url": "https://www.billboard.com/",
    "feedUrl": "https://www.billboard.com/feed/",
    "country": "US",
    "language": "en"
  },
  "publishedAt": "2025-12-27T19:02:18.000Z",
  "fetchedAt": "2025-12-27T19:18:03.362Z",
  "category": "entertainment",
  "tags": [
    "Business",
    "Legal News",
    "Legal",
    "Music News",
    "News"
  ],
  "image": "https://www.billboard.com/wp-content/uploads/2025/12/Donald-Trump-2026-hat-billboard-1800.jpg?w=237&#038;h=147&#038;crop=1",
  "language": "en",
  "storagePath": "data/articles/entertainment/2025/12/27/e8ee21cb2be330ab0b2abd47e2b1792e87938cd2.json",
  "contentText": "The president of the Kennedy Center on Friday (Dec. 26) fiercely criticized a musician’s sudden decision to&nbsp;cancel a Christmas Eve performance&nbsp;at the venue days after the White House announced that President Donald Trump’s&nbsp;name would be added&nbsp;to the facility.\n\nRelated\n\nKennedy Center Board Votes to Rename Washington D.C. Landmark After President&nbsp;Trump\n\nMusicians Who&#8217;ve Called Out the Donald Trump Administration for Using Their Music in&nbsp;2025\n\nPeter Criss Shares What Ace Frehley Told Him About KISS&#8217; Kennedy Center Honors Before His&nbsp;Passing\n\n“Your decision to withdraw at the last moment — explicitly in response to the Center’s recent renaming, which honors President Trump’s extraordinary efforts to save this national treasure — is classic intolerance and very costly to a non-profit Arts institution,” the venue’s president, Richard Grenell, wrote in a&nbsp;letter &nbsp;to musician Chuck Redd that was shared with The Associated Press .\n\nIn the letter, Grenell said he would seek $1 million in damages “for this political stunt.”\n\nRedd did not immediately respond to a request for comment.\n\nA drummer and vibraphone player, Redd has presided over holiday “Jazz Jams” at the Kennedy Center since 2006, succeeding bassist William “Keter” Betts. In an email Wednesday to The Associated Press , Redd said he pulled out of the concert in the wake of the renaming.\n\n“When I saw the name change on the Kennedy Center website and then hours later on the building, I chose to cancel our concert,” Redd said. He added Wednesday that the event has been a “very popular holiday tradition” and that he often featured at least one student musician.\n\n“One of the many reasons that it was very sad to have had to cancel,” he told the AP .\n\nPresident John F. Kennedy was assassinated in 1963, and Congress passed a law the following year naming the center as a living memorial to him.\n\nGrenell is a Trump ally whom the president chose to head the Kennedy Center after he forced out the previous leadership. According to the White House, Trump’s handpicked board approved the&nbsp;renaming, which scholars have said violates the law. Kennedy niece Kerry Kennedy has vowed to remove Trump’s name from the building once he leaves office, and former House historian Ray Smock is among those who say any changes would have to be approved by Congress.\n\nThe law explicitly prohibits&nbsp;the board of trustees from making the center into a memorial to anyone else, and from putting another person’s name on the building’s exterior.",
  "contentSource": "content:encoded"
}
