{
  "id": "fbc9683a9a654452b0ef17022acf9f6b79572401",
  "title": "Harry Styles Quietly Releases Surprise ‘Forever, Forever’ Music Video",
  "summary": "The clip shows his performance of the song from his final Love On Tour concert in 2023.",
  "canonicalUrl": "https://www.billboard.com/music/music-news/harry-styles-forever-forever-video-1236146277",
  "source": {
    "id": "billboard",
    "name": "Billboard",
    "url": "https://www.billboard.com/",
    "feedUrl": "https://www.billboard.com/feed/",
    "country": "US",
    "language": "en"
  },
  "publishedAt": "2025-12-27T20:59:57.000Z",
  "fetchedAt": "2025-12-27T21:19:51.425Z",
  "category": "entertainment",
  "tags": [
    "Music",
    "Music News",
    "genre pop",
    "News"
  ],
  "image": "https://www.billboard.com/wp-content/uploads/2025/08/harry-styles-pavillon-des-folies-2024-billboard-1800.jpg?w=237&#038;h=147&#038;crop=1",
  "language": "en",
  "storagePath": "data/articles/entertainment/2025/12/27/fbc9683a9a654452b0ef17022acf9f6b79572401.json",
  "contentText": "Just ahead of the new year, Harry Styles has released new music content for the first time in more than two years. On Saturday (Dec. 27), the pop superstar and former member of One Direction gifted fans with an official video for &#8220;Forever, Forever&#8221; &#8212; an instrumental song he debuted live on piano in Reggio Emilia, Italy, on July 22, 2023, his last concert on the Love On Tour.\n\nRelated\n\n&#8216;Sending Lots of Love&#8217;: Harry Styles Records Sweet Video for Fan Going Through a &#8216;Tough&nbsp;Time&#8217;\n\nLouis Tomlinson and Zayn Malik to Reunite in Upcoming Netflix Road Trip&nbsp;Docuseries\n\nOlivia Rodrigo Recalls Hanging Out With Harry Styles After Writing One Direction FanFic as a&nbsp;Child\n\nThe video embraces nostalgia for the tour and the community Styles has built. It opens with two-and-a-half minutes of artful footage of fans queued outside RCF Arena, where they&#8217;d get to experience Styles&#8217; final show of the tour, a two-year trek that grossed $617 million and sold more than 5 million tickets.\n\nMoments captured: friends braiding each other&#8217;s hair, reveling in securing tickets, dancing together with synchronized footwork, and admitting they feel &#8220;some sadness because it is the last show&#8230; then he will disappear.&#8221;\n\nThey debate what Styles should wear, whether it be dungarees or a suit with jacket &#8212; something &#8220;a little bit elegant.&#8221; One fan chimes in, &#8220;Better shirtless, sorry.&#8221;\n\nAnd finally, they&#8217;re in, they&#8217;re having the time of their lives, and they&#8217;re unaware of what&#8217;s to come as the piano Styles would play &#8220;Forever, Forever&#8221; on is wheeled out on stage. Styles tells the crowd he wrote this song for them. It&#8217;s a song never before heard, an extra encore just for this audience.\n\nThe video ends with a message displayed on screen: &#8220;WE BELONG TOGETHER.&#8221;\n\nThough it&#8217;s not a part of the &#8220;Forever, Forever&#8221; video release, that July night in Italy, Styles gave a heartfelt speech to his fans.\n\n“I don’t get to do this if you guys don’t come,” he said. “I know that more than anyone else. You guys being here tonight, I know you wanted to make it special for me. You make it special for me every single night.”\n\n“The atmosphere that you have created, the family that you have created, this safe space that you have created. I want to thank you for everything,&#8221; Styles added.\n\n“I know feeling so incredibly small in this world it can be really, really difficult to feel like anything you can do can make a difference. I promise you, I see it all the time in the little things that you do and the way that you treat each other. How it has affected all the people around me, how it has affected people out there, it is so much bigger. It does not end when this tour ends. I want you to continue it. Put love out into the world. It needs it a bit right now,&#8221; Styles said at the time.\n\nHis last music video release came in the spring of 2023, when he dropped the visual for the fourth and final Harry&#8217;s House single, &#8220;Satellite.&#8221; Studio album Harry&#8217;s House had arrived a year prior, in 2022, and held two weeks at No. 1 on the Billboard 200.\n\nWatch the &#8220;Forever, Forever&#8221; video below.",
  "contentSource": "content:encoded"
}
