{
  "id": "a334439a028063b751cbd5655c0940bd3ec1f610",
  "title": "WHO issues guidance to address drastic global health financing cuts",
  "summary": "The World Health Organization (WHO) today released new guidance for countries on ways to counter the immediate and long-term effects of sudden and severe cuts to external funding, which are disrupting the delivery of essential health services in many countries. The new guidance, called “Responding to the health financing emergency: immediate measures and lo…",
  "canonicalUrl": "https://www.who.int/news/item/03-11-2025-who-issues-guidance-to-address-drastic-global-health-financing-cuts",
  "source": {
    "id": "who_news",
    "name": "World Health Organization - News (EN)",
    "url": "https://www.who.int/news",
    "feedUrl": "https://www.who.int/rss-feeds/news-english.xml",
    "country": "UN",
    "language": "en"
  },
  "publishedAt": "2025-11-02T17:10:14.000Z",
  "fetchedAt": "2025-12-24T00:05:45.493Z",
  "category": "health",
  "tags": [],
  "image": null,
  "language": "en",
  "storagePath": "data/articles/health/2025/11/02/a334439a028063b751cbd5655c0940bd3ec1f610.json",
  "contentText": "The World Health Organization (WHO) today released new guidance for countries on ways to counter the immediate and long-term effects of sudden and severe cuts to external funding, which are disrupting the delivery of essential health services in many countries.\n\nThe new guidance, called &ldquo;Responding to the health financing emergency: immediate measures and longer-term shifts&rdquo;, provides a suite of policy options for countries to cope with the sudden financing shocks, and bolster efforts to mobilize and implement sufficient and sustainable financing for national health systems.\n\nExternal health aid is projected to drop by 30% to 40% in 2025 compared with 2023, causing immediate and severe disruption to health services in low- and middle-income countries (LMICs). WHO survey data from 108 LMICs collected in March 2025 indicate that funding cuts have reduced critical services &ndash; including maternal care, vaccination, health emergency preparedness and response, and disease surveillance &ndash; by up to 70% in some countries. More than 50 countries have reported job losses among health and care workers, along with major disruptions to health worker training programmes.\n\n&ldquo;Sudden and unplanned cuts to aid have hit many countries hard, costing lives and jeopardizing hard-won health gains,&rdquo; said Dr Tedros Adhanom Ghebreyesus, WHO Director-General. &ldquo;But in the crisis lies an opportunity for countries to transition away from aid dependency towards sustainable self-reliance, based on domestic resources. WHO&rsquo;s new guidance will help countries to better mobilize, allocate, prioritize and use funds to support the delivery of health services that protect the most vulnerable.&rdquo;\n\nThis year&rsquo;s funding cuts have compounded years of persistent health financing challenges for countries, including rising debt burdens, inflation, economic uncertainty, high out-of-pocket spending, systemic budget underfunding and heavy reliance on external aid.\n\nSwift action guided by efficiency and equity &nbsp;&nbsp;\n\nWHO&rsquo;s new guidance urges policy-makers to make health a political and fiscal priority in government budgets even during times of crisis, seeing health spending as not merely a cost to be contained, but an investment in social stability, human dignity, and economic resilience.&nbsp;\n\nThe guidance emphasizes the need for countries to cushion the immediate impact of reductions in foreign assistance for health, and to adapt to a new era of reduced assistance. Key policy recommendations include:\n\n- prioritize the health services accessed by the poorest;\n\n- protect health budgets and essential health services;\n\n- improve efficiency through better procurement, reduced overheads and strategic purchasing;\n\n- integrate externally-funded or disease-specific services into comprehensive PHC-based delivery models; and\n\n- use health technology assessments to prioritize services and products that have the greatest health impact per dollar spent.\n\nCountry leadership and global solidarity are critical\n\nSeveral countries have already taken decisive action to strengthen their health systems and protect essential health services:\n\n- Kenya, Nigeria and South Africa have allocated additional budget funds to health, or are awaiting parliamentary approval for increases;\n\n- Nigeria increased its health budget by US$ 200 million to offset aid shortfalls, with increased allocations for immunization, epidemic response, and priority programmes;\n\n- Ghana lifted the cap on excise tax earmarked for its national health insurance agency, resulting in a 60% budget increase. The country also launched &ldquo;the Accra Reset&rdquo;, a bold framework to reimagine global governance, financing and partnerships in health and development; and\n\n- Uganda has outlined a clear policy agenda for integration of health services and programmes, aiming to improve efficiency and sustain service delivery.\n\nThe new guidance builds on WHO&rsquo;s commitment to help all countries strengthen and sustain robust health systems, built on a commitment to universal health coverage, underpinned by strong primary health services delivering essential care to all who need it.\n\nIt also aligns with existing World Health Assembly mandates, including resolutions on &ldquo;Strengthening health financing globally&rdquo; and &ldquo;Economics of health for all,&rdquo; to translate global commitments into actionable policy steps. WHO and its partners are committed to providing technical support, analytics and peer learning to countries to manage the health financing crises and navigate the transition, including through the new UHC Knowledge Hub, a partnership with the Government of Japan and the World Bank, set to be launched in December 2025.&nbsp;",
  "contentSource": "content"
}
